     /**
      * This file is part of i5/OS Programmer's Toolkit.
      *
      * Copyright (C) 2010, 2011  Junlei Li.
      *
      * i5/OS Programmer's Toolkit is free software: you can redistribute it and/or modify
      * it under the terms of the GNU General Public License as published by
      * the Free Software Foundation, either version 3 of the License, or
      * (at your option) any later version.
      *
      * i5/OS Programmer's Toolkit is distributed in the hope that it will be useful,
      * but WITHOUT ANY WARRANTY; without even the implied warranty of
      * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
      * GNU General Public License for more details.
      *
      * You should have received a copy of the GNU General Public License
      * along with i5/OS Programmer's Toolkit.  If not, see <http://www.gnu.org/licenses/>.
      */

     /**
      * @file ept54.rpgleinc
      *
      * Offsets of SEPT entries
      */

      /if not defined(i5toolkit_rpg_ept54)
      /define i5toolkit_rpg_ept54

     d EPT_QT3REQIO    c                   x'0001'
     d EPT_QWSCLOSE    c                   x'0002'
     d EPT_QSFGET      c                   x'0003'
     d EPT_QWSOPEN     c                   x'0004'
     d EPT_QWSPBDVR    c                   x'0005'
     d EPT_QWSRST      c                   x'0006'
     d EPT_QWSRTSFL    c                   x'0007'
     d EPT_QSFCRT      c                   x'0008'
     d EPT_QWSSPEND    c                   x'0009'
     d EPT_QDCVRX      c                   x'000A'
     d EPT_QDMCLOSE    c                   x'000B'
     d EPT_QDMCOPEN    c                   x'000C'
     d EPT_QDBCLOSE    c                   x'000D'
     d EPT_QDBGETDR    c                   x'000E'
     d EPT_QDBGETKY    c                   x'000F'
     d EPT_QDBGETSQ    c                   x'0010'
     d EPT_QDBOPEN     c                   x'0011'
     d EPT_QDBPUT      c                   x'0012'
     d EPT_QDBUDR      c                   x'0013'
     d EPT_QSPBPPRT    c                   x'0014'
     d EPT_QOESETEX    c                   x'0015'
     d EPT_QWSPUT      c                   x'0016'
     d EPT_QWSMEEH     c                   x'0017'
     d EPT_QWSMSG      c                   x'0018'
     d EPT_QWSPTMSG    c                   x'0019'
     d EPT_QLPCTLIN    c                   x'001A'
     d EPT_QLPTRANS    c                   x'001B'
     d EPT_QWCITUNR    c                   x'001C'
     d EPT_QTIMAIN1    c                   x'001D'
     d EPT_QBSGET      c                   x'001E'
     d EPT_QTIEXIT     c                   x'001F'
     d EPT_QTISEND1    c                   x'0020'
     d EPT_QTIINQR1    c                   x'0021'
     d EPT_QTIRCV      c                   x'0022'
     d EPT_QTICONCT    c                   x'0023'
     d EPT_QTICLNUP    c                   x'0024'
     d EPT_QTIHNPCS    c                   x'0025'
     d EPT_QTIPARSE    c                   x'0026'
     d EPT_QBSPUT      c                   x'0027'
     d EPT_QPZCPFIU    c                   x'0028'
     d EPT_QDMLOCK     c                   x'0029'
     d EPT_QDMPASS     c                   x'002A'
     d EPT_QDMUNLCK    c                   x'002B'
     d EPT_QDCCKFL     c                   x'002C'
     d EPT_QSPBPDSK    c                   x'002D'
     d EPT_QMHUNMSG    c                   x'002E'
     d EPT_QSPCLOSE    c                   x'002F'
     d EPT_QSPOPEN     c                   x'0030'
     d EPT_QMHPDEH     c                   x'0031'
     d EPT_QSYCAUDR    c                   x'0032'
     d EPT_QLINEPTE    c                   x'0033'
     d EPT_QWSGET      c                   x'0034'
     d EPT_QPZSAVF     c                   x'0035'
     d EPT_QWSDSMSG    c                   x'0036'
     d EPT_QSFPUT      c                   x'0037'
     d EPT_QDMACQDP    c                   x'0038'
     d EPT_QWSSFLCT    c                   x'0039'
     d EPT_QTAGET      c                   x'003A'
     d EPT_QTAPUT      c                   x'003B'
     d EPT_QDKGET      c                   x'003C'
     d EPT_QDKPUT      c                   x'003D'
     d EPT_QBSPUTCP    c                   x'003E'
     d EPT_QDMNODEV    c                   x'003F'
     d EPT_QPQYPLNZ    c                   x'0040'
     d EPT_QSIINASP    c                   x'0041'
     d EPT_QDMACQDV    c                   x'0042'
     d EPT_QDMDELOV    c                   x'0043'
     d EPT_QDMGETOV    c                   x'0044'
     d EPT_QDMIFERR    c                   x'0045'
     d EPT_QDMOVERD    c                   x'0046'
     d EPT_QDMRLSDV    c                   x'0047'
     d EPT_QDMTCLSE    c                   x'0048'
     d EPT_QJOJNMNU    c                   x'0049'
     d EPT_QLICNV      c                   x'004A'
     d EPT_QLILIST     c                   x'004B'
     d EPT_QWCSCDFR    c                   x'004C'
     d EPT_QWCSCVDR    c                   x'004D'
     d EPT_QWCSCVTR    c                   x'004E'
     d EPT_QWCSRTLR    c                   x'004F'
     d*EPT_QLINEPTE    c                   x'0050'
     d EPT_QWCSVRDR    c                   x'0051'
     d EPT_QWCSVRTR    c                   x'0052'
     d EPT_QDCVRN      c                   x'0053'
     d EPT_QWCCCRVC    c                   x'0054'
     d EPT_QWCCCHVC    c                   x'0055'
     d EPT_QWCCRCRC    c                   x'0056'
     d EPT_QWSUIEH     c                   x'0057'
     d EPT_QTACLOSE    c                   x'0058'
     d EPT_QDBCHGFI    c                   x'0059'
     d EPT_QTAEOV      c                   x'005A'
     d EPT_QTAERR      c                   x'005B'
     d EPT_QTAFEOD     c                   x'005C'
     d EPT_QTAOPEN     c                   x'005D'
     d EPT_QDBCHGFR    c                   x'005E'
     d EPT_QLPBATIN    c                   x'005F'
     d EPT_QDKCLOSE    c                   x'0060'
     d EPT_QDKFEOD     c                   x'0061'
     d EPT_QDKOPEN     c                   x'0062'
     d EPT_QCOVLFLD    c                   x'0063'
     d EPT_QDCCKCLW    c                   x'0064'
     d EPT_QDCPTCA     c                   x'0065'
     d EPT_QDCVRL      c                   x'0066'
     d EPT_QDCVRC      c                   x'0067'
     d EPT_QDCVRD      c                   x'0068'
     d EPT_QUIFDATA    c                   x'0069'
     d EPT_QWPCLOSE    c                   x'006A'
     d EPT_QWPFEOD     c                   x'006B'
     d EPT_QWPOPEN     c                   x'006C'
     d EPT_QDMCRODP    c                   x'006D'
     d EPT_QDMROUTE    c                   x'006E'
     d EPT_QDBFEOD     c                   x'006F'
     d EPT_QSPFEOD     c                   x'0070'
     d*EPT_QLINEPTE    c                   x'0071'
     d EPT_QMHRTNEX    c                   x'0072'
     d EPT_QUIFINFO    c                   x'0073'
     d EPT_QDCCRDDA    c                   x'0074'
     d EPT_QWCSRTJR    c                   x'0075'
     d EPT_QJOJNRCY    c                   x'0076'
     d EPT_QWSERROR    c                   x'0077'
     d EPT_QWSLUDIN    c                   x'0078'
     d EPT_QDMACCIN    c                   x'0079'
     d EPT_QWSTSTR     c                   x'007A'
     d EPT_QSWALLOC    c                   x'007B'
     d EPT_QSWANSWR    c                   x'007C'
     d EPT_QSWCPFEV    c                   x'007D'
     d EPT_QSWCUDEV    c                   x'007E'
     d EPT_QJOJSTAT    c                   x'007F'
     d EPT_QSWINTQ     c                   x'0080'
     d EPT_QSWINTSP    c                   x'0081'
     d EPT_QSWLDSNA    c                   x'0082'
     d EPT_QSWNDEV     c                   x'0083'
     d EPT_QSWREPLY    c                   x'0084'
     d EPT_QTADSPY     c                   x'0085'
     d EPT_QTAINIT     c                   x'0086'
     d EPT_QTALUDIN    c                   x'0087'
     d EPT_QLPDSPIN    c                   x'0088'
     d EPT_QLPRQEVT    c                   x'0089'
     d EPT_QDKDSPY     c                   x'008A'
     d EPT_QDKDUP      c                   x'008B'
     d EPT_QDKERROR    c                   x'008C'
     d EPT_QDKEOV      c                   x'008D'
     d EPT_QDKLUDIN    c                   x'008E'
     d EPT_QDKUTIL     c                   x'008F'
     d EPT_QPQYIFM2    c                   x'0090'
     d EPT_QBNVCCSP    c                   x'0091'
     d EPT_QWCDMGNT    c                   x'0092'
     d EPT_QDCCRDPA    c                   x'0093'
     d EPT_QUOCMD      c                   x'0094'
     d EPT_QODDMPCP    c                   x'0095'
     d EPT_QWPREQIO    c                   x'0096'
     d EPT_QWPERROR    c                   x'0097'
     d EPT_QWPLUDIN    c                   x'0098'
     d EPT_QWPNWEVT    c                   x'0099'
     d EPT_QWPUSEVH    c                   x'009A'
     d EPT_QDMBKOUT    c                   x'009B'
     d EPT_QDMDSPOV    c                   x'009C'
     d EPT_QDMEHDES    c                   x'009D'
     d EPT_QJORYFIL    c                   x'009E'
     d EPT_QDMERRHP    c                   x'009F'
     d EPT_QJORYJRN    c                   x'00A0'
     d EPT_QDMSIGNL    c                   x'00A1'
     d EPT_QDBCRTFI    c                   x'00A2'
     d EPT_QDBCRTFS    c                   x'00A3'
     d EPT_QDBCRTME    c                   x'00A4'
     d EPT_QDBEXDFI    c                   x'00A5'
     d EPT_QDBDLTFI    c                   x'00A6'
     d EPT_QDBEXDME    c                   x'00A7'
     d EPT_QDBEXTWU    c                   x'00A8'
     d EPT_QDBMOVFI    c                   x'00A9'
     d EPT_QDBRNMFI    c                   x'00AA'
     d EPT_QDBGRTFI    c                   x'00AB'
     d EPT_QDBRVKFI    c                   x'00AC'
     d EPT_QDBDMPFI    c                   x'00AD'
     d EPT_QDBSIZFI    c                   x'00AE'
     d EPT_QDBXFRFI    c                   x'00AF'
     d EPT_QDBCLRPF    c                   x'00B0'
     d EPT_QDBINZPF    c                   x'00B1'
     d EPT_QDBIVLIX    c                   x'00B2'
     d EPT_QDBCDFIR    c                   x'00B3'
     d EPT_QDBCDMER    c                   x'00B4'
     d EPT_QDBMVRFR    c                   x'00B5'
     d EPT_QDBCHGME    c                   x'00B6'
     d EPT_QDBRCIPS    c                   x'00B7'
     d EPT_QDBRCDYN    c                   x'00B8'
     d EPT_QDBRSRCV    c                   x'00B9'
     d EPT_QDBSIGEX    c                   x'00BA'
     d EPT_QTSQEXIT    c                   x'00BB'
     d EPT_QWPXPRMA    c                   x'00BC'
     d EPT_QDBDLTME    c                   x'00BD'
     d EPT_QSPWTREH    c                   x'00BE'
     d EPT_QSPPRTWT    c                   x'00BF'
     d EPT_QSPSTRDR    c                   x'00C0'
     d EPT_QSPSTWTR    c                   x'00C1'
     d EPT_QSPRDR      c                   x'00C2'
     d EPT_QSPWTRM1    c                   x'00C3'
     d EPT_QSYEXUNP    c                   x'00C4'
     d*EPT_QLINEPTE    c                   x'00C5'
     d EPT_QSPDKTWT    c                   x'00C6'
     d EPT_QSPGPJOB    c                   x'00C7'
     d EPT_QSPCHJOB    c                   x'00C8'
     d EPT_QSPDSPF     c                   x'00C9'
     d EPT_QSPDSPQ     c                   x'00CA'
     d EPT_QSPDSPJ     c                   x'00CB'
     d EPT_QSPCNJOB    c                   x'00CC'
     d EPT_QSPHLSPQ    c                   x'00CD'
     d EPT_QSPRLSPQ    c                   x'00CE'
     d EPT_QSPCLSPQ    c                   x'00CF'
     d EPT_QSPCHSPF    c                   x'00D0'
     d EPT_QSPCHSPQ    c                   x'00D1'
     d EPT_QSPHNSPQ    c                   x'00D2'
     d EPT_QSPFILES    c                   x'00D3'
     d EPT_QSPFFACB    c                   x'00D4'
     d EPT_QSPDATAH    c                   x'00D5'
     d EPT_QSPCNRDR    c                   x'00D6'
     d EPT_QSPCTRDR    c                   x'00D7'
     d EPT_QSPCNWTR    c                   x'00D8'
     d EPT_QSPRLWTR    c                   x'00D9'
     d EPT_QSPHLWTR    c                   x'00DA'
     d EPT_QSPCNVRT    c                   x'00DB'
     d EPT_QPDDLTDP    c                   x'00DC'
     d EPT_QSPHLSPF    c                   x'00DD'
     d EPT_QSPRLSPF    c                   x'00DE'
     d EPT_QSPCNSPF    c                   x'00DF'
     d EPT_QSPDSPFA    c                   x'00E0'
     d EPT_QSPSTCPF    c                   x'00E1'
     d EPT_QSPCLNUP    c                   x'00E2'
     d EPT_QSPCRSPQ    c                   x'00E3'
     d EPT_QSYSVAUT    c                   x'00E4'
     d EPT_QSYRSAUT    c                   x'00E5'
     d EPT_QSYDLUP     c                   x'00E6'
     d EPT_QSYUP       c                   x'00E7'
     d EPT_QSYCHONR    c                   x'00E8'
     d EPT_QSYDSUP     c                   x'00E9'
     d EPT_QSYDSAUT    c                   x'00EA'
     d EPT_QSYDSUSR    c                   x'00EB'
     d EPT_QSYVERFY    c                   x'00EC'
     d EPT_QJOVLACR    c                   x'00ED'
     d EPT_QSYCNV      c                   x'00EE'
     d EPT_QSYGRAUT    c                   x'00EF'
     d EPT_QSYRVAUT    c                   x'00F0'
     d EPT_QSYHNAUT    c                   x'00F1'
     d EPT_QSYGRTSA    c                   x'00F2'
     d EPT_QDBAUTFR    c                   x'00F3'
     d EPT_QPZRAPTF    c                   x'00F4'
     d EPT_QSYAUTEV    c                   x'00F5'
     d EPT_QMHMODQS    c                   x'00F6'
     d EPT_QMHGSD      c                   x'00F7'
     d*EPT_QLINEPTE    c                   x'00F8'
     d EPT_QMHRCVMS    c                   x'00F9'
     d EPT_QMHRTVMS    c                   x'00FA'
     d EPT_QJOCAPPO    c                   x'00FB'
     d EPT_QMHRPRQ     c                   x'00FC'
     d EPT_QMHSNSTQ    c                   x'00FD'
     d EPT_QEZCLSLG    c                   x'00FE'
     d EPT_QMHDSMSS    c                   x'00FF'
     d EPT_QMHSNRPL    c                   x'0100'
     d*EPT_QLINEPTE    c                   x'0101'
     d EPT_QMHDLMS     c                   x'0102'
     d EPT_QCL         c                   x'0103'
     d EPT_QMHCHMSQ    c                   x'0104'
     d EPT_QMHSNRQ     c                   x'0105'
     d EPT_QMHLOGER    c                   x'0106'
     d EPT_QMHJLOG     c                   x'0107'
     d EPT_QMHCLVER    c                   x'0108'
     d EPT_QMHALMSQ    c                   x'0109'
     d EPT_QMHLINIT    c                   x'010A'
     d EPT_QMHLDISP    c                   x'010B'
     d EPT_QMHDLMSQ    c                   x'010C'
     d EPT_QMHCRMSQ    c                   x'010D'
     d EPT_QMHFLTR     c                   x'010E'
     d EPT_QMHAPD      c                   x'010F'
     d EPT_QMHCLOSE    c                   x'0110'
     d EPT_QMHCRMSD    c                   x'0111'
     d EPT_QMHDLMSD    c                   x'0112'
     d EPT_QMHCRMSF    c                   x'0113'
     d EPT_QCAEXEC     c                   x'0114'
     d EPT_QCADRV      c                   x'0115'
     d EPT_QCAPARSE    c                   x'0116'
     d EPT_QCARULE     c                   x'0117'
     d EPT_QCAPOS      c                   x'0118'
     d EPT_QCAFLD      c                   x'0119'
     d EPT_QSYGRSME    c                   x'011A'
     d EPT_QCAIFLD     c                   x'011B'
     d EPT_QCATRS      c                   x'011C'
     d EPT_QCACALL     c                   x'011D'
     d EPT_QCAFCMD     c                   x'011E'
     d EPT_QCAFEXPR    c                   x'011F'
     d EPT_QCAFBIF     c                   x'0120'
     d EPT_QCAFSCAN    c                   x'0121'
     d EPT_QCAXTND     c                   x'0122'
     d EPT_QPTERMSG    c                   x'0123'
     d EPT_QPTGTINP    c                   x'0124'
     d EPT_QPTVLINP    c                   x'0125'
     d EPT_QPTKYPRC    c                   x'0126'
     d EPT_QPTPRCSS    c                   x'0127'
     d EPT_QPTCHECK    c                   x'0128'
     d EPT_QPTSETUP    c                   x'0129'
     d EPT_QPTPARML    c                   x'012A'
     d EPT_QPTPERMV    c                   x'012B'
     d EPT_QPTSTRNG    c                   x'012C'
     d EPT_QPTERREV    c                   x'012D'
     d EPT_QPTCMSRV    c                   x'012E'
     d EPT_QPTPFKRV    c                   x'012F'
     d EPT_QMNCMDPM    c                   x'0130'
     d EPT_QSYPGMCH    c                   x'0131'
     d EPT_QMNCONFG    c                   x'0132'
     d EPT_QPTDFT      c                   x'0133'
     d EPT_QUIFLIST    c                   x'0134'
     d EPT_QPGMMENU    c                   x'0135'
     d EPT_QMHCHMSD    c                   x'0136'
     d EPT_QMNSYSRQ    c                   x'0137'
     d EPT_QCLCLCPR    c                   x'0138'
     d EPT_QCLRTNE     c                   x'0139'
     d EPT_QCLCLNUP    c                   x'013A'
     d EPT_QCLDMIO     c                   x'013B'
     d EPT_QCLRSLV     c                   x'013C'
     d EPT_QCLRSVRE    c                   x'013D'
     d EPT_QCLSSVRE    c                   x'013E'
     d EPT_QCLXCEXC    c                   x'013F'
     d EPT_QCLRTVJA    c                   x'0140'
     d EPT_QCAPRBLD    c                   x'0141'
     d EPT_QCLBIFCN    c                   x'0142'
     d EPT_QCLCHVAR    c                   x'0143'
     d EPT_QCLCLCMD    c                   x'0144'
     d EPT_QCLDMCMD    c                   x'0145'
     d EPT_QCLDMWC     c                   x'0146'
     d EPT_QCLGNEVL    c                   x'0147'
     d EPT_QCLGTCMD    c                   x'0148'
     d EPT_QCLICP2     c                   x'0149'
     d EPT_QCLIFCMD    c                   x'014A'
     d EPT_QCLLSCMD    c                   x'014B'
     d EPT_QCLMNMSG    c                   x'014C'
     d EPT_QCLMAP      c                   x'014D'
     d EPT_QCLXERR     c                   x'014E'
     d EPT_QCLXDUMP    c                   x'014F'
     d EPT_QCLRSVRC    c                   x'0150'
     d EPT_QCLERROR    c                   x'0151'
     d EPT_QCLSSVRC    c                   x'0152'
     d EPT_QCLWUIS     c                   x'0153'
     d EPT_QCLXCCMD    c                   x'0154'
     d EPT_QCLDECST    c                   x'0155'
     d EPT_QCLDMDCL    c                   x'0156'
     d EPT_QCLDMFIN    c                   x'0157'
     d EPT_QCLDSVST    c                   x'0158'
     d EPT_QCLICP1     c                   x'0159'
     d EPT_QCLPRCMD    c                   x'015A'
     d EPT_QCLCMPXH    c                   x'015B'
     d EPT_QCLCRPGM    c                   x'015C'
     d EPT_QCLCMDPR    c                   x'015D'
     d EPT_QCLENTR     c                   x'015E'
     d EPT_QCLINIT     c                   x'015F'
     d EPT_QCLIRPC     c                   x'0160'
     d EPT_QCLMSFIN    c                   x'0161'
     d EPT_QCLSTOUT    c                   x'0162'
     d EPT_QPRCRASH    c                   x'0163'
     d*EPT_QLINEPTE    c                   x'0164'
     d EPT_QPRPH01P    c                   x'0165'
     d EPT_QPRPH02P    c                   x'0166'
     d EPT_QPRODTBL    c                   x'0167'
     d EPT_QPRPH03P    c                   x'0168'
     d EPT_QPRISTCK    c                   x'0169'
     d EPT_QPRISTSM    c                   x'016A'
     d EPT_QPRMICK     c                   x'016B'
     d EPT_QPRXRF      c                   x'016C'
     d EPT_QPRLIST     c                   x'016D'
     d EPT_QCDRCMD     c                   x'016E'
     d EPT_QCDRPAS1    c                   x'016F'
     d EPT_QCDRPAS2    c                   x'0170'
     d EPT_QCDRPAS3    c                   x'0171'
     d EPT_QCDCCMD     c                   x'0172'
     d EPT_QMHDLVMS    c                   x'0173'
     d EPT_QDBCMPTH    c                   x'0174'
     d EPT_QP0LFFDC    c                   x'0175'
     d EPT_QLIMROIR    c                   x'0176'
     d EPT_QGLD00EX    c                   x'0177'
     d EPT_QLIDOBJD    c                   x'0178'
     d EPT_QLIDSLIB    c                   x'0179'
     d EPT_QLIMOVE     c                   x'017A'
     d*EPT_QLINEPTE    c                   x'017B'
     d EPT_QLIMVOBJ    c                   x'017C'
     d EPT_QLIMVOIR    c                   x'017D'
     d EPT_QLICRLIB    c                   x'017E'
     d EPT_QLICHLIB    c                   x'017F'
     d EPT_QLICKOBJ    c                   x'0180'
     d EPT_QLICLLIB    c                   x'0181'
     d EPT_QLIDLOIR    c                   x'0182'
     d EPT_QLIRNOBJ    c                   x'0183'
     d EPT_QLIRNOIR    c                   x'0184'
     d EPT_QLIDLFIL    c                   x'0185'
     d EPT_QLIINSRT    c                   x'0186'
     d EPT_QLIVLOIR    c                   x'0187'
     d EPT_QWSRSCRC    c                   x'0188'
     d EPT_QDCCHDHS    c                   x'0189'
     d EPT_QDCCHDAP    c                   x'018A'
     d EPT_QDCCHDLP    c                   x'018B'
     d EPT_QODDMPVC    c                   x'018C'
     d EPT_QDCCHDDK    c                   x'018D'
     d EPT_QCNPCSUP    c                   x'018E'
     d EPT_QHSSWRSF    c                   x'018F'
     d EPT_QDCCHDLD    c                   x'0190'
     d EPT_QDCCPDD     c                   x'0191'
     d EPT_QDCCHCRW    c                   x'0192'
     d EPT_QDCDSCD     c                   x'0193'
     d EPT_QDCCRCAP    c                   x'0194'
     d EPT_QDCCKLAS    c                   x'0195'
     d EPT_QDCCRDAP    c                   x'0196'
     d EPT_QRUSDMSG    c                   x'0197'
     d EPT_QDCCKL25    c                   x'0198'
     d EPT_QDCCRDSN    c                   x'0199'
     d EPT_QDCXLATE    c                   x'019A'
     d EPT_QECEDITW    c                   x'019B'
     d EPT_QECEDITS    c                   x'019C'
     d EPT_QECEDITU    c                   x'019D'
     d EPT_QDCCKCAS    c                   x'019E'
     d EPT_QDCCPLD     c                   x'019F'
     d EPT_QPQYIFM3    c                   x'01A0'
     d EPT_QPZCKPRE    c                   x'01A1'
     d EPT_QTBCRTBL    c                   x'01A2'
     d EPT_QECCRECD    c                   x'01A3'
     d EPT_QDCLSFO     c                   x'01A4'
     d EPT_QDCRSCD     c                   x'01A5'
     d EPT_QDCDLCD     c                   x'01A6'
     d EPT_QDCCRCAS    c                   x'01A7'
     d EPT_QDCCRL25    c                   x'01A8'
     d EPT_QDCCRMD     c                   x'01A9'
     d EPT_QDCCHLBS    c                   x'01AA'
     d EPT_QJOCHGAP    c                   x'01AB'
     d EPT_QECDSECD    c                   x'01AC'
     d EPT_QDCRSLD     c                   x'01AD'
     d EPT_QDFCDF      c                   x'01AE'
     d EPT_QJORYRCV    c                   x'01AF'
     d EPT_QDFEDF      c                   x'01B0'
     d EPT_QDFMDF      c                   x'01B1'
     d EPT_QDFDDF      c                   x'01B2'
     d EPT_QDFMOVE     c                   x'01B3'
     d EPT_QDFRENAM    c                   x'01B4'
     d EPT_QDFSIZE     c                   x'01B5'
     d EPT_QDFGRANT    c                   x'01B6'
     d EPT_QDFREVOK    c                   x'01B7'
     d EPT_QDFXOWNR    c                   x'01B8'
     d EPT_QDDCDF      c                   x'01B9'
     d EPT_QSPDUPQ     c                   x'01BA'
     d EPT_QSPRSTQ     c                   x'01BB'
     d EPT_QWTLEARM    c                   x'01BC'
     d EPT_QCLDSPPG    c                   x'01BD'
     d EPT_QDDREFER    c                   x'01BE'
     d EPT_QDDESPEH    c                   x'01BF'
     d EPT_QDDCPF      c                   x'01C0'
     d EPT_QBNCRTBP    c                   x'01C1'
     d EPT_QDDPFFLD    c                   x'01C2'
     d EPT_QDDCPFM     c                   x'01C3'
     d EPT_QDDCLF      c                   x'01C4'
     d EPT_QLIRCLIB    c                   x'01C5'
     d EPT_QDDLFFLD    c                   x'01C6'
     d EPT_QDDCLFM     c                   x'01C7'
     d EPT_QDDDMBR     c                   x'01C8'
     d EPT_QDDMDF      c                   x'01C9'
     d EPT_QDCDSDD     c                   x'01CA'
     d EPT_QDBRCDLK    c                   x'01CB'
     d EPT_QDDSIDP     c                   x'01CC'
     d EPT_QDCCHDSN    c                   x'01CD'
     d EPT_QDCCHDEH    c                   x'01CE'
     d EPT_QDCCHDAS    c                   x'01CF'
     d EPT_QSPSAVQ     c                   x'01D0'
     d EPT_QDBJOBRL    c                   x'01D1'
     d EPT_QSPRDRAP    c                   x'01D2'
     d EPT_QRZALL      c                   x'01D3'
     d EPT_QDDINIT     c                   x'01D4'
     d EPT_QDFCHKFL    c                   x'01D5'
     d EPT_QGDLQU1F    c                   x'01D6'
     d EPT_QCPEX0FL    c                   x'01D7'
     d EPT_QCPFLD      c                   x'01D8'
     d EPT_QCPEXCON    c                   x'01D9'
     d EPT_QCPFRMBR    c                   x'01DA'
     d EPT_QCPPRINT    c                   x'01DB'
     d EPT_QCPCREAT    c                   x'01DC'
     d EPT_QCPCLNUP    c                   x'01DD'
     d EPT_QCPGENIO    c                   x'01DE'
     d EPT_QDBRGZPF    c                   x'01DF'
     d EPT_QWTMCQDA    c                   x'01E0'
     d EPT_QWTMCQAL    c                   x'01E1'
     d EPT_QWTPCRJA    c                   x'01E2'
     d EPT_QWTCCCHJ    c                   x'01E3'
     d EPT_QWTCCJOB    c                   x'01E4'
     d EPT_QWTCCSBJ    c                   x'01E5'
     d EPT_QWTMCEOJ    c                   x'01E6'
     d EPT_QWTPIIPP    c                   x'01E7'
     d EPT_QWTPITPP    c                   x'01E8'
     d EPT_QWTCCCNJ    c                   x'01E9'
     d EPT_QWTCCHDJ    c                   x'01EA'
     d EPT_QWTCCRLJ    c                   x'01EB'
     d EPT_QWTCCRRJ    c                   x'01EC'
     d EPT_QWTCCRTN    c                   x'01ED'
     d EPT_QWTCCTFJ    c                   x'01EE'
     d EPT_QWTCLNUP    c                   x'01EF'
     d EPT_QWTMCDFT    c                   x'01F0'
     d EPT_QWTMCMNL    c                   x'01F1'
     d EPT_QWTMCSTD    c                   x'01F2'
     d EPT_QWTMCAJE    c                   x'01F3'
     d EPT_QWTMCSTP    c                   x'01F4'
     d EPT_QWTMEAST    c                   x'01F5'
     d EPT_QWTMEATR    c                   x'01F6'
     d EPT_QWTMEOBD    c                   x'01F7'
     d EPT_QWTMEPDA    c                   x'01F8'
     d EPT_QWTMEJQA    c                   x'01F9'
     d EPT_QWDJDVF     c                   x'01FA'
     d EPT_QWTMESBC    c                   x'01FB'
     d EPT_QWTMMCHJ    c                   x'01FC'
     d EPT_QWTMESGN    c                   x'01FD'
     d EPT_QWTMESTA    c                   x'01FE'
     d EPT_QWTMETRP    c                   x'01FF'
     d EPT_QWTAMCJS    c                   x'0200'
     d EPT_QWTMMBJT    c                   x'0201'
     d EPT_QWTMMCNJ    c                   x'0202'
     d EPT_QWTMMCSD    c                   x'0203'
     d EPT_QWTMMERH    c                   x'0204'
     d EPT_QWTMMTJT    c                   x'0205'
     d EPT_QWTMMHDJ    c                   x'0206'
     d EPT_QWTMMIJT    c                   x'0207'
     d EPT_QWTMMRLJ    c                   x'0208'
     d EPT_QWTAMABT    c                   x'0209'
     d EPT_QWTMMTRS    c                   x'020A'
     d EPT_QWTPECTL    c                   x'020B'
     d EPT_QWTPMCNJ    c                   x'020C'
     d EPT_QWTAESRQ    c                   x'020D'
     d EPT_QWTPMSRQ    c                   x'020E'
     d EPT_QWTMESRQ    c                   x'020F'
     d EPT_QWTSETME    c                   x'0210'
     d*EPT_QLINEPTE    c                   x'0211'
     d EPT_QWCCALOC    c                   x'0212'
     d EPT_QWCCDAOC    c                   x'0213'
     d EPT_QWCCSDUC    c                   x'0214'
     d EPT_QWTSCSBJ    c                   x'0215'
     d EPT_QWCSADVR    c                   x'0216'
     d EPT_QWCASDUM    c                   x'0217'
     d EPT_QPZIEXIT    c                   x'0218'
     d EPT_QWCCDSUC    c                   x'0219'
     d EPT_QWCCDSTC    c                   x'021A'
     d EPT_QWCCDSSC    c                   x'021B'
     d EPT_QWCCDSJC    c                   x'021C'
     d EPT_QWCCDSLC    c                   x'021D'
     d EPT_QWCCDSVC    c                   x'021E'
     d EPT_QWCCCHLC    c                   x'021F'
     d EPT_QWCCSDSC    c                   x'0220'
     d EPT_QWCASDSM    c                   x'0221'
     d EPT_QWCCCRCC    c                   x'0222'
     d EPT_QWCCDSIC    c                   x'0223'
     d EPT_QWCCDSCC    c                   x'0224'
     d EPT_QWCAUPRM    c                   x'0225'
     d EPT_QWCAHNTM    c                   x'0226'
     d EPT_QWCAHNAE    c                   x'0227'
     d EPT_QWCASUUM    c                   x'0228'
     d EPT_QWCCSUUC    c                   x'0229'
     d EPT_QWCAINAR    c                   x'022A'
     d EPT_QWCAMNAR    c                   x'022B'
     d EPT_QWCAROTE    c                   x'022C'
     d EPT_QWCASCUE    c                   x'022D'
     d EPT_QWCOPYRT    c                   x'022E'
     d EPT_QWCAT1TE    c                   x'022F'
     d EPT_QWCAT2TE    c                   x'0230'
     d EPT_QWCICLSR    c                   x'0231'
     d EPT_QWCIINSR    c                   x'0232'
     d EPT_QWCIPDEH    c                   x'0233'
     d EPT_QWCISCFR    c                   x'0234'
     d EPT_QWCAMCKE    c                   x'0235'
     d EPT_QWCSDSFR    c                   x'0236'
     d EPT_QWTPCSRQ    c                   x'0237'
     d EPT_QWDMRSLV    c                   x'0238'
     d EPT_QWDMMSG     c                   x'0239'
     d EPT_QWDJFNE     c                   x'023A'
     d EPT_QJOMTJOA    c                   x'023B'
     d EPT_QWDCDSD     c                   x'023C'
     d EPT_QWDCCHD     c                   x'023D'
     d EPT_QWDCCHR     c                   x'023E'
     d EPT_QWDCCHJ     c                   x'023F'
     d EPT_QWDCCHA     c                   x'0240'
     d EPT_QWDCCHQ     c                   x'0241'
     d*EPT_QLINEPTE    c                   x'0242'
     d*EPT_QLINEPTE    c                   x'0243'
     d EPT_QWDCADA     c                   x'0244'
     d*EPT_QLINEPTE    c                   x'0245'
     d EPT_QWDCDLR     c                   x'0246'
     d EPT_QWDCDLJ     c                   x'0247'
     d EPT_QWDMPACK    c                   x'0248'
     d EPT_QWDMXTND    c                   x'0249'
     d EPT_QWDCCRD     c                   x'024A'
     d EPT_QWDGMSG     c                   x'024B'
     d EPT_QWDCDSG     c                   x'024C'
     d*EPT_QLINEPTE    c                   x'024D'
     d EPT_QWDMRCVR    c                   x'024E'
     d*EPT_QLINEPTE    c                   x'024F'
     d EPT_QWCDLYJB    c                   x'0250'
     d EPT_QSRSVRQI    c                   x'0251'
     d EPT_QWTMEJIN    c                   x'0252'
     d EPT_QSRSLCPR    c                   x'0253'
     d*EPT_QLINEPTE    c                   x'0254'
     d EPT_QSRSVIOC    c                   x'0255'
     d EPT_QSRSVUPR    c                   x'0256'
     d EPT_QSRSVIPL    c                   x'0257'
     d*EPT_QLINEPTE    c                   x'0258'
     d EPT_QSRRSFIL    c                   x'0259'
     d EPT_QSRRSCUR    c                   x'025A'
     d EPT_QSRRSOPN    c                   x'025B'
     d EPT_QSRRSLIB    c                   x'025C'
     d EPT_QSRRSRQI    c                   x'025D'
     d EPT_QSRRSOBJ    c                   x'025E'
     d EPT_QSRTUNE     c                   x'025F'
     d EPT_QSRRLCPR    c                   x'0260'
     d EPT_QDBXINIT    c                   x'0261'
     d EPT_QSRRLCP2    c                   x'0262'
     d EPT_QSRADOPT    c                   x'0263'
     d EPT_QSRFROBJ    c                   x'0264'
     d EPT_QSRDSVOL    c                   x'0265'
     d EPT_QSRRUCPR    c                   x'0266'
     d EPT_QSRRACPR    c                   x'0267'
     d EPT_QSMREQIO    c                   x'0268'
     d EPT_QSMDPM      c                   x'0269'
     d EPT_QSMRQDQR    c                   x'026A'
     d EPT_QSMSFDR     c                   x'026B'
     d EPT_QSMPSMR     c                   x'026C'
     d EPT_QSMSFMR     c                   x'026D'
     d EPT_QSMAVPR     c                   x'026E'
     d EPT_QSMCFKEY    c                   x'026F'
     d EPT_QSMADDSF    c                   x'0270'
     d EPT_QSMDELSF    c                   x'0271'
     d EPT_QSMASFDR    c                   x'0272'
     d EPT_QSMSUIR     c                   x'0273'
     d EPT_QWDCADP     c                   x'0274'
     d EPT_QWDCCHP     c                   x'0275'
     d EPT_QSMCSMSU    c                   x'0276'
     d EPT_QSMCSMML    c                   x'0277'
     d EPT_QSMSTART    c                   x'0278'
     d EPT_QSMSTOP     c                   x'0279'
     d EPT_QSMDAE      c                   x'027A'
     d EPT_QSMOODE     c                   x'027B'
     d EPT_QSMCCNLE    c                   x'027C'
     d EPT_QSMSFEX     c                   x'027D'
     d EPT_QSMSSFX     c                   x'027E'
     d EPT_QARDRIVE    c                   x'027F'
     d EPT_QAROPSEL    c                   x'0280'
     d EPT_QRZDALL     c                   x'0281'
     d EPT_QRZDTL      c                   x'0282'
     d EPT_QZSPSIPI    c                   x'0283'
     d EPT_QZSPIXIT    c                   x'0284'
     d EPT_QZSPPADR    c                   x'0285'
     d EPT_QARPRNT     c                   x'0286'
     d EPT_QZSPPLOC    c                   x'0287'
     d EPT_QDCDLIPX    c                   x'0288'
     d EPT_QP0ZJTRM    c                   x'0289'
     d EPT_QJOOBJEJ    c                   x'028A'
     d EPT_QDBXSTOP    c                   x'028B'
     d EPT_QPQCTCP     c                   x'028C'
     d EPT_QDBXTRGOMI  c                   x'028D'
     d EPT_QZSPQSRT    c                   x'028E'
     d EPT_QDCALGN     c                   x'028F'
     d EPT_QDCCNVT     c                   x'0290'
     d EPT_QJOJRREV    c                   x'0291'
     d EPT_QSRSOCP2    c                   x'0292'
     d EPT_QSRSLCP2    c                   x'0293'
     d EPT_QSRSVCHK    c                   x'0294'
     d EPT_QEAEXIT     c                   x'0295'
     d EPT_QDBSVPRE    c                   x'0296'
     d EPT_QTEMBKCU    c                   x'0297'
     d EPT_QWHDSPFD    c                   x'0298'
     d EPT_QWHDSFFD    c                   x'0299'
     d EPT_QWHDSPPR    c                   x'029A'
     d EPT_QWHDSDBR    c                   x'029B'
     d EPT_QSPPMTFA    c                   x'029C'
     d EPT_QTEMGTVR    c                   x'029D'
     d EPT_QTEMVFOR    c                   x'029E'
     d EPT_QTEMLOBJ    c                   x'029F'
     d EPT_QTECDSVR    c                   x'02A0'
     d EPT_QTECCHVR    c                   x'02A1'
     d EPT_QTECRSBP    c                   x'02A2'
     d EPT_QTECADBP    c                   x'02A3'
     d EPT_QTECRMBP    c                   x'02A4'
     d EPT_QTECADTR    c                   x'02A5'
     d EPT_QTECRMTR    c                   x'02A6'
     d EPT_QTECDSDB    c                   x'02A7'
     d EPT_QTECDSBP    c                   x'02A8'
     d EPT_QTECDSTR    c                   x'02A9'
     d EPT_QTECADPG    c                   x'02AA'
     d EPT_QTECRMPG    c                   x'02AB'
     d EPT_QTECCHPT    c                   x'02AC'
     d EPT_QTECNTDB    c                   x'02AD'
     d EPT_QTECENDB    c                   x'02AE'
     d EPT_QTECCHDB    c                   x'02AF'
     d EPT_QTECDSTD    c                   x'02B0'
     d EPT_QTECCLTD    c                   x'02B1'
     d EPT_QTEMGTHL    c                   x'02B2'
     d EPT_QTECCNRQ    c                   x'02B3'
     d EPT_QTEMDEBP    c                   x'02B4'
     d EPT_QTEVIREF    c                   x'02B5'
     d EPT_QTEMRCLM    c                   x'02B6'
     d EPT_QSCCOPY     c                   x'02B7'
     d EPT_QPZARPC     c                   x'02B8'
     d EPT_QPZAPC      c                   x'02B9'
     d EPT_QPZRPC      c                   x'02BA'
     d EPT_QPZLPC      c                   x'02BB'
     d EPT_QSCLID      c                   x'02BC'
     d EPT_QYYCGETK    c                   x'02BD'
     d EPT_QPZCPFI     c                   x'02BE'
     d EPT_QSCCPYLG    c                   x'02BF'
     d EPT_QSCVFYPT    c                   x'02C0'
     d EPT_QSCTI       c                   x'02C1'
     d EPT_QTSWKDDM    c                   x'02C2'
     d EPT_QTSDSDDM    c                   x'02C3'
     d EPT_QSCDH       c                   x'02C4'
     d EPT_QSCDJOB     c                   x'02C5'
     d EPT_QSCDSO      c                   x'02C6'
     d EPT_QSCDSS      c                   x'02C7'
     d EPT_QSCEND      c                   x'02C8'
     d EPT_QSCFSODD    c                   x'02C9'
     d EPT_QSCGJOB     c                   x'02CA'
     d EPT_QSCGSO      c                   x'02CB'
     d EPT_QSCJSDMP    c                   x'02CC'
     d EPT_QSCMCD      c                   x'02CD'
     d EPT_QSCMCTX     c                   x'02CE'
     d EPT_QSCMCUR     c                   x'02CF'
     d EPT_QSCMDS      c                   x'02D0'
     d EPT_QSCMDSI     c                   x'02D1'
     d EPT_QSCMIDX     c                   x'02D2'
     d EPT_QSCMLUD     c                   x'02D3'
     d EPT_QSCMMCTX    c                   x'02D4'
     d EPT_QSCMND      c                   x'02D5'
     d EPT_QSCMPGM     c                   x'02D6'
     d EPT_QSCMQ       c                   x'02D7'
     d EPT_QSCMSP      c                   x'02D8'
     d EPT_QSCMUP      c                   x'02D9'
     d EPT_QSCOBJDM    c                   x'02DA'
     d EPT_QSCONEOB    c                   x'02DB'
     d EPT_QUIFMENU    c                   x'02DC'
     d EPT_QSCPTREC    c                   x'02DD'
     d EPT_QSCPUTR     c                   x'02DE'
     d EPT_QSCRH       c                   x'02DF'
     d EPT_QSCSVJOB    c                   x'02E0'
     d EPT_QSCWMINT    c                   x'02E1'
     d EPT_QSCTEVTH    c                   x'02E2'
     d EPT_QSCTJOB     c                   x'02E3'
     d EPT_QSCTJOBR    c                   x'02E4'
     d EPT_QSCSPCDM    c                   x'02E5'
     d EPT_QJODFTJN    c                   x'02E6'
     d EPT_QSCDOBJ     c                   x'02E7'
     d EPT_QSCMAG      c                   x'02E8'
     d EPT_QY2FTEX     c                   x'02E9'
     d EPT_QSCDMPPS    c                   x'02EA'
     d EPT_QSCLOCSO    c                   x'02EB'
     d EPT_QSCDJI      c                   x'02ED'
     d EPT_QSCGJI      c                   x'02EE'
     d EPT_QSCINTDD    c                   x'02EF'
     d EPT_QRCPDMGL    c                   x'02F0'
     d EPT_QRCPDMGN    c                   x'02F1'
     d EPT_QDMMINIT    c                   x'02F2'
     d EPT_QESCIEXT    c                   x'02F3'
     d EPT_QINCPF      c                   x'02F4'
     d EPT_QEARBKM     c                   x'02F5'
     d EPT_QINRIOOH    c                   x'02F6'
     d EPT_QRCDMGLG    c                   x'02F7'
     d EPT_QRCDMGNT    c                   x'02F8'
     d EPT_QWDDMGNT    c                   x'02F9'
     d EPT_QSWXCOR     c                   x'02FA'
     d EPT_QDBDMGMB    c                   x'02FB'
     d EPT_QDMDMGNT    c                   x'02FC'
     d EPT_QSPDAMGE    c                   x'02FD'
     d EPT_QSYIEXIT    c                   x'02FE'
     d EPT_QDBFFCPY    c                   x'02FF'
     d EPT_QDBPUTM     c                   x'0300'
     d EPT_QDBPUTMX    c                   x'0301'
     d EPT_QDBGETM     c                   x'0302'
     d EPT_QAR52IGC    c                   x'0303'
     d EPT_QZSPWCRO    c                   x'0304'
     d EPT_QDMRCLSE    c                   x'0305'
     d EPT_QLICLNUP    c                   x'0306'
     d EPT_QMHDMGNT    c                   x'0307'
     d EPT_QSRDSPY     c                   x'0308'
     d EPT_QLPSININ    c                   x'0309'
     d EPT_QWTSCCMD    c                   x'030A'
     d EPT_QWDCCHG     c                   x'030B'
     d EPT_QUIFPRT     c                   x'030C'
     d EPT_QSPCPYF     c                   x'030D'
     d EPT_QUIFSHLL    c                   x'030E'
     d EPT_QUIPPAUG    c                   x'030F'
     d EPT_QUIPPCPP    c                   x'0310'
     d EPT_QWDCADC     c                   x'0311'
     d EPT_QSPHNCMD    c                   x'0312'
     d EPT_QTAFEOV     c                   x'0313'
     d EPT_QTADUMP     c                   x'0314'
     d EPT_QSPTRMRW    c                   x'0315'
     d EPT_QSPCVPRT    c                   x'0316'
     d EPT_QSLINASP    c                   x'0317'
     d EPT_QSLOPEN     c                   x'0318'
     d EPT_QSLCLOSE    c                   x'0319'
     d EPT_QSLSNA      c                   x'031A'
     d EPT_QSLPUT      c                   x'031B'
     d EPT_QSLGET      c                   x'031C'
     d EPT_QSLUSMON    c                   x'031D'
     d EPT_QDBSVPST    c                   x'031E'
     d EPT_QSLERBLD    c                   x'031F'
     d EPT_QWDMCNVT    c                   x'0320'
     d EPT_QDCCPCD     c                   x'0321'
     d EPT_QDCCHLAS    c                   x'0322'
     d EPT_QWDCCHC     c                   x'0323'
     d EPT_QDCCHCHS    c                   x'0324'
     d EPT_QDCCHLTR    c                   x'0325'
     d EPT_QDCCHL25    c                   x'0326'
     d EPT_QDCWKFO     c                   x'0327'
     d EPT_QDCCRCPS    c                   x'0328'
     d EPT_QDCCHCAS    c                   x'0329'
     d EPT_QDCCHCPS    c                   x'032A'
     d EPT_QDCCHCBS    c                   x'032B'
     d EPT_QDCCHCFN    c                   x'032C'
     d EPT_QLICHGLB    c                   x'032D'
     d EPT_QSXDLTPB    c                   x'032E'
     d EPT_QDDSEU      c                   x'032F'
     d EPT_QSPCHWTR    c                   x'0330'
     d EPT_QDDCCMF     c                   x'0331'
     d EPT_QSLINLLS    c                   x'0332'
     d EPT_QDDMCMF     c                   x'0333'
     d EPT_QDDPRINT    c                   x'0334'
     d EPT_QDDREAD     c                   x'0335'
     d EPT_QDFINIT     c                   x'0336'
     d EPT_QDFLVLGN    c                   x'0337'
     d EPT_QTECCHHP    c                   x'0338'
     d*EPT_QLINEPTE    c                   x'0339'
     d EPT_QDFBLDDF    c                   x'033A'
     d EPT_QDFCRTWU    c                   x'033B'
     d*EPT_QLINEPTE    c                   x'033C'
     d*EPT_QLINEPTE    c                   x'033D'
     d EPT_QSWTALCC    c                   x'033E'
     d EPT_QDFKWDPR    c                   x'033F'
     d EPT_QSCMCB      c                   x'0340'
     d EPT_QDFRCDPR    c                   x'0341'
     d EPT_QDFVDLST    c                   x'0342'
     d EPT_QSPDMGNT    c                   x'0343'
     d EPT_QSPCKPRM    c                   x'0344'
     d EPT_QSPIERRS    c                   x'0345'
     d EPT_QSPDSPRW    c                   x'0346'
     d EPT_QSPDSPR     c                   x'0347'
     d EPT_QSPDSPW     c                   x'0348'
     d EPT_QRCLAIM     c                   x'0349'
     d EPT_QRCDEBUG    c                   x'034A'
     d EPT_QJOEDTAP    c                   x'034B'
     d EPT_QRCSEPOB    c                   x'034C'
     d EPT_QRCSIMPL    c                   x'034D'
     d EPT_QRCOMPST    c                   x'034E'
     d EPT_QRCLENUP    c                   x'034F'
     d EPT_QRCINSRT    c                   x'0350'
     d EPT_QDBSOPEN    c                   x'0351'
     d EPT_QDBCHKFI    c                   x'0352'
     d EPT_QDBDIRUP    c                   x'0353'
     d EPT_QDBRCLMA    c                   x'0354'
     d EPT_QDBRCLMB    c                   x'0355'
     d EPT_QDBRCLMC    c                   x'0356'
     d EPT_QNFBROWS    c                   x'0357'
     d EPT_QNFDSPRC    c                   x'0358'
     d EPT_QNFDSTRB    c                   x'0359'
     d EPT_QNFJOBAU    c                   x'035A'
     d EPT_QNFJOBDS    c                   x'035B'
     d EPT_QNFPACK     c                   x'035C'
     d EPT_QNFRCDTA    c                   x'035D'
     d EPT_QNFSBMTP    c                   x'035E'
     d EPT_QNFSNDTA    c                   x'035F'
     d EPT_QNFSNMSG    c                   x'0360'
     d EPT_QNFSNSPL    c                   x'0361'
     d EPT_QMHDSMSD    c                   x'0362'
     d EPT_QMHDSMSF    c                   x'0363'
     d EPT_QMHMSSFL    c                   x'0364'
     d EPT_QEZCLDAT    c                   x'0365'
     d EPT_QMHMRCHK    c                   x'0366'
     d EPT_QWCITRSE    c                   x'0367'
     d EPT_QWCSDSIM    c                   x'0368'
     d EPT_QJOIPL      c                   x'0369'
     d EPT_QWSLUDRS    c                   x'036A'
     d EPT_QWSCRTRB    c                   x'036B'
     d EPT_QSWLOCLD    c                   x'036C'
     d EPT_QSWDLTLD    c                   x'036D'
     d EPT_QTEMDIAG    c                   x'036E'
     d EPT_QCLRTVFS    c                   x'036F'
     d EPT_QCLRTVVI    c                   x'0370'
     d EPT_QTSCLEAN    c                   x'0371'
     d EPT_QSCOIR      c                   x'0372'
     d EPT_QCLRTVCU    c                   x'0373'
     d EPT_QCLRTVDR    c                   x'0374'
     d EPT_QCLRTVEI    c                   x'0375'
     d EPT_QCLCNVDT    c                   x'0376'
     d EPT_QCLCNVCN    c                   x'0377'
     d EPT_QCLCNVNC    c                   x'0378'
     d EPT_QCLSWTCH    c                   x'0379'
     d EPT_QCLCMXRF    c                   x'037A'
     d EPT_QBSOPEN     c                   x'037B'
     d EPT_QBSCLOSE    c                   x'037C'
     d EPT_QBSBID      c                   x'037D'
     d EPT_QMHSNBRK    c                   x'037E'
     d EPT_QMHSNEVT    c                   x'037F'
     d EPT_QBSERP      c                   x'0380'
     d EPT_QBSFSTIO    c                   x'0381'
     d EPT_QMHSNMSG    c                   x'0382'
     d EPT_QMHSNPGM    c                   x'0383'
     d EPT_QLIOUTFL    c                   x'0384'
     d EPT_QBSINASP    c                   x'0385'
     d EPT_QLIADOPT    c                   x'0386'
     d EPT_QMHRSTPR    c                   x'0387'
     d EPT_QTSWKCHG    c                   x'0388'
     d EPT_QHECUSER    c                   x'0389'
     d EPT_QLPBCPCL    c                   x'038A'
     d EPT_QUIPPCTS    c                   x'038B'
     d EPT_QLPBIPCL    c                   x'038C'
     d EPT_QSYACCIP    c                   x'038D'
     d EPT_QSYCRTIP    c                   x'038E'
     d EPT_QSYCPYIP    c                   x'038F'
     d EPT_QSYRTVIP    c                   x'0390'
     d EPT_QSYRMVIP    c                   x'0391'
     d EPT_QSYCHGIP    c                   x'0392'
     d EPT_QCDDCMD     c                   x'0393'
     d EPT_QAR5225     c                   x'0394'
     d EPT_QAR5256     c                   x'0395'
     d EPT_QCLREGCL    c                   x'0396'
     d EPT_QMHMFSRH    c                   x'0397'
     d EPT_QWHRMBRD    c                   x'0398'
     d EPT_QJOREAPY    c                   x'0399'
     d EPT_QJOCDRJR    c                   x'039A'
     d EPT_QJOCHGJD    c                   x'039B'
     d EPT_QJOCHGJN    c                   x'039C'
     d EPT_QJOCHJNR    c                   x'039D'
     d EPT_QJOCRTJN    c                   x'039E'
     d EPT_QJOCRTRC    c                   x'039F'
     d EPT_QJODLTJN    c                   x'03A0'
     d EPT_QJODLTRC    c                   x'03A1'
     d EPT_QJODSPJA    c                   x'03A2'
     d EPT_QJODSPJE    c                   x'03A3'
     d EPT_QJODSPRC    c                   x'03A4'
     d EPT_QJOENDJN    c                   x'03A5'
     d EPT_QJOGENJD    c                   x'03A6'
     d EPT_QJOJEJRC    c                   x'03A7'
     d EPT_QJOJRNPF    c                   x'03A8'
     d EPT_QJONJEVT    c                   x'03A9'
     d EPT_QJORSTJN    c                   x'03AA'
     d EPT_QJORSTRC    c                   x'03AB'
     d EPT_QJORTHRS    c                   x'03AC'
     d EPT_QJORUEVT    c                   x'03AD'
     d EPT_QJOSAVJN    c                   x'03AE'
     d EPT_QJOSAVRC    c                   x'03AF'
     d EPT_QJOSNDJE    c                   x'03B0'
     d EPT_QJOXENNJ    c                   x'03B1'
     d EPT_QDKPUTI     c                   x'03B2'
     d EPT_QDKGETI     c                   x'03B3'
     d EPT_QSPRCMBR    c                   x'03B4'
     d EPT_QSPSBMEX    c                   x'03B5'
     d EPT_QSPSBMJB    c                   x'03B6'
     d EPT_QSPDFTCP    c                   x'03B7'
     d EPT_QWCSDSKC    c                   x'03B8'
     d EPT_QWCCDSKC    c                   x'03B9'
     d EPT_QWCSDSKR    c                   x'03BA'
     d EPT_QMHDSPLK    c                   x'03BB'
     d EPT_QDBJOBLK    c                   x'03BC'
     d EPT_QDBOBJLK    c                   x'03BD'
     d EPT_QSWCDMRH    c                   x'03BE'
     d EPT_QJOREEXT    c                   x'03BF'
     d EPT_QJORRDIR    c                   x'03C0'
     d EPT_QOESTUB     c                   x'03C1'
     d EPT_QQAKIEXT    c                   x'03C2'
     d EPT_QSCMJPRT    c                   x'03C3'
     d EPT_QSCMJSPC    c                   x'03C4'
     d EPT_QEZEVTHL    c                   x'03C5'
     d EPT_QSPCVPAG    c                   x'03C6'
     d EPT_QTAERRIN    c                   x'03C7'
     d EPT_QTAOPCHK    c                   x'03C8'
     d EPT_QTAVOPEN    c                   x'03C9'
     d EPT_QTAVCLOS    c                   x'03CA'
     d EPT_QTADMPIO    c                   x'03CB'
     d EPT_QMHDSEXT    c                   x'03CC'
     d EPT_QRCIMPLN    c                   x'03CD'
     d EPT_QCLRTVDA    c                   x'03CE'
     d EPT_QJODMGNT    c                   x'03CF'
     d EPT_QDFCNVPP    c                   x'03D0'
     d EPT_QWCATARE    c                   x'03D1'
     d EPT_QDBCNVFI    c                   x'03D2'
     d EPT_QPRPH11P    c                   x'03D3'
     d EPT_QPRMICK1    c                   x'03D4'
     d EPT_QZSPWCSO    c                   x'03D5'
     d EPT_QCABIFV     c                   x'03D6'
     d EPT_QSYGRUSR    c                   x'03D7'
     d EPT_QSPSCAN     c                   x'03D8'
     d EPT_QSPCVDSP    c                   x'03D9'
     d EPT_QSPDSPFX    c                   x'03DA'
     d EPT_QWCSDSKS    c                   x'03DB'
     d EPT_QUIPPFMT    c                   x'03DC'
     d EPT_QWCCDSAC    c                   x'03DD'
     d EPT_QWCSDSAR    c                   x'03DE'
     d EPT_QSWCNSC     c                   x'03DF'
     d EPT_QUIPPGEN    c                   x'03E0'
     d EPT_QUIPPIEX    c                   x'03E1'
     d EPT_QSWILCS     c                   x'03E2'
     d EPT_QSWILUSM    c                   x'03E3'
     d EPT_QSWIOCMP    c                   x'03E4'
     d EPT_QSWIVOFF    c                   x'03E5'
     d EPT_QSWIVON     c                   x'03E6'
     d EPT_QSWLCH1     c                   x'03E7'
     d EPT_QSWLCH2     c                   x'03E8'
     d EPT_QSWLSH1     c                   x'03E9'
     d EPT_QSWSALC     c                   x'03EA'
     d EPT_QSWSALCC    c                   x'03EB'
     d EPT_QSWSRCVC    c                   x'03EC'
     d EPT_QSWSWERP    c                   x'03ED'
     d EPT_QSWTALC     c                   x'03EE'
     d EPT_QSWABAND    c                   x'03EF'
     d EPT_QSWCDCR     c                   x'03F0'
     d EPT_QDBEXEXT    c                   x'03F1'
     d EPT_QDBFIXIT    c                   x'03F2'
     d EPT_QSWCDFRH    c                   x'03F3'
     d EPT_QSWCDLST    c                   x'03F4'
     d EPT_QSWCDMAN    c                   x'03F5'
     d EPT_QSWCDNAV    c                   x'03F6'
     d EPT_QSWCDPRV    c                   x'03F7'
     d EPT_QSWCDSUC    c                   x'03F8'
     d EPT_QSWDAMGE    c                   x'03F9'
     d EPT_QSWDIAL     c                   x'03FA'
     d EPT_QSWDISC     c                   x'03FB'
     d EPT_QJOLGACT    c                   x'03FC'
     d EPT_QJORYDIR    c                   x'03FD'
     d EPT_QSWNDFR     c                   x'03FE'
     d EPT_QSWNDFRH    c                   x'03FF'
     d EPT_QSWNDISC    c                   x'0400'
     d EPT_QSWNDNOR    c                   x'0401'
     d EPT_QSWSNDMS    c                   x'0402'
     d EPT_QUIPPLST    c                   x'0403'
     d EPT_QSIRSP      c                   x'0404'
     d EPT_QSIRVPIP    c                   x'0405'
     d EPT_QSIOPEN     c                   x'0406'
     d EPT_QSICLOSE    c                   x'0407'
     d EPT_QSIGET      c                   x'0408'
     d EPT_QSIPUT      c                   x'0409'
     d EPT_QSINFEVH    c                   x'040A'
     d EPT_QSIEFEVH    c                   x'040B'
     d EPT_QSIIOCMP    c                   x'040C'
     d EPT_QUIPPPH1    c                   x'040D'
     d EPT_QSIRSPAT    c                   x'040E'
     d EPT_QUIPPPRT    c                   x'040F'
     d EPT_QSIERP1     c                   x'0410'
     d EPT_QSIERP2     c                   x'0411'
     d EPT_QSIFMH7     c                   x'0412'
     d EPT_QAPALCON    c                   x'0413'
     d EPT_QAPDLCON    c                   x'0414'
     d EPT_QAPEVOKE    c                   x'0415'
     d EPT_QAPDTACH    c                   x'0416'
     d EPT_QAPSNDTA    c                   x'0417'
     d EPT_QAPSNDER    c                   x'0418'
     d EPT_QAPERROR    c                   x'0419'
     d EPT_QAPRSPPS    c                   x'041A'
     d EPT_QAPRCV      c                   x'041B'
     d EPT_QAPSNDSG    c                   x'041C'
     d EPT_QAPALSND    c                   x'041D'
     d EPT_QAPXMT      c                   x'041E'
     d EPT_QAPDEQUE    c                   x'041F'
     d EPT_QAPWAIT     c                   x'0420'
     d EPT_QAPUIEH     c                   x'0421'
     d EPT_QAPIOCMP    c                   x'0422'
     d EPT_QAPCANCL    c                   x'0423'
     d EPT_QAPCRTRB    c                   x'0424'
     d EPT_QAPGTSES    c                   x'0425'
     d EPT_QSLSPEND    c                   x'0426'
     d EPT_QSLRST      c                   x'0427'
     d EPT_QWSPBRCD    c                   x'0428'
     d EPT_QWSPBFTD    c                   x'0429'
     d EPT_QWSPBOOF    c                   x'042A'
     d EPT_QWSPBICF    c                   x'042B'
     d EPT_QWSPBSFE    c                   x'042C'
     d EPT_QDDCDFDV    c                   x'042D'
     d EPT_QDDSPRDV    c                   x'042E'
     d EPT_QDDCKDV     c                   x'042F'
     d EPT_QDDADDDV    c                   x'0430'
     d EPT_QDDCDPF     c                   x'0431'
     d EPT_QSWCDCRH    c                   x'0432'
     d EPT_QSWCDFR     c                   x'0433'
     d EPT_QSFMQDSP    c                   x'0434'
     d EPT_QSFHSFL     c                   x'0435'
     d EPT_QWTLCATT    c                   x'0436'
     d EPT_QWTLCALC    c                   x'0437'
     d EPT_QUIPPRD     c                   x'0438'
     d EPT_QWTLCRDT    c                   x'0439'
     d EPT_QWTLCAMS    c                   x'043A'
     d EPT_QWTLEDRQ    c                   x'043B'
     d EPT_QWTLEOLK    c                   x'043C'
     d EPT_QWTMCACE    c                   x'043D'
     d EPT_QWTMCATT    c                   x'043E'
     d EPT_QWTMMALM    c                   x'043F'
     d EPT_QWTLCVOF    c                   x'0440'
     d EPT_QWTMCDCE    c                   x'0441'
     d EPT_QWTPIPPP    c                   x'0442'
     d EPT_QDFCDFPR    c                   x'0443'
     d EPT_QDFDFTPR    c                   x'0444'
     d*EPT_QLINEPTE    c                   x'0445'
     d EPT_QDCCHCAP    c                   x'0446'
     d EPT_QDCCKDAP    c                   x'0447'
     d EPT_QDCCHLSD    c                   x'0448'
     d EPT_QTNCTL      c                   x'0449'
     d EPT_QTNNTRS     c                   x'044A'
     d EPT_QTNNTFY     c                   x'044B'
     d EPT_QTNIPL      c                   x'044C'
     d EPT_QYYCGETD    c                   x'044D'
     d EPT_QTNROLLB    c                   x'044E'
     d EPT_QTNCMT      c                   x'044F'
     d EPT_QTNEND      c                   x'0450'
     d EPT_QTNCLOSE    c                   x'0451'
     d EPT_QTNOPEN     c                   x'0452'
     d EPT_QSWCDCPP    c                   x'0453'
     d EPT_QSWLDCPP    c                   x'0454'
     d EPT_QSWNDCPP    c                   x'0455'
     d EPT_QSWUNUSE    c                   x'0456'
     d EPT_QMHADRLE    c                   x'0457'
     d EPT_QMHCHRLE    c                   x'0458'
     d EPT_QMHRMRLE    c                   x'0459'
     d EPT_QMHDSPRL    c                   x'045A'
     d EPT_QUIPPRSL    c                   x'045B'
     d EPT_QMHCRTRL    c                   x'045C'
     d EPT_QWTCCTBJ    c                   x'045D'
     d EPT_QWTMCDVX    c                   x'045E'
     d EPT_QWTMCERP    c                   x'045F'
     d EPT_QWTMCDSP    c                   x'0460'
     d EPT_QWCSCRLR    c                   x'0461'
     d EPT_QWCLINSR    c                   x'0462'
     d EPT_QWCLMNSR    c                   x'0463'
     d EPT_QLIDSPLL    c                   x'0464'
     d EPT_QQXCA       c                   x'0465'
     d EPT_QLIFITYP    c                   x'0466'
     d EPT_QWSEXTSA    c                   x'0467'
     d EPT_QDCDSLD     c                   x'0468'
     d EPT_QTACHECK    c                   x'0469'
     d EPT_QDKCHECK    c                   x'046A'
     d EPT_QDKCHEXT    c                   x'046B'
     d EPT_QUIPPSTO    c                   x'046C'
     d EPT_QJOCMPJE    c                   x'046D'
     d EPT_QJORTVJE    c                   x'046E'
     d EPT_QCASPCRT    c                   x'046F'
     d EPT_QCAIEXIT    c                   x'0470'
     d EPT_QSYCKCMD    c                   x'0471'
     d EPT_QSWNOSES    c                   x'0472'
     d EPT_QSWIDLES    c                   x'0473'
     d EPT_QSYWRKOW    c                   x'0474'
     d EPT_QSWHRCMN    c                   x'0475'
     d EPT_QBSASYNC    c                   x'0476'
     d EPT_QDCCRDAS    c                   x'0477'
     d EPT_QDCCHDFN    c                   x'0478'
     d EPT_QDBRSPRE    c                   x'0479'
     d EPT_QDBRSPST    c                   x'047A'
     d EPT_QWCCCHNC    c                   x'047B'
     d EPT_QWCCDSNC    c                   x'047C'
     d EPT_QDDSPRDB    c                   x'047D'
     d EPT_QDDCKDB     c                   x'047E'
     d EPT_QDDRMVDV    c                   x'047F'
     d EPT_QLICHLBL    c                   x'0480'
     d EPT_QMHSAVMQ    c                   x'0481'
     d EPT_QMHRSTMQ    c                   x'0482'
     d EPT_QMHDUPMQ    c                   x'0483'
     d EPT_QLICRDUP    c                   x'0484'
     d EPT_QDMACKEH    c                   x'0485'
     d EPT_QWSSETWS    c                   x'0486'
     d EPT_QDBRNMME    c                   x'0487'
     d EPT_QGDDHI14    c                   x'0488'
     d EPT_QGDDHI24    c                   x'0489'
     d EPT_QAR5219     c                   x'048A'
     d EPT_QDCCHDBS    c                   x'048B'
     d EPT_QWCSHCFR    c                   x'048C'
     d EPT_QDBDUPFI    c                   x'048D'
     d EPT_QDBSEQMP    c                   x'048E'
     d EPT_QWHFDCHK    c                   x'048F'
     d EPT_QWHFDOUT    c                   x'0490'
     d EPT_QWHOUTFL    c                   x'0491'
     d EPT_QWHCLEAN    c                   x'0492'
     d EPT_QEMATTN     c                   x'0493'
     d EPT_QEMBSCEH    c                   x'0494'
     d EPT_QDMDSPIX    c                   x'0495'
     d EPT_QEMIEXIT    c                   x'0496'
     d EPT_QEMIOERR    c                   x'0497'
     d EPT_QAPRSTRB    c                   x'0498'
     d EPT_QEMPESTR    c                   x'0499'
     d EPT_QEMPEXIT    c                   x'049A'
     d EPT_QDMCDMQE    c                   x'049B'
     d EPT_QEMTSTRQ    c                   x'049C'
     d EPT_QEMWSEH     c                   x'049D'
     d EPT_QEM3270     c                   x'049E'
     d EPT_QKJCRDCT    c                   x'049F'
     d EPT_QKJCPTBL    c                   x'04A0'
     d EPT_QKJIGCNV    c                   x'04A1'
     d EPT_QKJRTENT    c                   x'04A2'
     d EPT_QKJMDWRD    c                   x'04A3'
     d EPT_QKJRTWRD    c                   x'04A4'
     d EPT_QKJRMENT    c                   x'04A5'
     d EPT_QKJDSDCT    c                   x'04A6'
     d EPT_QKJEROOT    c                   x'04A7'
     d EPT_QKJEDIT     c                   x'04A8'
     d EPT_QKJEDSEL    c                   x'04A9'
     d EPT_QWPSETPT    c                   x'04AA'
     d EPT_QEMPCNTL    c                   x'04AB'
     d EPT_QEMPEBSC    c                   x'04AC'
     d EPT_QEMPESNA    c                   x'04AD'
     d EPT_QEMPESCS    c                   x'04AE'
     d EPT_QEMPRINT    c                   x'04AF'
     d EPT_QEMSWSEH    c                   x'04B0'
     d EPT_QEMSNAEH    c                   x'04B1'
     d EPT_QEMSYSRQ    c                   x'04B2'
     d EPT_QEMSPEND    c                   x'04B3'
     d EPT_QEMRST      c                   x'04B4'
     d EPT_QWSSRPGM    c                   x'04B5'
     d EPT_QKJFIXUP    c                   x'04B6'
     d EPT_QEMWFCEH    c                   x'04B7'
     d EPT_QEMPESEH    c                   x'04B8'
     d EPT_QRAHELP     c                   x'04B9'
     d EPT_QPAEND      c                   x'04BA'
     d EPT_QZSPWSEA    c                   x'04BB'
     d EPT_QPAITERM    c                   x'04BC'
     d EPT_QPAPASI     c                   x'04BD'
     d EPT_QPAPASS     c                   x'04BE'
     d EPT_QSWPGEV     c                   x'04BF'
     d EPT_QPAPCEH     c                   x'04C0'
     d EPT_QPASYSRQ    c                   x'04C1'
     d EPT_QDCCKCAP    c                   x'04C2'
     d EPT_QKJHNTBL    c                   x'04C3'
     d EPT_QTEMFMT     c                   x'04C4'
     d EPT_QGDLROPF    c                   x'04C5'
     d EPT_QGDDHI04    c                   x'04C6'
     d EPT_QGDDGI4     c                   x'04C7'
     d EPT_QWTCCCHG    c                   x'04C8'
     d EPT_QWTCCTFG    c                   x'04C9'
     d EPT_QWTCCRVG    c                   x'04CA'
     d EPT_QWTCCTRG    c                   x'04CB'
     d EPT_QWTSCSEL    c                   x'04CC'
     d EPT_QWTMMCHG    c                   x'04CD'
     d EPT_QWTMMRVG    c                   x'04CE'
     d EPT_QWTMMTRG    c                   x'04CF'
     d EPT_QWPGRAPH    c                   x'04D0'
     d EPT_QWPORDER    c                   x'04D1'
     d EPT_QWPGRCLS    c                   x'04D2'
     d EPT_QSYUPASR    c                   x'04D3'
     d EPT_QSYVFCHP    c                   x'04D4'
     d EPT_QSYRTVUP    c                   x'04D5'
     d EPT_QWTSCOPR    c                   x'04D6'
     d EPT_QWTSEATN    c                   x'04D7'
     d EPT_QWTCCSTA    c                   x'04D8'
     d EPT_QSRCLNUP    c                   x'04D9'
     d EPT_QSRCLOSE    c                   x'04DA'
     d EPT_QSRCSAVF    c                   x'04DB'
     d EPT_QSRFEOD     c                   x'04DC'
     d EPT_QSRFMERR    c                   x'04DD'
     d EPT_QSRGET      c                   x'04DE'
     d EPT_QSROPEN     c                   x'04DF'
     d EPT_QSRPUT      c                   x'04E0'
     d EPT_QSRSVSFD    c                   x'04E1'
     d EPT_QSRDSAVF    c                   x'04E2'
     d EPT_QDFRSTDF    c                   x'04E3'
     d EPT_QDFSAVDF    c                   x'04E4'
     d EPT_QFNMNMBR    c                   x'04E5'
     d EPT_QFNMNTBL    c                   x'04E6'
     d EPT_QFNROUTE    c                   x'04E7'
     d EPT_QFNSBMJB    c                   x'04E8'
     d EPT_QFNREAD     c                   x'04E9'
     d EPT_QFNWRT      c                   x'04EA'
     d EPT_QFNWRTI     c                   x'04EB'
     d EPT_QWTSCJCC    c                   x'04EC'
     d EPT_QGDDGCTF    c                   x'04ED'
     d EPT_QGDACFP     c                   x'04EE'
     d EPT_QGDACIN     c                   x'04EF'
     d EPT_QGDACTRM    c                   x'04F0'
     d EPT_QGDAC0      c                   x'04F1'
     d EPT_QGDAEP      c                   x'04F2'
     d EPT_QGDAINVP    c                   x'04F3'
     d EPT_QGDDHI06    c                   x'04F4'
     d EPT_QGDASCPH    c                   x'04F5'
     d EPT_QGDBADTM    c                   x'04F6'
     d EPT_QGDBARS     c                   x'04F7'
     d EPT_QGDBASEL    c                   x'04F8'
     d EPT_QGDBATT     c                   x'04F9'
     d EPT_QGDBBGS     c                   x'04FA'
     d EPT_QGDBBLNK    c                   x'04FB'
     d EPT_QGDBCHRT    c                   x'04FC'
     d EPT_QGDBCHSG    c                   x'04FD'
     d EPT_QGDBCHVU    c                   x'04FE'
     d EPT_QGDBCRNG    c                   x'04FF'
     d EPT_QSCMDMPS    c                   x'0500'
     d EPT_QGDBDKEY    c                   x'0501'
     d EPT_QGDBDOAX    c                   x'0502'
     d EPT_QGDBDRAW    c                   x'0503'
     d EPT_QGDBDRAX    c                   x'0504'
     d EPT_QGDBDSAX    c                   x'0505'
     d EPT_QGDBDSDO    c                   x'0506'
     d EPT_QGDBDTTL    c                   x'0507'
     d EPT_QGDBEDTX    c                   x'0508'
     d EPT_QGDBGFMT    c                   x'0509'
     d EPT_QGDBGFTX    c                   x'050A'
     d EPT_QGDBGLBS    c                   x'050B'
     d EPT_QGDBHIST    c                   x'050C'
     d EPT_QGDBLABL    c                   x'050D'
     d EPT_QGDDGPO     c                   x'050E'
     d EPT_QGDBMAX     c                   x'050F'
     d EPT_QGDBMOVE    c                   x'0510'
     d EPT_QGDBNOTE    c                   x'0511'
     d EPT_QGDBPIE     c                   x'0512'
     d EPT_QGDBPLOT    c                   x'0513'
     d EPT_QGDBRNIT    c                   x'0514'
     d EPT_QGDBSET     c                   x'0515'
     d EPT_QGDBSTRT    c                   x'0516'
     d EPT_QGDBVENN    c                   x'0517'
     d EPT_QGDDBCRT    c                   x'0518'
     d EPT_QGDDBDEF    c                   x'0519'
     d EPT_QGDDBDEL    c                   x'051A'
     d EPT_QGDDBFN1    c                   x'051B'
     d EPT_QGDDBFN2    c                   x'051C'
     d EPT_QGDDBSEL    c                   x'051D'
     d EPT_QGDDCAS     c                   x'051E'
     d EPT_QGDDCCD     c                   x'051F'
     d EPT_QGDDCDS     c                   x'0520'
     d EPT_QGDDCES     c                   x'0521'
     d EPT_QGDDCGS     c                   x'0522'
     d EPT_QGDDCOS     c                   x'0523'
     d EPT_QGDDCPC     c                   x'0524'
     d EPT_QGDDCPS     c                   x'0525'
     d EPT_QGDDCPU     c                   x'0526'
     d EPT_QGDDCQD     c                   x'0527'
     d EPT_QGDDCQS     c                   x'0528'
     d EPT_QGDDCRS     c                   x'0529'
     d EPT_QGDDCTE     c                   x'052A'
     d EPT_QGDDCVS     c                   x'052B'
     d EPT_QGDDCWIN    c                   x'052C'
     d EPT_QGDDECRT    c                   x'052D'
     d EPT_QGDDEDEF    c                   x'052E'
     d EPT_QGDDEDEL    c                   x'052F'
     d EPT_QGDDEFN1    c                   x'0530'
     d EPT_QGDDEFN2    c                   x'0531'
     d EPT_QGDDESEL    c                   x'0532'
     d EPT_QGDDGAR     c                   x'0533'
     d EPT_QGDDGS1     c                   x'0534'
     d EPT_QGDDGCE     c                   x'0535'
     d EPT_QGDDGCL     c                   x'0536'
     d EPT_QGDDGCR     c                   x'0537'
     d EPT_QGDDGP1     c                   x'0538'
     d EPT_QGDDGGI     c                   x'0539'
     d EPT_QGDDGIG     c                   x'053A'
     d EPT_QGDDGI0     c                   x'053B'
     d EPT_QGDDGI5     c                   x'053C'
     d EPT_QGDDM       c                   x'053D'
     d EPT_QGDLTQ00    c                   x'053E'
     d EPT_QGDLRO1F    c                   x'053F'
     d EPT_QGDLRO00    c                   x'0540'
     d EPT_QGDDGI1     c                   x'0541'
     d EPT_QGDD1C      c                   x'0542'
     d EPT_QWTSCPSH    c                   x'0543'
     d EPT_QWTSCPOP    c                   x'0544'
     d EPT_QGDDGI6     c                   x'0545'
     d EPT_QGDDGMM     c                   x'0546'
     d EPT_QGDDGPA     c                   x'0547'
     d EPT_QGDDGPC     c                   x'0548'
     d EPT_QGDDGPE     c                   x'0549'
     d EPT_QGDDGPI     c                   x'054A'
     d EPT_QGDDGPM     c                   x'054B'
     d EPT_QDCADFLE    c                   x'054C'
     d EPT_QGDDGPR     c                   x'054D'
     d EPT_QGDDGPS     c                   x'054E'
     d EPT_QGDDGP5     c                   x'054F'
     d EPT_QGDDGP6     c                   x'0550'
     d EPT_QGDDGQC     c                   x'0551'
     d EPT_QGDDGQI     c                   x'0552'
     d EPT_QDCRVFLE    c                   x'0553'
     d EPT_QGDDGSE     c                   x'0554'
     d EPT_QGDDGSQ     c                   x'0555'
     d EPT_QGDDGS5     c                   x'0556'
     d EPT_QGDDGWI     c                   x'0557'
     d EPT_QGDDGXC     c                   x'0558'
     d EPT_QGDDGXE     c                   x'0559'
     d EPT_QGDDHI05    c                   x'055A'
     d EPT_QTBTBLMG    c                   x'055B'
     d EPT_QGDDSDQ     c                   x'055C'
     d EPT_QGDDSDS     c                   x'055D'
     d EPT_QGDDSEH     c                   x'055E'
     d EPT_QGDDSF1     c                   x'055F'
     d EPT_QDFDMGNT    c                   x'0560'
     d EPT_QMHDSPJL    c                   x'0561'
     d EPT_QGDDSOO     c                   x'0562'
     d EPT_QOSOPEN     c                   x'0563'
     d EPT_QGDDSRO     c                   x'0564'
     d EPT_QGDD5C      c                   x'0565'
     d EPT_QOSLSTUF    c                   x'0566'
     d EPT_QOSCLRRQ    c                   x'0567'
     d EPT_QGDEABND    c                   x'0568'
     d EPT_QSZPREXB    c                   x'0569'
     d EPT_QGDEOSD0    c                   x'056A'
     d EPT_QGDERO0F    c                   x'056B'
     d EPT_QGDILASP    c                   x'056C'
     d EPT_QGDLAR1F    c                   x'056D'
     d EPT_QGDLIN1F    c                   x'056E'
     d EPT_QNFCLRQ     c                   x'056F'
     d EPT_QGDLRN1F    c                   x'0570'
     d EPT_QOSDIEXT    c                   x'0571'
     d EPT_QOSDSRCV    c                   x'0572'
     d EPT_QOSRFLSV    c                   x'0573'
     d EPT_QNFTPDTA    c                   x'0574'
     d EPT_QGDLTM1F    c                   x'0575'
     d EPT_QGDNUMER    c                   x'0576'
     d EPT_QARIPDS     c                   x'0577'
     d EPT_QNFUNPAK    c                   x'0578'
     d EPT_QGDYGQC     c                   x'0579'
     d EPT_QGDYINTM    c                   x'057A'
     d EPT_QGDYRO00    c                   x'057B'
     d EPT_QGDYRSRL    c                   x'057C'
     d EPT_QGDYTRIG    c                   x'057D'
     d EPT_QSRSVPRE    c                   x'057E'
     d EPT_QSRSVPST    c                   x'057F'
     d EPT_QSRSVDEQ    c                   x'0580'
     d EPT_QSRSVEOV    c                   x'0581'
     d EPT_QPQCSENS    c                   x'0582'
     d EPT_QDKINZFY    c                   x'0583'
     d EPT_QDBOPENC    c                   x'0584'
     d EPT_QDBCLOSC    c                   x'0585'
     d EPT_QSYEXGRM    c                   x'0586'
     d EPT_QWTCCSRQ    c                   x'0587'
     d EPT_QPZCPYCV    c                   x'0588'
     d EPT_QP0ZDSPD    c                   x'0589'
     d EPT_QCOEXIT     c                   x'058A'
     d EPT_QCOROUTE    c                   x'058B'
     d EPT_QAEAPPL     c                   x'058C'
     d EPT_QSPACCLG    c                   x'058D'
     d EPT_QOSADACP    c                   x'058E'
     d EPT_QOSDAACP    c                   x'058F'
     d EPT_QOSGAACP    c                   x'0590'
     d EPT_QOSRAACP    c                   x'0591'
     d EPT_QOSDATCP    c                   x'0592'
     d EPT_QOSRMACP    c                   x'0593'
     d EPT_QOSDLLCP    c                   x'0594'
     d EPT_QOSDLDCP    c                   x'0595'
     d EPT_QOSCHGCP    c                   x'0596'
     d EPT_QSZPREXI    c                   x'0597'
     d EPT_QOCDUMP     c                   x'0598'
     d EPT_QOSGDACP    c                   x'0599'
     d EPT_QOSRDACP    c                   x'059A'
     d EPT_QOSDDACP    c                   x'059B'
     d EPT_QQA2EDIT    c                   x'059C'
     d EPT_QQAKPARM    c                   x'059D'
     d EPT_QQAKESEL    c                   x'059E'
     d EPT_QOSCRTRQ    c                   x'059F'
     d EPT_QOSDIRPT    c                   x'05A0'
     d EPT_QQAKQSR2    c                   x'05A1'
     d EPT_QQAKAUTH    c                   x'05A2'
     d EPT_QOSDLUSR    c                   x'05A3'
     d EPT_QSWPGNOR    c                   x'05A4'
     d EPT_QSCMJMQ     c                   x'05A5'
     d EPT_QOPIE       c                   x'05A6'
     d EPT_QOPNH       c                   x'05A7'
     d EPT_QOPSD       c                   x'05A8'
     d EPT_QOTAHEAD    c                   x'05A9'
     d EPT_QIDSYCW     c                   x'05AA'
     d EPT_QGDCRTVS    c                   x'05AB'
     d EPT_QOSAPPC     c                   x'05AC'
     d EPT_QOSINIT     c                   x'05AD'
     d EPT_QOSCTRLR    c                   x'05AE'
     d EPT_QOSPARSE    c                   x'05AF'
     d EPT_QOSIGNON    c                   x'05B0'
     d EPT_QOSCHKAF    c                   x'05B1'
     d EPT_QOSVFUSR    c                   x'05B2'
     d EPT_QOSSIIO     c                   x'05B3'
     d EPT_QOSCTDOC    c                   x'05B4'
     d EPT_QOSFILE     c                   x'05B5'
     d EPT_QOSIDPUP    c                   x'05B6'
     d EPT_QOSEARCH    c                   x'05B7'
     d EPT_QOSTLMIT    c                   x'05B8'
     d EPT_QOSDELET    c                   x'05B9'
     d EPT_QOSCKDLT    c                   x'05BA'
     d EPT_QOSRETRV    c                   x'05BB'
     d EPT_QOSDSTRB    c                   x'05BC'
     d EPT_QOSREQDS    c                   x'05BD'
     d EPT_QOSOBTAN    c                   x'05BE'
     d EPT_QOSLIST     c                   x'05BF'
     d EPT_QOSLSTPT    c                   x'05C0'
     d EPT_QOSCNLDS    c                   x'05C1'
     d EPT_QOSMSRCH    c                   x'05C2'
     d EPT_QOSMDISP    c                   x'05C3'
     d EPT_QSWPGFR     c                   x'05C4'
     d EPT_QOSMSCTL    c                   x'05C5'
     d EPT_QOSMRECV    c                   x'05C6'
     d EPT_QOSMLIST    c                   x'05C7'
     d EPT_QOSLSTIX    c                   x'05C8'
     d EPT_QOSSETCV    c                   x'05C9'
     d EPT_QOSDIATP    c                   x'05CA'
     d EPT_QOSRCVDC    c                   x'05CB'
     d EPT_QOSRCVST    c                   x'05CC'
     d EPT_QOSLFLSV    c                   x'05CD'
     d EPT_QOSIFLSV    c                   x'05CE'
     d EPT_QOSOFLSV    c                   x'05CF'
     d EPT_QOSIEXIT    c                   x'05D0'
     d EPT_QOSRDRCV    c                   x'05D1'
     d EPT_QOSSBMTR    c                   x'05D2'
     d EPT_QOSOBRCV    c                   x'05D3'
     d EPT_QOSCNRCV    c                   x'05D4'
     d EPT_QOSRCRCV    c                   x'05D5'
     d EPT_QGDDHI34    c                   x'05D6'
     d EPT_QSWPGFRH    c                   x'05D7'
     d EPT_QOSCKRCV    c                   x'05D8'
     d EPT_QOSRTRCV    c                   x'05D9'
     d EPT_QOSFBKOT    c                   x'05DA'
     d EPT_QOSSBKOT    c                   x'05DB'
     d EPT_QOSRMIEX    c                   x'05DC'
     d EPT_QOSPRASP    c                   x'05DD'
     d EPT_QOSIPLR     c                   x'05DE'
     d EPT_QZDAFBIX    c                   x'05DF'
     d EPT_QZDASNFB    c                   x'05E0'
     d EPT_QZDBLDRQ    c                   x'05E1'
     d EPT_QZDCKCND    c                   x'05E2'
     d EPT_QZDDDSIX    c                   x'05E3'
     d EPT_QZDDDTST    c                   x'05E4'
     d EPT_QZDDEQRQ    c                   x'05E5'
     d EPT_QZDDSPCF    c                   x'05E6'
     d EPT_QZDDSPIX    c                   x'05E7'
     d EPT_QZDDSPNM    c                   x'05E8'
     d EPT_QZDDSPRT    c                   x'05E9'
     d EPT_QZDDSPST    c                   x'05EA'
     d EPT_QZDDSPSV    c                   x'05EB'
     d EPT_QZDENQRQ    c                   x'05EC'
     d EPT_QZDEXTRT    c                   x'05ED'
     d EPT_QZDGFSLR    c                   x'05EE'
     d EPT_QZDGFSRC    c                   x'05EF'
     d EPT_QZDGFSRD    c                   x'05F0'
     d EPT_QZDGFSWT    c                   x'05F1'
     d EPT_QSWPGCPP    c                   x'05F2'
     d EPT_QZDNKSF2    c                   x'05F3'
     d EPT_QZDNQDQX    c                   x'05F4'
     d EPT_QUCRTVTB    c                   x'05F5'
     d EPT_QZDRCVDT    c                   x'05F6'
     d EPT_QZDRCVIX    c                   x'05F7'
     d EPT_QZDRCVR     c                   x'05F8'
     d EPT_QZDRECLM    c                   x'05F9'
     d EPT_QZDRECOV    c                   x'05FA'
     d EPT_QZDROUTR    c                   x'05FB'
     d EPT_QZDROUTX    c                   x'05FC'
     d EPT_QZDSENDR    c                   x'05FD'
     d EPT_QZDSNDEH    c                   x'05FE'
     d EPT_QZDSNDIX    c                   x'05FF'
     d EPT_QZDSTRIE    c                   x'0600'
     d EPT_QZDSTRUP    c                   x'0601'
     d EPT_QZDSTSND    c                   x'0602'
     d EPT_QZDTIMEH    c                   x'0603'
     d EPT_QWPIPTFL    c                   x'0604'
     d EPT_QAECHKA     c                   x'0605'
     d EPT_QSOCWLOO    c                   x'0606'
     d EPT_QFPADMAT    c                   x'0607'
     d EPT_QWSPUDDS    c                   x'0608'
     d EPT_QALCATPX    c                   x'0609'
     d EPT_QOSRCVRQ    c                   x'060A'
     d EPT_QCLCHGPG    c                   x'060B'
     d EPT_QCLCHEXT    c                   x'060C'
     d EPT_QZDRCLIX    c                   x'060D'
     d EPT_QFNREADI    c                   x'060E'
     d EPT_QNFRBLDQ    c                   x'060F'
     d EPT_QNFRCLNF    c                   x'0610'
     d EPT_QRAASNKB    c                   x'0611'
     d EPT_QDFDMPDF    c                   x'0612'
     d EPT_QDFDUPDF    c                   x'0613'
     d EPT_QDBISHRX    c                   x'0614'
     d EPT_QDCRTLD     c                   x'0615'
     d EPT_QWPGREOP    c                   x'0616'
     d EPT_QDCRSDD     c                   x'0617'
     d EPT_QDCWKFOF    c                   x'0618'
     d EPT_QFNIOMGR    c                   x'0619'
     d EPT_QOSASYNC    c                   x'061A'
     d EPT_QOSCKRQS    c                   x'061B'
     d EPT_QOSCANL2    c                   x'061C'
     d EPT_QOSTRAL2    c                   x'061D'
     d EPT_QLIROHDL    c                   x'061E'
     d EPT_QWCCRTNC    c                   x'061F'
     d EPT_QDCRTCD     c                   x'0620'
     d EPT_QSPCIDSP    c                   x'0621'
     d EPT_QSPCIPRT    c                   x'0622'
     d EPT_QDMOVRPR    c                   x'0623'
     d EPT_QOSEXEC     c                   x'0624'
     d EPT_QOSEXRCV    c                   x'0625'
     d EPT_QOSRFLIX    c                   x'0626'
     d EPT_QOSMODIF    c                   x'0627'
     d EPT_QIDVDW      c                   x'0628'
     d EPT_QIDDDW      c                   x'0629'
     d EPT_QCNSMCTL    c                   x'062A'
     d EPT_QCNSEXIT    c                   x'062B'
     d EPT_QCNSSCPP    c                   x'062C'
     d EPT_QCNSCMDI    c                   x'062D'
     d EPT_QCNSINIT    c                   x'062E'
     d EPT_QCNSTERM    c                   x'062F'
     d EPT_QCNSSEND    c                   x'0630'
     d EPT_QCNSRCV     c                   x'0631'
     d EPT_QCNSRDDM    c                   x'0632'
     d EPT_QCNSEVTH    c                   x'0633'
     d EPT_QCNXDUMP    c                   x'0634'
     d EPT_QCNXPRSE    c                   x'0635'
     d EPT_QCNXSTGM    c                   x'0636'
     d EPT_QCNXBLD     c                   x'0637'
     d EPT_QCNTEXIT    c                   x'0638'
     d EPT_QCNTEDDM    c                   x'0639'
     d EPT_QCNTINIT    c                   x'063A'
     d EPT_QCNTRCV     c                   x'063B'
     d EPT_QCNTSEND    c                   x'063C'
     d EPT_QDBAPDDL    c                   x'063D'
     d EPT_QCNTMCTL    c                   x'063E'
     d EPT_QCNTSBMR    c                   x'063F'
     d EPT_QCNTEXCR    c                   x'0640'
     d EPT_QSPFXDTA    c                   x'0641'
     d EPT_QUPTAPVR    c                   x'0642'
     d EPT_QUHWIXXT    c                   x'0643'
     d EPT_QWSQRYWS    c                   x'0644'
     d EPT_QOSPRINT    c                   x'0645'
     d EPT_QSPPMTQD    c                   x'0646'
     d EPT_QSPDSPQD    c                   x'0647'
     d EPT_QWTMCAUF    c                   x'0648'
     d EPT_QWPREOPN    c                   x'0649'
     d EPT_QWPIPUT     c                   x'064A'
     d EPT_QZDINSTL    c                   x'064B'
     d EPT_QMHBREVT    c                   x'064C'
     d EPT_QMHTSEVT    c                   x'064D'
     d EPT_QMHMRGMF    c                   x'064E'
     d EPT_QWTMETMR    c                   x'064F'
     d EPT_QPIPIPE     c                   x'0650'
     d EPT_QPIPCEH     c                   x'0651'
     d EPT_QPIIEXIT    c                   x'0652'
     d EPT_QSYEVAUT    c                   x'0653'
     d EPT_QTSCLOSE    c                   x'0654'
     d EPT_QTSUDR      c                   x'0655'
     d EPT_QTSQUERY    c                   x'0656'
     d EPT_QTSPUT      c                   x'0657'
     d EPT_QTSPUTM     c                   x'0658'
     d EPT_QTSOPEN     c                   x'0659'
     d EPT_QTSLOCK     c                   x'065A'
     d EPT_QDCRTDD     c                   x'065B'
     d EPT_QTSLIXIT    c                   x'065C'
     d EPT_QTSCOPY     c                   x'065D'
     d EPT_QTSEXTCT    c                   x'065E'
     d EPT_QTSFEOD     c                   x'065F'
     d EPT_QTSGET      c                   x'0660'
     d EPT_QTSGETM     c                   x'0661'
     d EPT_QTSIEXIT    c                   x'0662'
     d EPT_QTSMGAFT    c                   x'0663'
     d EPT_QTSMDDMF    c                   x'0664'
     d EPT_QTSTCLOS    c                   x'0665'
     d EPT_QTSTCLRF    c                   x'0666'
     d EPT_QTSTCRTF    c                   x'0667'
     d EPT_QTSTDCLF    c                   x'0668'
     d EPT_QTSTDELF    c                   x'0669'
     d EPT_QTSTFEXD    c                   x'066A'
     d EPT_QTSTIO      c                   x'066B'
     d EPT_QTSTLCKF    c                   x'066C'
     d EPT_QTSTLODF    c                   x'066D'
     d EPT_QTSTOPEN    c                   x'066E'
     d EPT_QTSTRNMF    c                   x'066F'
     d EPT_QTSTUNLF    c                   x'0670'
     d EPT_QTST8GEN    c                   x'0671'
     d EPT_QTST8IO     c                   x'0672'
     d EPT_QOSIOUTF    c                   x'0673'
     d EPT_QDMLCKIX    c                   x'0674'
     d EPT_QZDDLOG     c                   x'0675'
     d EPT_QLPRPCPR    c                   x'0676'
     d EPT_QCDCHDFT    c                   x'0677'
     d EPT_QSYPGMAD    c                   x'0678'
     d EPT_QWPPUTF     c                   x'0679'
     d EPT_QWPPFLDF    c                   x'067A'
     d EPT_QWPIPUTF    c                   x'067B'
     d EPT_QWPIFLDF    c                   x'067C'
     d EPT_QLICHGOB    c                   x'067D'
     d EPT_QTSBLFMT    c                   x'067E'
     d EPT_QTSUIXIT    c                   x'067F'
     d EPT_QDBLVLID    c                   x'0680'
     d EPT_QCIOPEN     c                   x'0681'
     d EPT_QCIMRT      c                   x'0682'
     d EPT_QCIACCIN    c                   x'0683'
     d EPT_QPAPAST2    c                   x'0684'
     d EPT_QJOENDAP    c                   x'0685'
     d EPT_QJOJRNAP    c                   x'0686'
     d EPT_QSPCVSEP    c                   x'0687'
     d EPT_QJOMVOBJ    c                   x'0688'
     d EPT_QPDELOG     c                   x'0689'
     d EPT_QTSTUIXT    c                   x'068A'
     d EPT_QSYWRKO1    c                   x'068B'
     d EPT_QUICDLTM    c                   x'068C'
     d EPT_QTSUNLCK    c                   x'068D'
     d EPT_QDBPUTD     c                   x'068E'
     d EPT_QTSS8MSG    c                   x'068F'
     d EPT_QCNXBOBJ    c                   x'0690'
     d EPT_QCNXBCMD    c                   x'0691'
     d EPT_QCNXBREP    c                   x'0692'
     d EPT_QSPPRTQ     c                   x'0693'
     d EPT_QESROUT     c                   x'0694'
     d EPT_QTSGETSQ    c                   x'0695'
     d EPT_QWTPMCHJ    c                   x'0696'
     d EPT_QTST8MSG    c                   x'0697'
     d EPT_QTSSNMSG    c                   x'0698'
     d EPT_QJOFIXIT    c                   x'0699'
     d EPT_QDCRTMD     c                   x'069A'
     d EPT_QEZWRJOB    c                   x'069B'
     d EPT_QQXCQ       c                   x'069C'
     d EPT_QDCCHCLW    c                   x'069D'
     d EPT_QALDTPRD    c                   x'069E'
     d EPT_QICOPEN     c                   x'069F'
     d EPT_QICCLOSE    c                   x'06A0'
     d EPT_QICTPP      c                   x'06A1'
     d EPT_QICGET      c                   x'06A2'
     d EPT_QICPUT      c                   x'06A3'
     d EPT_QQXCF       c                   x'06A4'
     d EPT_QICFMTSL    c                   x'06A5'
     d EPT_QICERP      c                   x'06A6'
     d EPT_QY2FTML     c                   x'06A7'
     d EPT_QOSCPRCV    c                   x'06A8'
     d EPT_QALDTSUP    c                   x'06A9'
     d EPT_QSPPMTHF    c                   x'06AA'
     d EPT_QTBCONST    c                   x'06AB'
     d EPT_QTSSCRTF    c                   x'06AC'
     d EPT_QDCRTSD     c                   x'06AD'
     d EPT_QCISBSI     c                   x'06AE'
     d EPT_QCISBST     c                   x'06AF'
     d EPT_QDBPUTDR    c                   x'06B0'
     d EPT_QODOPEN     c                   x'06B1'
     d EPT_QODCLOSE    c                   x'06B2'
     d EPT_QODCRT      c                   x'06B3'
     d EPT_QODGETTX    c                   x'06B4'
     d EPT_QODINFTX    c                   x'06B5'
     d EPT_QODPUTTX    c                   x'06B6'
     d EPT_QODDLTTX    c                   x'06B7'
     d EPT_QODGETAR    c                   x'06B8'
     d EPT_QODPUTAR    c                   x'06B9'
     d EPT_QODDLTAR    c                   x'06BA'
     d EPT_QODGETDS    c                   x'06BB'
     d EPT_QODPUTDS    c                   x'06BC'
     d EPT_QODGETP     c                   x'06BD'
     d EPT_QODPUTP     c                   x'06BE'
     d EPT_QPDDSP      c                   x'06BF'
     d EPT_QPDFRUDP    c                   x'06C0'
     d EPT_QPDGCNFG    c                   x'06C1'
     d EPT_QPDHELP     c                   x'06C2'
     d EPT_QPDIEXIT    c                   x'06C3'
     d EPT_QPDPARDR    c                   x'06C4'
     d EPT_QDMDLTDV    c                   x'06C5'
     d EPT_QDMGETDV    c                   x'06C6'
     d EPT_QDMOVRDV    c                   x'06C7'
     d EPT_QACPSR      c                   x'06C8'
     d EPT_QACPSRIO    c                   x'06C9'
     d EPT_QACOPEN     c                   x'06CA'
     d EPT_QACPUT      c                   x'06CB'
     d EPT_QACGET      c                   x'06CC'
     d EPT_QACCLOSE    c                   x'06CD'
     d EPT_QACTPP      c                   x'06CE'
     d EPT_QACIOCMP    c                   x'06CF'
     d EPT_QACERP1     c                   x'06D0'
     d EPT_QACERP2     c                   x'06D1'
     d EPT_QACFMH7     c                   x'06D2'
     d EPT_QACVRYON    c                   x'06D3'
     d EPT_QACVRYOF    c                   x'06D4'
     d EPT_QACRSP      c                   x'06D5'
     d EPT_QACNFEVH    c                   x'06D6'
     d EPT_QACINASP    c                   x'06D7'
     d EPT_QACRVPIP    c                   x'06D8'
     d EPT_QT3LUDIN    c                   x'06D9'
     d EPT_QT3LUDRS    c                   x'06DA'
     d EPT_QT3UNSOL    c                   x'06DB'
     d EPT_QT3IOCMP    c                   x'06DC'
     d EPT_QWSHLM      c                   x'06DD'
     d EPT_QWSHELP     c                   x'06DE'
     d EPT_QACEFEVH    c                   x'06DF'
     d EPT_QRURTVRD    c                   x'06E0'
     d EPT_QRURASEV    c                   x'06E1'
     d EPT_QRUPTSAL    c                   x'06E2'
     d EPT_QMHSCLVL    c                   x'06E3'
     d EPT_QTAUSRLB    c                   x'06E4'
     d EPT_QQQQUERY    c                   x'06E5'
     d EPT_QSYCKSCV    c                   x'06E6'
     d EPT_QLICHLLE    c                   x'06E7'
     d EPT_QQQVALID    c                   x'06E8'
     d EPT_QQQOPTIM    c                   x'06E9'
     d EPT_QQQIMPLE    c                   x'06EA'
     d EPT_QQQQEXIT    c                   x'06EB'
     d EPT_QQQOPNQF    c                   x'06EC'
     d EPT_QQQBLQDT    c                   x'06ED'
     d EPT_QQQPARSE    c                   x'06EE'
     d EPT_QCACHLBL    c                   x'06EF'
     d EPT_QDBWHOCO    c                   x'06F0'
     d EPT_QTSSRNMF    c                   x'06F1'
     d EPT_QTSSDELF    c                   x'06F2'
     d EPT_QODIPL      c                   x'06F3'
     d EPT_QODINIT     c                   x'06F4'
     d EPT_QODTERM     c                   x'06F5'
     d EPT_QODDLT      c                   x'06F6'
     d EPT_QUSIEXIT    c                   x'06F7'
     d EPT_QOTAR       c                   x'06F8'
     d EPT_QICSPND     c                   x'06F9'
     d EPT_QICRSTR     c                   x'06FA'
     d EPT_QOSGETDP    c                   x'06FB'
     d EPT_QOTDW       c                   x'06FC'
     d EPT_QOTEP       c                   x'06FD'
     d EPT_QOTFR       c                   x'06FE'
     d EPT_QOTGR       c                   x'06FF'
     d EPT_QOTIM       c                   x'0700'
     d EPT_QOTJM       c                   x'0701'
     d EPT_QOTKR       c                   x'0702'
     d EPT_QOTLR       c                   x'0703'
     d EPT_QOTMR       c                   x'0704'
     d EPT_QOTND       c                   x'0705'
     d EPT_QOTRI       c                   x'0706'
     d EPT_QOTRT       c                   x'0707'
     d EPT_QDCCRFL     c                   x'0708'
     d EPT_QDCCPFL     c                   x'0709'
     d EPT_QOTXE       c                   x'070A'
     d EPT_QWTMETRI    c                   x'070B'
     d EPT_QWTLCDMA    c                   x'070C'
     d EPT_QACSUSPD    c                   x'070D'
     d EPT_QACRSUME    c                   x'070E'
     d EPT_QDCCHFL     c                   x'070F'
     d EPT_QSASUSPD    c                   x'0710'
     d EPT_QSARSUME    c                   x'0711'
     d EPT_QSAWMPSR    c                   x'0712'
     d EPT_QSAMSGBD    c                   x'0713'
     d EPT_QSACLOSE    c                   x'0714'
     d EPT_QSAOPEN     c                   x'0715'
     d EPT_QSAGET      c                   x'0716'
     d EPT_QSAPUT      c                   x'0717'
     d EPT_QSAEVMON    c                   x'0718'
     d EPT_QSAVRYON    c                   x'0719'
     d EPT_QPQCLINK    c                   x'071A'
     d EPT_QWPLNPRT    c                   x'071B'
     d EPT_QPQDSPSF    c                   x'071C'
     d EPT_QDCTRF      c                   x'071D'
     d EPT_QDCCRLTR    c                   x'071E'
     d EPT_QDCCRCBS    c                   x'071F'
     d EPT_QDCCKCBS    c                   x'0720'
     d EPT_QSWLDFR     c                   x'0721'
     d EPT_QDCCRCHS    c                   x'0722'
     d EPT_QDCCKCHS    c                   x'0723'
     d EPT_QDCCKLTR    c                   x'0724'
     d EPT_QSWLDFRH    c                   x'0725'
     d EPT_QDCCRCRW    c                   x'0726'
     d EPT_QDCCKCRW    c                   x'0727'
     d EPT_QDCVRDEH    c                   x'0728'
     d EPT_QDCCRCFN    c                   x'0729'
     d EPT_QDCCKCFN    c                   x'072A'
     d EPT_QPDHERR     c                   x'072B'
     d EPT_QDCCRLBS    c                   x'072C'
     d EPT_QOCCHKCF    c                   x'072D'
     d EPT_QDCCRLSD    c                   x'072E'
     d EPT_QDCCKLSD    c                   x'072F'
     d EPT_QDCCRLAS    c                   x'0730'
     d EPT_QIFTJOB     c                   x'0731'
     d EPT_QIFTRACE    c                   x'0732'
     d EPT_QIFPTREC    c                   x'0733'
     d EPT_QDCCRDBS    c                   x'0734'
     d EPT_QDCCRDFN    c                   x'0735'
     d EPT_QDCCRDHS    c                   x'0736'
     d EPT_QA1VRYON    c                   x'0737'
     d EPT_QA1VRYOF    c                   x'0738'
     d EPT_QA1VRYEV    c                   x'0739'
     d EPT_QA1PSR      c                   x'073A'
     d EPT_QJOVLIC     c                   x'073B'
     d EPT_QUSCMDLN    c                   x'073C'
     d EPT_QYFOPEN     c                   x'073D'
     d EPT_QYFCLOSE    c                   x'073E'
     d EPT_QYFGET      c                   x'073F'
     d EPT_QYFPSR      c                   x'0740'
     d EPT_QYFVRYON    c                   x'0741'
     d EPT_QYFVRYOF    c                   x'0742'
     d EPT_QYFERP1     c                   x'0743'
     d EPT_QYFERP2     c                   x'0744'
     d EPT_QDCDLLD     c                   x'0745'
     d EPT_QDCSTF      c                   x'0746'
     d EPT_QDCCRCLW    c                   x'0747'
     d EPT_QDCDLFL     c                   x'0748'
     d EPT_QDCDLCEH    c                   x'0749'
     d EPT_QDCCRCEH    c                   x'074A'
     d EPT_QDCRSCIG    c                   x'074B'
     d EPT_QDCCRDDK    c                   x'074C'
     d EPT_QAECHPGM    c                   x'074D'
     d EPT_QDCCRDLD    c                   x'074E'
     d EPT_QDCCKDLD    c                   x'074F'
     d EPT_QDCCRDLP    c                   x'0750'
     d EPT_QDCCKDLP    c                   x'0751'
     d EPT_QDCDLDD     c                   x'0752'
     d EPT_QDCDLDEH    c                   x'0753'
     d EPT_SUBRF1      c                   x'0754'
     d EPT_SUBRF2      c                   x'0755'
     d EPT_SUBRA1      c                   x'0756'
     d EPT_QEZCLSTG    c                   x'0757'
     d EPT_QPDSEXIT    c                   x'0758'
     d EPT_QHFRSLEP    c                   x'0759'
     d EPT_QJOMNEVT    c                   x'075A'
     d EPT_QEZWRPRT    c                   x'075B'
     d EPT_QWPLDTRN    c                   x'075C'
     d EPT_QWPASPRT    c                   x'075D'
     d EPT_QTADUP      c                   x'075E'
     d EPT_QEXCAFI     c                   x'075F'
     d EPT_QPQSASPC    c                   x'0760'
     d EPT_QPQYBLPZ    c                   x'0761'
     d EPT_QPQYBPPZ    c                   x'0762'
     d EPT_QPQYDCSZ    c                   x'0763'
     d EPT_QPQYEAGZ    c                   x'0764'
     d EPT_QPQYELPZ    c                   x'0765'
     d EPT_QEZSTCP     c                   x'0766'
     d EPT_QEZENCLU    c                   x'0767'
     d EPT_QEZCHCLU    c                   x'0768'
     d EPT_QEZCHPWS    c                   x'0769'
     d EPT_QEZRTCLU    c                   x'076A'
     d EPT_QEZRTPWS    c                   x'076B'
     d EPT_QEZWRCLU    c                   x'076C'
     d EPT_QEZWRPWS    c                   x'076D'
     d EPT_QEZEXCLU    c                   x'076E'
     d EPT_QEZEXPWS    c                   x'076F'
     d EPT_QCMREXX     c                   x'0770'
     d EPT_QUHADDIX    c                   x'0771'
     d EPT_QUHCRTIX    c                   x'0772'
     d EPT_QUHWRKIX    c                   x'0773'
     d EPT_QUHRMVIX    c                   x'0774'
     d EPT_QUHCHGIX    c                   x'0775'
     d EPT_QPQSCFIX    c                   x'0776'
     d EPT_QPQSDOCX    c                   x'0777'
     d EPT_QOPMCT      c                   x'0778'
     d EPT_QOCRNUSR    c                   x'0779'
     d EPT_QOCEMNTI    c                   x'077A'
     d EPT_QOCOLEMN    c                   x'077B'
     d EPT_QOCAUTO     c                   x'077C'
     d EPT_QOSRNUSR    c                   x'077D'
     d EPT_QSWCDSTO    c                   x'077E'
     d EPT_QUCRTTKT    c                   x'077F'
     d EPT_QPQRDOFM    c                   x'0780'
     d EPT_QPQSTRCX    c                   x'0781'
     d EPT_QPQSMSGX    c                   x'0782'
     d EPT_QPQYSTMZ    c                   x'0783'
     d EPT_QPQYIFMT    c                   x'0784'
     d EPT_QPZDSPCV    c                   x'0785'
     d EPT_QJOOBJSJ    c                   x'0786'
     d EPT_QP0FCTEX    c                   x'0787'
     d EPT_QDCWKFSF    c                   x'0788'
     d EPT_QSZRECOV    c                   x'0789'
     d EPT_QOSRCVEA    c                   x'078A'
     d EPT_QPQRDOFY    c                   x'078B'
     d EPT_QPQRHAID    c                   x'078C'
     d EPT_QDCPOID     c                   x'078D'
     d EPT_QDCDSID     c                   x'078E'
     d EPT_QDCDLID     c                   x'078F'
     d EPT_QPQRMSTG    c                   x'0790'
     d EPT_QDCDSNL     c                   x'0791'
     d EPT_QBIGET      c                   x'0792'
     d EPT_QBIBID      c                   x'0793'
     d EPT_QBIPUT      c                   x'0794'
     d EPT_QBIPUTCP    c                   x'0795'
     d EPT_QBIASYNC    c                   x'0796'
     d EPT_QBIERP      c                   x'0797'
     d EPT_QBIOPEN     c                   x'0798'
     d EPT_QBICLOSE    c                   x'0799'
     d EPT_QBIFSTIO    c                   x'079A'
     d EPT_QBIPSR      c                   x'079B'
     d EPT_QBISUSPD    c                   x'079C'
     d EPT_QBIRST      c                   x'079D'
     d EPT_QQQVWFLD    c                   x'079E'
     d EPT_QDMGETST    c                   x'079F'
     d EPT_QWPALLOC    c                   x'07A0'
     d EPT_QWPPUT      c                   x'07A1'
     d EPT_QWPPTFLD    c                   x'07A2'
     d EPT_QWPOERRS    c                   x'07A3'
     d EPT_QWPPERRS    c                   x'07A4'
     d EPT_QWPINASP    c                   x'07A5'
     d EPT_QWPSCTRN    c                   x'07A6'
     d EPT_QWPSCPRT    c                   x'07A7'
     d EPT_QEXIEVK     c                   x'07A8'
     d EPT_QWTLEOBD    c                   x'07A9'
     d EPT_QCMD        c                   x'07AA'
     d EPT_QSYCRTAL    c                   x'07AB'
     d EPT_QSYDLTAL    c                   x'07AC'
     d EPT_QSYADDAL    c                   x'07AD'
     d EPT_QSYCHGAL    c                   x'07AE'
     d EPT_QSYRTVAL    c                   x'07AF'
     d EPT_QSYRMVAL    c                   x'07B0'
     d EPT_QUIINMGR    c                   x'07B1'
     d EPT_QDBPOS      c                   x'07B2'
     d EPT_QIDCHKFI    c                   x'07B3'
     d EPT_QUIVPMGR    c                   x'07B4'
     d EPT_QUIMGFLW    c                   x'07B5'
     d EPT_QUIRCLAP    c                   x'07B6'
     d EPT_QODMISC3    c                   x'07B7'
     d EPT_QODCPYD     c                   x'07B8'
     d EPT_QODCPYDS    c                   x'07B9'
     d EPT_QODDLTDS    c                   x'07BA'
     d EPT_QODENSUR    c                   x'07BB'
     d EPT_QODFIND     c                   x'07BC'
     d EPT_QODLCKDS    c                   x'07BD'
     d EPT_QODLIST     c                   x'07BE'
     d EPT_QODMOVD     c                   x'07BF'
     d EPT_QODRDKEY    c                   x'07C0'
     d EPT_QODRECLM    c                   x'07C1'
     d EPT_QPTDSPFK    c                   x'07C2'
     d EPT_QPTCHKPC    c                   x'07C3'
     d EPT_QCMDCHK     c                   x'07C4'
     d EPT_QCMDEXC     c                   x'07C5'
     d EPT_QCANPARS    c                   x'07C6'
     d EPT_QCANPBLD    c                   x'07C7'
     d EPT_QSXQRYPB    c                   x'07C8'
     d EPT_QSXDSPD     c                   x'07C9'
     d EPT_QSXPRTD     c                   x'07CA'
     d EPT_QSXADDLS    c                   x'07CB'
     d EPT_QSXCRTAR    c                   x'07CC'
     d EPT_QSXWRKP     c                   x'07CD'
     d EPT_QSXWRKP1    c                   x'07CE'
     d EPT_QSXOPEN     c                   x'07CF'
     d EPT_QSXCRTPB    c                   x'07D0'
     d EPT_QSXUPDPB    c                   x'07D1'
     d EPT_QSXQRYAR    c                   x'07D2'
     d EPT_QSXCLNUP    c                   x'07D3'
     d EPT_QSXISOPB    c                   x'07D4'
     d EPT_QQQVWRCY    c                   x'07D5'
     d EPT_QDCAENL     c                   x'07D6'
     d EPT_QDCDSFL     c                   x'07D7'
     d EPT_QWSSNDSC    c                   x'07D8'
     d EPT_QSWSEMCP    c                   x'07D9'
     d EPT_QSWMCH      c                   x'07DA'
     d EPT_QP0FIASP    c                   x'07DB'
     d EPT_QOTATRCD    c                   x'07DC'
     d EPT_QOTASRCD    c                   x'07DD'
     d EPT_QOTATXTD    c                   x'07DE'
     d EPT_QUIOCNV     c                   x'07DF'
     d EPT_QLMEVTHD    c                   x'07E0'
     d EPT_QODGETA     c                   x'07E1'
     d EPT_QODPUTA     c                   x'07E2'
     d EPT_QODCPYCP    c                   x'07E3'
     d EPT_QODCRTCP    c                   x'07E4'
     d EPT_QODDLTCP    c                   x'07E5'
     d EPT_QODRNMCP    c                   x'07E6'
     d EPT_QODSAVDL    c                   x'07E7'
     d EPT_QODRSTDL    c                   x'07E8'
     d EPT_QODMISC2    c                   x'07E9'
     d EPT_QUIOPEN     c                   x'07EA'
     d EPT_QUICLOSE    c                   x'07EB'
     d EPT_QUICBINT    c                   x'07EC'
     d EPT_QUIEXFMT    c                   x'07ED'
     d EPT_QUIACT      c                   x'07EE'
     d EPT_QUIICHK     c                   x'07EF'
     d EPT_QUISCRL     c                   x'07F0'
     d EPT_QOTSCS      c                   x'07F1'
     d EPT_QOSRMDLE    c                   x'07F2'
     d EPT_QUIIEXIT    c                   x'07F3'
     d EPT_QUICMD      c                   x'07F4'
     d EPT_QUIALIST    c                   x'07F5'
     d EPT_QUILIST     c                   x'07F6'
     d EPT_QEXCLSS     c                   x'07F7'
     d EPT_QOSDIRCP    c                   x'07F8'
     d EPT_QOSDLCP     c                   x'07F9'
     d EPT_QOSINIT2    c                   x'07FA'
     d EPT_QOSADUSR    c                   x'07FB'
     d EPT_QOSCHUSR    c                   x'07FC'
     d EPT_QOSCRTDL    c                   x'07FD'
     d EPT_QOSDLTDL    c                   x'07FE'
     d EPT_QOSADDLE    c                   x'07FF'
     d EPT_QODSWRL     c                   x'0800'
     d EPT_QZDGATE     c                   x'0801'
     d EPT_QZDINGAT    c                   x'0802'
     d EPT_QZDSTGAT    c                   x'0803'
     d EPT_QYFIOCMP    c                   x'0804'
     d EPT_QYFCKLOC    c                   x'0805'
     d EPT_QUPIEXIT    c                   x'0806'
     d EPT_QUPDRVR     c                   x'0807'
     d EPT_QSCCPYB     c                   x'0808'
     d EPT_QSCCPY      c                   x'0809'
     d EPT_QSCCPYE     c                   x'080A'
     d EPT_QESCARP     c                   x'080B'
     d EPT_QDCWKFST    c                   x'080C'
     d EPT_QDCRTFST    c                   x'080D'
     d EPT_QPQCRPSF    c                   x'080E'
     d EPT_QAECHPOP    c                   x'080F'
     d EPT_QDCACDLD    c                   x'0810'
     d EPT_QDCACDLP    c                   x'0811'
     d EPT_QPQCHPSF    c                   x'0812'
     d EPT_QPQOVPSF    c                   x'0813'
     d EPT_QSWNDSUC    c                   x'0814'
     d EPT_QYFPUT      c                   x'0815'
     d EPT_QDCCPMD     c                   x'0816'
     d EPT_QSMHELP     c                   x'0817'
     d EPT_QSMDKTS     c                   x'0818'
     d EPT_QSMTAPS     c                   x'0819'
     d EPT_QSMIEXIT    c                   x'081A'
     d EPT_QYFPADPT    c                   x'081B'
     d EPT_QDCCHMD     c                   x'081C'
     d EPT_QDCDLMD     c                   x'081D'
     d EPT_QDCDSMD     c                   x'081E'
     d EPT_QLIRCOBJ    c                   x'081F'
     d EPT_QDCRSMD     c                   x'0820'
     d EPT_QDCCRSD     c                   x'0821'
     d EPT_QDCCKSD     c                   x'0822'
     d EPT_QDCCPSD     c                   x'0823'
     d EPT_QDCCHSD     c                   x'0824'
     d EPT_QDCDLSD     c                   x'0825'
     d EPT_QDCDSSD     c                   x'0826'
     d EPT_QLIREINS    c                   x'0827'
     d EPT_QDCRSSD     c                   x'0828'
     d EPT_QESRSPTF    c                   x'0829'
     d EPT_QESUPD      c                   x'082A'
     d EPT_QESPSR      c                   x'082B'
     d EPT_QESPTF      c                   x'082C'
     d EPT_QJORECLM    c                   x'082D'
     d EPT_QA1EVKEV    c                   x'082E'
     d EPT_QA1OPEN     c                   x'082F'
     d EPT_QA1CLOSE    c                   x'0830'
     d EPT_QA1PUT      c                   x'0831'
     d EPT_QA1GET      c                   x'0832'
     d EPT_QA1DTAEV    c                   x'0833'
     d EPT_QA1ERP      c                   x'0834'
     d EPT_QUPGENVR    c                   x'0835'
     d EPT_QP0LJNOP    c                   x'0836'
     d EPT_QSQSCHEM    c                   x'0837'
     d EPT_QSQSWAP     c                   x'0838'
     d EPT_QSQVFYTR    c                   x'0839'
     d EPT_QTOTNTAC    c                   x'083A'
     d EPT_QAECRTM     c                   x'083B'
     d EPT_QTOTNTAP    c                   x'083C'
     d EPT_QPMMNDCD    c                   x'083D'
     d EPT_QOPRS       c                   x'083E'
     d EPT_QTQBIFMT    c                   x'083F'
     d EPT_QDBTRGFR    c                   x'0840'
     d EPT_QWVIEXIT    c                   x'0841'
     d EPT_QYASP       c                   x'0842'
     d EPT_QYASPACT    c                   x'0843'
     d EPT_QPMBODBF    c                   x'0844'
     d EPT_QYASPMGT    c                   x'0845'
     d EPT_QPQROBJ     c                   x'0846'
     d EPT_QDBTRDEP    c                   x'0847'
     d EPT_QPMBDMPT    c                   x'0848'
     d EPT_QAECRTO     c                   x'0849'
     d EPT_QPQSBRSX    c                   x'084A'
     d EPT_QCICPYCP    c                   x'084B'
     d EPT_QCICPYEX    c                   x'084C'
     d EPT_QCICPYIO    c                   x'084D'
     d EPT_QCICPYIX    c                   x'084E'
     d EPT_QCIGETUL    c                   x'084F'
     d EPT_QCIMBRCP    c                   x'0850'
     d EPT_QCIMBREX    c                   x'0851'
     d EPT_QCIMBRIO    c                   x'0852'
     d EPT_QCIMBRIX    c                   x'0853'
     d EPT_QCICRTF     c                   x'0854'
     d EPT_QEXMKEY     c                   x'0855'
     d EPT_QOTLP       c                   x'0856'
     d EPT_QOTLF       c                   x'0857'
     d EPT_QOTLS       c                   x'0858'
     d EPT_QLICUSRL    c                   x'0859'
     d EPT_QDBSGXID    c                   x'085A'
     d EPT_QWCADSVR    c                   x'085B'
     d EPT_QWCIDIOR    c                   x'085C'
     d EPT_QOPSORT     c                   x'085D'
     d EPT_QPQSMDRX    c                   x'085E'
     d EPT_QDCDLNL     c                   x'085F'
     d EPT_QPYDUMPM    c                   x'0860'
     d EPT_QDCDSNLE    c                   x'0861'
     d EPT_QP0LCRWA    c                   x'0862'
     d EPT_QDCILFL     c                   x'0863'
     d EPT_QDCPSNL     c                   x'0864'
     d EPT_QSPCK4SP    c                   x'0865'
     d EPT_QDCWENLF    c                   x'0866'
     d EPT_QSPEXPSP    c                   x'0867'
     d EPT_QSPREGEX    c                   x'0868'
     d EPT_QSPSVLSP    c                   x'0869'
     d EPT_QSQARMM     c                   x'086A'
     d EPT_QTRCCMP     c                   x'086B'
     d EPT_QDBX_TRANS  c                   x'086D'
     d EPT_QSRCBALC    c                   x'086E'
     d EPT_QSRREQIO    c                   x'086F'
     d EPT_QSRPSTIO    c                   x'0870'
     d EPT_QSRRTVSF    c                   x'0871'
     d EPT_QSRRSDEQ    c                   x'0872'
     d EPT_QSRRSPST    c                   x'0873'
     d EPT_QSREVTHD    c                   x'0874'
     d EPT_QLIDSPLD    c                   x'0875'
     d EPT_QLIRTVLD    c                   x'0876'
     d EPT_QLIINT2     c                   x'0877'
     d EPT_QLISVLIB    c                   x'0878'
     d EPT_QSCMNWID    c                   x'0879'
     d EPT_QSCMCNNL    c                   x'087A'
     d EPT_QPQYEPPZ    c                   x'087B'
     d EPT_QPQYFDPZ    c                   x'087C'
     d EPT_QPQYINVZ    c                   x'087D'
     d EPT_QUCVRYON    c                   x'087E'
     d EPT_QUCVRYOF    c                   x'087F'
     d EPT_QPQYOCAZ    c                   x'0880'
     d EPT_QPQYPDPZ    c                   x'0881'
     d EPT_QPQYPOSZ    c                   x'0882'
     d EPT_QEZWRAST    c                   x'0883'
     d EPT_QOHFIXIX    c                   x'0884'
     d EPT_QOLELINK    c                   x'0885'
     d EPT_QOLDLINK    c                   x'0886'
     d EPT_QOLEVHLR    c                   x'0887'
     d EPT_QOLERP      c                   x'0888'
     d EPT_QOTIGRPH    c                   x'0889'
     d EPT_QOLSEND     c                   x'088A'
     d EPT_QOLRECV     c                   x'088B'
     d EPT_QOLSETF     c                   x'088C'
     d EPT_QOLQLIND    c                   x'088D'
     d EPT_QALWKALR    c                   x'088E'
     d EPT_QALDLTAL    c                   x'088F'
     d EPT_QALDSPDT    c                   x'0890'
     d EPT_QALALRAD    c                   x'0891'
     d EPT_QALSGNAL    c                   x'0892'
     d EPT_QALALREH    c                   x'0893'
     d EPT_QALSNDAL    c                   x'0894'
     d EPT_QTNDTCOB    c                   x'0895'
     d EPT_QJOIECHJ    c                   x'0896'
     d EPT_QBNADDBD    c                   x'0897'
     d EPT_QPDSERR     c                   x'0898'
     d EPT_QPDUMPER    c                   x'0899'
     d EPT_QALSYSEH    c                   x'089A'
     d EPT_QBNCRTBD    c                   x'089C'
     d EPT_QBNDSPBD    c                   x'089D'
     d EPT_QTEMMEMW    c                   x'089E'
     d EPT_QALCHGFP    c                   x'089F'
     d EPT_QWTMEDDA    c                   x'08A0'
     d EPT_QOLSENDM    c                   x'08A1'
     d EPT_QOLTRACE    c                   x'08A2'
     d EPT_QOLTIMER    c                   x'08A3'
     d EPT_QBNDSPMD    c                   x'08A4'
     d EPT_QBNILBD     c                   x'08A5'
     d EPT_QBNINSOB    c                   x'08A6'
     d EPT_QBNRMVBD    c                   x'08A8'
     d EPT_QBNVCABD    c                   x'08A9'
     d EPT_QBNWRKBE    c                   x'08AA'
     d EPT_QBNCHGMD    c                   x'08AB'
     d EPT_QBNRTVCM    c                   x'08AC'
     d EPT_QEZHNRPR    c                   x'08AD'
     d EPT_QEZXTLPR    c                   x'08AE'
     d EPT_QWCSSLJR    c                   x'08AF'
     d EPT_QLGCRTLO    c                   x'08B0'
     d EPT_QMHJLOGO    c                   x'08B1'
     d EPT_QQQVAP      c                   x'08B2'
     d EPT_QQQVFMT     c                   x'08B3'
     d EPT_QQQVSEL     c                   x'08B4'
     d EPT_QQQVJOIN    c                   x'08B5'
     d EPT_QGDDSQP     c                   x'08B6'
     d EPT_QGDDSPCS    c                   x'08B7'
     d EPT_QJORETRY    c                   x'08B8'
     d EPT_QJORNUSE    c                   x'08B9'
     d EPT_QJOSMART    c                   x'08BA'
     d EPT_QGDD3C      c                   x'08BB'
     d EPT_QSPBLNJE    c                   x'08BC'
     d EPT_QFPANOTE    c                   x'08BD'
     d EPT_QFPASTEE    c                   x'08BE'
     d EPT_QITDSMGR    c                   x'08BF'
     d EPT_QZDCRDCB    c                   x'08C0'
     d EPT_QDCRTID     c                   x'08C1'
     d EPT_QDCRSID     c                   x'08C2'
     d EPT_QDCRSNL     c                   x'08C3'
     d EPT_QLGDLTLO    c                   x'08C4'
     d EPT_QEZIXJOB    c                   x'08C5'
     d EPT_QEZOPJOB    c                   x'08C6'
     d EPT_QLGCRTIN    c                   x'08C7'
     d EPT_QUPOPTVR    c                   x'08C8'
     d EPT_QTOIPRIM    c                   x'08C9'
     d EPT_QRZROUTR    c                   x'08CA'
     d EPT_QRZRDHDW    c                   x'08CB'
     d EPT_QRZRDPTH    c                   x'08CC'
     d EPT_QQXCI       c                   x'08CD'
     d EPT_QMARETAN    c                   x'08CE'
     d EPT_QOEPOCRT    c                   x'08CF'
     d EPT_QOEPODSP    c                   x'08D0'
     d EPT_QOEPOEDT    c                   x'08D1'
     d EPT_QOEPOWRK    c                   x'08D2'
     d EPT_QOEPOPRT    c                   x'08D3'
     d EPT_QSQCLOSE    c                   x'08D4'
     d EPT_QRZIEXIT    c                   x'08D5'
     d EPT_QTVTRACE    c                   x'08D6'
     d EPT_QWTSCSSM    c                   x'08D7'
     d EPT_QOTKB       c                   x'08D8'
     d EPT_QOTKC       c                   x'08D9'
     d EPT_QOTKD       c                   x'08DA'
     d EPT_QOTKF       c                   x'08DB'
     d EPT_QOTKM       c                   x'08DC'
     d EPT_QWTPEETJ    c                   x'08DD'
     d EPT_QOTKS       c                   x'08DE'
     d EPT_QOTKT       c                   x'08DF'
     d EPT_QOTKU       c                   x'08E0'
     d EPT_QUPUPPR     c                   x'08E1'
     d EPT_QTSTCSDR    c                   x'08E2'
     d EPT_QTSTCHGD    c                   x'08E3'
     d EPT_QTSTCHGF    c                   x'08E4'
     d EPT_QTSTCPYF    c                   x'08E5'
     d EPT_QTSTLODS    c                   x'08E6'
     d EPT_QTSTIOS     c                   x'08E7'
     d EPT_QTSTWILD    c                   x'08E8'
     d EPT_QTSTQRYS    c                   x'08E9'
     d EPT_QTSSALFM    c                   x'08EA'
     d EPT_QOTIGRFI    c                   x'08EB'
     d EPT_QTSPUTDR    c                   x'08EC'
     d EPT_QOPGK       c                   x'08ED'
     d EPT_QSYDALO     c                   x'08EE'
     d EPT_QUHINFO     c                   x'08EF'
     d EPT_QCISBSIX    c                   x'08F0'
     d EPT_QCICNFIG    c                   x'08F1'
     d EPT_QCIPGMAT    c                   x'08F2'
     d*EPT_QLINEPTE    c                   x'08F3'
     d EPT_QOPADJ      c                   x'08F4'
     d EPT_QOPAI       c                   x'08F5'
     d EPT_QOPAL       c                   x'08F6'
     d EPT_QOPAT       c                   x'08F7'
     d EPT_QOPBL       c                   x'08F8'
     d EPT_QOPCA       c                   x'08F9'
     d EPT_QOPCHKFN    c                   x'08FA'
     d EPT_QOPCP       c                   x'08FB'
     d EPT_QOPDL       c                   x'08FC'
     d EPT_QOPDN       c                   x'08FD'
     d EPT_QOPED       c                   x'08FE'
     d EPT_QOPER       c                   x'08FF'
     d EPT_QOPEX       c                   x'0900'
     d EPT_QOPHB       c                   x'0901'
     d EPT_QOPFP       c                   x'0902'
     d EPT_QOPFR       c                   x'0903'
     d EPT_QOPFTGFT    c                   x'0904'
     d EPT_QOPFTGI     c                   x'0905'
     d EPT_QOPFTR      c                   x'0906'
     d EPT_QOPFTSP     c                   x'0907'
     d EPT_QOPGB       c                   x'0908'
     d EPT_QOPGE       c                   x'0909'
     d EPT_QOPGU       c                   x'090A'
     d EPT_QOPHF       c                   x'090B'
     d EPT_QOPHH       c                   x'090C'
     d EPT_QDCPTDLD    c                   x'090D'
     d EPT_QOPIF       c                   x'090E'
     d EPT_QOPIN       c                   x'090F'
     d EPT_QOPIT       c                   x'0910'
     d EPT_QOPLO       c                   x'0911'
     d EPT_QOPMD       c                   x'0912'
     d EPT_QOPLP       c                   x'0913'
     d EPT_QOPMG       c                   x'0914'
     d EPT_QOPMO       c                   x'0915'
     d EPT_QOPMP       c                   x'0916'
     d EPT_QOPMRGNM    c                   x'0917'
     d EPT_QOPNO       c                   x'0918'
     d EPT_QOTPCGET    c                   x'0919'
     d EPT_QOPOH       c                   x'091A'
     d EPT_QOPPC       c                   x'091B'
     d EPT_QOPPG       c                   x'091C'
     d EPT_QOPPL       c                   x'091D'
     d EPT_QOPPM       c                   x'091E'
     d EPT_QOPPO       c                   x'091F'
     d EPT_QOPPP       c                   x'0920'
     d EPT_QOPPQ       c                   x'0921'
     d EPT_QOPPR       c                   x'0922'
     d EPT_QOPPW       c                   x'0923'
     d EPT_QSZGTPRD    c                   x'0924'
     d EPT_QOPRE       c                   x'0925'
     d EPT_QOPRO       c                   x'0926'
     d EPT_QOPSF       c                   x'0927'
     d EPT_QOPSM       c                   x'0928'
     d EPT_QOPSN       c                   x'0929'
     d EPT_QOPSP       c                   x'092A'
     d EPT_QOPSQ       c                   x'092B'
     d EPT_QOPSW       c                   x'092C'
     d EPT_QOPTB       c                   x'092D'
     d EPT_QOPTC       c                   x'092E'
     d EPT_QOPTU       c                   x'092F'
     d EPT_QOPWS       c                   x'0930'
     d EPT_QOPXF       c                   x'0931'
     d EPT_QWTPMULK    c                   x'0932'
     d EPT_QOECMCRT    c                   x'0933'
     d EPT_QMNPASWD    c                   x'0934'
     d EPT_QMNSBS      c                   x'0935'
     d EPT_QMNUIM      c                   x'0936'
     d EPT_QOSICHGD    c                   x'0937'
     d EPT_QOTFD       c                   x'0938'
     d EPT_QOTOG       c                   x'0939'
     d EPT_QOTOI       c                   x'093A'
     d EPT_QDCCRDIN    c                   x'093B'
     d EPT_QDCCHDIN    c                   x'093C'
     d EPT_QOTOP       c                   x'093D'
     d EPT_QIFEXIT     c                   x'093E'
     d EPT_QUILXLST    c                   x'093F'
     d EPT_QOPIX       c                   x'0940'
     d EPT_QOPRUN      c                   x'0941'
     d EPT_QOSCHGSY    c                   x'0942'
     d EPT_QOSASYCP    c                   x'0943'
     d EPT_QOSSYEXT    c                   x'0944'
     d EPT_QOSDACP     c                   x'0945'
     d EPT_QOSDSPPR    c                   x'0946'
     d EPT_QYFPDERP    c                   x'0947'
     d EPT_QUHHELP     c                   x'0948'
     d EPT_QUHPRINT    c                   x'0949'
     d EPT_QUHFMT      c                   x'094A'
     d EPT_QODSWFL     c                   x'094B'
     d EPT_QODROOT     c                   x'094C'
     d EPT_QODRCL      c                   x'094D'
     d EPT_QQAKTEXT    c                   x'094E'
     d EPT_QODFSO      c                   x'094F'
     d EPT_QOSWRKCP    c                   x'0950'
     d EPT_QOSPCYDE    c                   x'0951'
     d EPT_QIDDCV      c                   x'0952'
     d EPT_QOSPCHGD    c                   x'0953'
     d EPT_QOSCALDD    c                   x'0954'
     d EPT_QOSPDSPD    c                   x'0955'
     d EPT_QOSPADDE    c                   x'0956'
     d EPT_QOSPSSYS    c                   x'0957'
     d EPT_QOSPSPRF    c                   x'0958'
     d EPT_QOSPDELD    c                   x'0959'
     d EPT_QOSPADID    c                   x'095A'
     d EPT_QOSPADND    c                   x'095B'
     d EPT_QMNSELCT    c                   x'095C'
     d EPT_QOSPWRKL    c                   x'095D'
     d EPT_QOSWLOPT    c                   x'095E'
     d EPT_QOSPCHGL    c                   x'095F'
     d EPT_QOSPLEDC    c                   x'0960'
     d EPT_QOSPCRTL    c                   x'0961'
     d EPT_QOSPADLE    c                   x'0962'
     d EPT_QOSPDELL    c                   x'0963'
     d EPT_QOSDSPCP    c                   x'0964'
     d EPT_QOSMLFMT    c                   x'0965'
     d EPT_QIDAFW      c                   x'0966'
     d EPT_QIDCDW      c                   x'0967'
     d EPT_QIDMODEL    c                   x'0968'
     d EPT_QIDEDW      c                   x'0969'
     d EPT_QIDOCW      c                   x'096A'
     d EPT_QIDRS1      c                   x'096B'
     d EPT_QIDSV1      c                   x'096C'
     d EPT_QIDS1W      c                   x'096D'
     d EPT_QIDS2W      c                   x'096E'
     d EPT_QIDS3W      c                   x'096F'
     d EPT_QIDWUW      c                   x'0970'
     d EPT_QIDXPW      c                   x'0971'
     d EPT_QIDTOW      c                   x'0972'
     d EPT_QOECMDSP    c                   x'0973'
     d EPT_QOECMEDT    c                   x'0974'
     d EPT_QOECMPRT    c                   x'0975'
     d EPT_QOERT       c                   x'0976'
     d EPT_QOEDE       c                   x'0977'
     d EPT_QOEEXIT     c                   x'0978'
     d EPT_QOEMD       c                   x'0979'
     d EPT_QOSMREM     c                   x'097A'
     d EPT_QOSPBCTL    c                   x'097B'
     d EPT_QOSRDIU     c                   x'097C'
     d EPT_QOSRDLS     c                   x'097D'
     d EPT_QOSISNVU    c                   x'097E'
     d EPT_QOSIRCVD    c                   x'097F'
     d EPT_QOSIQRYD    c                   x'0980'
     d EPT_QOSIFILD    c                   x'0981'
     d EPT_QOSISNDD    c                   x'0982'
     d EPT_QOSICNLD    c                   x'0983'
     d EPT_QOSIRPLD    c                   x'0984'
     d EPT_QOSIQDOC    c                   x'0985'
     d EPT_QOSIRTVD    c                   x'0986'
     d EPT_QOSIFSPC    c                   x'0987'
     d EPT_QCLCVTML    c                   x'0988'
     d EPT_QCLSTRNG    c                   x'0989'
     d EPT_QSPHNMLT    c                   x'098A'
     d EPT_QSPWRKF     c                   x'098B'
     d EPT_QWPIGRPH    c                   x'098C'
     d EPT_QMHRTVRQ    c                   x'098D'
     d EPT_QMNWRKXX    c                   x'098E'
     d EPT_QWCILE3R    c                   x'098F'
     d EPT_QSZPDOUP    c                   x'0990'
     d EPT_QSZIPL      c                   x'0991'
     d EPT_QEDLIST     c                   x'0992'
     d EPT_QEDMODES    c                   x'0993'
     d EPT_QEDMODTI    c                   x'0994'
     d EPT_QEDMODIA    c                   x'0995'
     d EPT_QEDUPDR     c                   x'0996'
     d EPT_QEDGETR     c                   x'0997'
     d EPT_QEDOPEN     c                   x'0998'
     d EPT_QEDCLNUP    c                   x'0999'
     d EPT_QEDCRTR     c                   x'099A'
     d EPT_QEDDLTR     c                   x'099B'
     d EPT_QEDLSTQA    c                   x'099C'
     d EPT_QEDMODQA    c                   x'099D'
     d EPT_QWCSUPLR    c                   x'099E'
     d EPT_QGDBCONV    c                   x'099F'
     d EPT_QGDBDRLB    c                   x'09A0'
     d EPT_QGDBEMSG    c                   x'09A1'
     d EPT_QGDBGINT    c                   x'09A2'
     d EPT_QGDBMBG     c                   x'09A3'
     d EPT_QGDBMISS    c                   x'09A4'
     d EPT_QGDBTRIG    c                   x'09A5'
     d EPT_QIDIN       c                   x'09A6'
     d EPT_QIDO1       c                   x'09A7'
     d EPT_QIDO2       c                   x'09A8'
     d EPT_QIDO3       c                   x'09A9'
     d EPT_QIDL1       c                   x'09AA'
     d EPT_QIDL2       c                   x'09AB'
     d EPT_QIDL3       c                   x'09AC'
     d EPT_QIDOD       c                   x'09AD'
     d EPT_QIDLS       c                   x'09AE'
     d EPT_QIDOF       c                   x'09AF'
     d EPT_QIDDESS     c                   x'09B0'
     d EPT_QQQITEMP    c                   x'09B1'
     d EPT_QQQVWCMP    c                   x'09B2'
     d EPT_QSYUPAUT    c                   x'09B3'
     d EPT_QSYCHPRF    c                   x'09B4'
     d EPT_QSYEXTSL    c                   x'09B5'
     d EPT_QSYMDSPC    c                   x'09B6'
     d EPT_QY1ITFML    c                   x'09B7'
     d EPT_QY1ITFAT    c                   x'09B8'
     d EPT_QY1ITF36    c                   x'09B9'
     d EPT_QDDDVEPX    c                   x'09BA'
     d EPT_QSPADDQE    c                   x'09BB'
     d EPT_QODQOPEN    c                   x'09BC'
     d EPT_QWPZAFP     c                   x'09BD'
     d EPT_QBNTGTRL    c                   x'09BE'
     d EPT_QTOCCRSI    c                   x'09BF'
     d EPT_QPZVLDRM    c                   x'09C0'
     d EPT_QWPIPDS     c                   x'09C1'
     d EPT_QOPL2       c                   x'09C2'
     d EPT_QRESXFND    c                   x'09C3'
     d EPT_QP0ANETD    c                   x'09C4'
     d EPT_QP0AINIT    c                   x'09C5'
     d EPT_QDCVCLAS    c                   x'09C6'
     d EPT_QDDFLSPX    c                   x'09C7'
     d EPT_QOLLSTEN    c                   x'09C8'
     d EPT_QDCVCLTR    c                   x'09C9'
     d EPT_QDCVCL25    c                   x'09CA'
     d EPT_QDCVCCAP    c                   x'09CB'
     d EPT_QDCVCCAS    c                   x'09CC'
     d EPT_QDCVCCBS    c                   x'09CD'
     d EPT_QDCVCCFN    c                   x'09CE'
     d EPT_QDCVCCHS    c                   x'09CF'
     d EPT_QSXRTVPD    c                   x'09D0'
     d EPT_QPZARDIR    c                   x'09D1'
     d EPT_QDCVCCRW    c                   x'09D2'
     d EPT_QWCILE4R    c                   x'09D3'
     d EPT_QA1SUSPD    c                   x'09D4'
     d EPT_QDCVCDLD    c                   x'09D5'
     d EPT_QDCVCDLP    c                   x'09D6'
     d EPT_QA1RST      c                   x'09D7'
     d EPT_QA1INASP    c                   x'09D8'
     d EPT_QSZOBJAT    c                   x'09D9'
     d EPT_QSZEON      c                   x'09DA'
     d EPT_QOEGP       c                   x'09DB'
     d EPT_QDCVCDAP    c                   x'09DC'
     d EPT_QEAMERGE    c                   x'09DD'
     d EPT_QSCTJIEX    c                   x'09DE'
     d EPT_QSYRVATL    c                   x'09DF'
     d EPT_QDCVCSD     c                   x'09E0'
     d EPT_QDCRSFL     c                   x'09E1'
     d EPT_QLCCRTLD    c                   x'09E2'
     d EPT_QUICCHGM    c                   x'09E3'
     d*EPT_QLINEPTE    c                   x'09E4'
     d EPT_QUICDSPM    c                   x'09E5'
     d EPT_QUICMENU    c                   x'09E6'
     d EPT_QUIMNDRV    c                   x'09E7'
     d EPT_QUIMSTK     c                   x'09E8'
     d EPT_QSYDSHLR    c                   x'09E9'
     d EPT_QSYCRHLR    c                   x'09EA'
     d EPT_QSYDLHLR    c                   x'09EB'
     d EPT_QSYCHGMP    c                   x'09EC'
     d EPT_QSYCHGSP    c                   x'09ED'
     d EPT_QALQRYAF    c                   x'09EE'
     d EPT_QALDSPRA    c                   x'09EF'
     d EPT_QALSUBSA    c                   x'09F0'
     d EPT_QALDSPHX    c                   x'09F1'
     d EPT_QALDTTXT    c                   x'09F2'
     d EPT_QALDTTIM    c                   x'09F3'
     d EPT_QALDTHRL    c                   x'09F4'
     d EPT_QALDTLAN    c                   x'09F5'
     d EPT_QIDCV       c                   x'09F6'
     d EPT_QIDA2       c                   x'09F7'
     d EPT_QIDA3       c                   x'09F8'
     d EPT_QIDYX       c                   x'09F9'
     d EPT_QIDVY       c                   x'09FA'
     d EPT_QIAEXIT     c                   x'09FB'
     d EPT_QDCACFEH    c                   x'09FC'
     d EPT_QCIRTVSA    c                   x'09FD'
     d EPT_QCIRTVPA    c                   x'09FE'
     d EPT_QEAADMIN    c                   x'09FF'
     d EPT_QCIPRCAT    c                   x'0A00'
     d EPT_QDXDDOER    c                   x'0A01'
     d EPT_QDXDDRA     c                   x'0A02'
     d EPT_QDXDINIT    c                   x'0A03'
     d EPT_QDXDJOB     c                   x'0A04'
     d EPT_QOHUPDDP    c                   x'0A05'
     d EPT_QTAEVMON    c                   x'0A06'
     d EPT_QIDMPW      c                   x'0A07'
     d EPT_QIDFVW      c                   x'0A08'
     d EPT_QIDVXW      c                   x'0A09'
     d EPT_QIDTDW      c                   x'0A0A'
     d EPT_QIDTUW      c                   x'0A0B'
     d EPT_QIDRNW      c                   x'0A0C'
     d EPT_QIDCD       c                   x'0A0D'
     d EPT_QIDDD       c                   x'0A0E'
     d EPT_QIDDT       c                   x'0A0F'
     d EPT_QIDD1       c                   x'0A10'
     d EPT_QIDC1       c                   x'0A11'
     d EPT_QDXDRTV     c                   x'0A12'
     d EPT_QEADRVR     c                   x'0A13'
     d EPT_QIDE1       c                   x'0A14'
     d EPT_QIDE2       c                   x'0A15'
     d EPT_QIDF1       c                   x'0A16'
     d EPT_QIDD2       c                   x'0A17'
     d EPT_QIDRI       c                   x'0A18'
     d EPT_QIDD3       c                   x'0A19'
     d EPT_QTVSTERM    c                   x'0A1A'
     d EPT_QEAIEXIT    c                   x'0A1B'
     d EPT_QIDXX       c                   x'0A1C'
     d EPT_QIDXD       c                   x'0A1D'
     d EPT_QIDOR       c                   x'0A1E'
     d EPT_QIDVW       c                   x'0A1F'
     d EPT_QIDVD       c                   x'0A20'
     d EPT_QIDOP       c                   x'0A21'
     d EPT_QIDCF       c                   x'0A22'
     d EPT_QIDLLIB     c                   x'0A23'
     d EPT_QDMAINIT    c                   x'0A24'
     d EPT_QICINASP    c                   x'0A25'
     d EPT_QOSHNAUT    c                   x'0A26'
     d EPT_QUTSFC01    c                   x'0A27'
     d EPT_QDXHINIT    c                   x'0A28'
     d EPT_QUIMIEXT    c                   x'0A29'
     d EPT_QQA0MAIN    c                   x'0A2A'
     d EPT_QQA2SRCH    c                   x'0A2B'
     d EPT_QQA2REVW    c                   x'0A2C'
     d EPT_QQA2ANSR    c                   x'0A2D'
     d EPT_QQA2SAVE    c                   x'0A2E'
     d EPT_QQA2DELT    c                   x'0A2F'
     d EPT_QQA2CHNG    c                   x'0A30'
     d EPT_QQAKOPEN    c                   x'0A31'
     d EPT_QQAKCLSE    c                   x'0A32'
     d EPT_QQAKQSR1    c                   x'0A33'
     d EPT_QQAKXX50    c                   x'0A34'
     d EPT_QQAK0X00    c                   x'0A35'
     d EPT_QQAK0500    c                   x'0A36'
     d EPT_QQAK0510    c                   x'0A37'
     d EPT_QQAK1000    c                   x'0A38'
     d EPT_QQAK1199    c                   x'0A39'
     d EPT_QQAK1299    c                   x'0A3A'
     d EPT_QQAKXX99    c                   x'0A3B'
     d EPT_QQAYSERV    c                   x'0A3C'
     d EPT_QQAYRQTR    c                   x'0A3D'
     d EPT_QDBDLTFS    c                   x'0A3E'
     d EPT_QWPPSUBR    c                   x'0A3F'
     d EPT_QDFANZR     c                   x'0A40'
     d EPT_QNFREPAK    c                   x'0A41'
     d EPT_QSQCRTT     c                   x'0A42'
     d EPT_QSQDROP     c                   x'0A43'
     d EPT_QSQLABEL    c                   x'0A44'
     d EPT_QSQVFIX     c                   x'0A45'
     d EPT_QSQVTCHG    c                   x'0A46'
     d EPT_QSQCRTI     c                   x'0A47'
     d EPT_QSQCRTV     c                   x'0A48'
     d EPT_QSQCRTDB    c                   x'0A49'
     d EPT_QPQXAFPRES  c                   x'0A4A'
     d EPT_QEZ1040C    c                   x'0A4B'
     d EPT_QP0FIPL3    c                   x'0A4C'
     d EPT_QP0LEXIT    c                   x'0A4D'
     d EPT_QSRRLVCP    c                   x'0A4E'
     d EPT_QSQCMT      c                   x'0A4F'
     d EPT_QSRROVCP    c                   x'0A50'
     d EPT_QTAMSGE     c                   x'0A51'
     d EPT_QSQBIND     c                   x'0A52'
     d EPT_QSQROUTE    c                   x'0A53'
     d EPT_QSQBLQDT    c                   x'0A54'
     d EPT_QSQXCUTE    c                   x'0A55'
     d EPT_QSQRPTAB    c                   x'0A56'
     d EPT_QSQRXLTR    c                   x'0A57'
     d EPT_QSQRAPLY    c                   x'0A58'
     d EPT_QSQRPARS    c                   x'0A59'
     d EPT_QSPSETWI    c                   x'0A5A'
     d EPT_QSQRLEX     c                   x'0A5B'
     d EPT_QSQRTBLS    c                   x'0A5C'
     d EPT_QSQRCHK     c                   x'0A5D'
     d EPT_QSQXXLTR    c                   x'0A5E'
     d EPT_QBNCRTMD    c                   x'0A5F'
     d EPT_QSQXCHK     c                   x'0A60'
     d EPT_QSQXPARS    c                   x'0A61'
     d EPT_QOSPWRKD    c                   x'0A62'
     d EPT_QOSADDTO    c                   x'0A63'
     d EPT_QOSTOPOS    c                   x'0A64'
     d EPT_QTSDIXIT    c                   x'0A65'
     d EPT_QWCSHUIC    c                   x'0A66'
     d EPT_QSQAUTH     c                   x'0A67'
     d EPT_QDXHRCV     c                   x'0A68'
     d EPT_QEXCLSG     c                   x'0A69'
     d EPT_QEXRTMS     c                   x'0A6A'
     d EPT_QIATIA      c                   x'0A6B'
     d EPT_QJODJAX     c                   x'0A6C'
     d EPT_QODRCLCP    c                   x'0A6D'
     d EPT_QODRCLVC    c                   x'0A6E'
     d EPT_QODCRTSP    c                   x'0A6F'
     d EPT_QODCPYVC    c                   x'0A70'
     d EPT_QODCRTVC    c                   x'0A71'
     d EPT_QODDLTVC    c                   x'0A72'
     d EPT_QODRNMVC    c                   x'0A73'
     d EPT_QDCCRLTD    c                   x'0A74'
     d EPT_QDCCHLTD    c                   x'0A75'
     d EPT_QSUUEXIT    c                   x'0A76'
     d EPT_QSUWHPCP    c                   x'0A77'
     d EPT_QQQGETTB    c                   x'0A78'
     d EPT_QODRNM      c                   x'0A79'
     d EPT_QOSLIBCK    c                   x'0A7A'
     d EPT_QLSADDTO    c                   x'0A7B'
     d EPT_QLSAPPNI    c                   x'0A7C'
     d EPT_QLSDIR      c                   x'0A7D'
     d EPT_QLSLOG      c                   x'0A7E'
     d EPT_QLSSSN      c                   x'0A7F'
     d EPT_QLSTDB      c                   x'0A80'
     d EPT_QQQTKZ      c                   x'0A81'
     d EPT_QQQTKZ38    c                   x'0A82'
     d EPT_QMNWRKX1    c                   x'0A83'
     d EPT_QMNWRKX2    c                   x'0A84'
     d EPT_QSYCPYUP    c                   x'0A85'
     d EPT_QMNWRKDS    c                   x'0A86'
     d EPT_QTBCCLST    c                   x'0A87'
     d EPT_QQQQFMSG    c                   x'0A88'
     d EPT_QWSRSTSC    c                   x'0A89'
     d EPT_QODCPPIX    c                   x'0A8A'
     d EPT_QUTMSGID    c                   x'0A8B'
     d EPT_QSYEDAUT    c                   x'0A8C'
     d EPT_QEXCPML     c                   x'0A8D'
     d EPT_QWTMMCJQ    c                   x'0A8E'
     d EPT_QDBXREF     c                   x'0A8F'
     d EPT_QDBXCLOS    c                   x'0A90'
     d EPT_QDBXFIXQ    c                   x'0A91'
     d EPT_QDBDICTR    c                   x'0A92'
     d EPT_QDBORDFS    c                   x'0A93'
     d EPT_QSQNAME     c                   x'0A94'
     d EPT_QSQXIT      c                   x'0A95'
     d EPT_QSQPLIST    c                   x'0A96'
     d EPT_QSQPSTAB    c                   x'0A97'
     d EPT_QSQRXTRT    c                   x'0A98'
     d EPT_QPTEXDEV    c                   x'0A99'
     d EPT_QT1LUDIN    c                   x'0A9A'
     d EPT_QT1LUDCT    c                   x'0A9B'
     d EPT_QT1AVAIL    c                   x'0A9C'
     d EPT_QT1ACFG     c                   x'0A9D'
     d EPT_QT1LUDRS    c                   x'0A9E'
     d EPT_QT1ERPLD    c                   x'0A9F'
     d EPT_QIDEM       c                   x'0AA0'
     d EPT_QIDE3       c                   x'0AA1'
     d EPT_QIDE4       c                   x'0AA2'
     d EPT_QIDKS       c                   x'0AA3'
     d EPT_QIDDESW     c                   x'0AA4'
     d EPT_QIDULW      c                   x'0AA5'
     d EPT_QIDTCW      c                   x'0AA6'
     d EPT_QIDXXW      c                   x'0AA7'
     d EPT_QIDRC       c                   x'0AA8'
     d EPT_QOEDW       c                   x'0AA9'
     d EPT_QOEDL       c                   x'0AAA'
     d EPT_QOEGO       c                   x'0AAB'
     d EPT_QOEHP       c                   x'0AAC'
     d EPT_QOEMN       c                   x'0AAD'
     d EPT_QOELD       c                   x'0AAE'
     d EPT_QOEPQ       c                   x'0AAF'
     d EPT_QOELL       c                   x'0AB0'
     d EPT_QOEDP       c                   x'0AB1'
     d EPT_QOERD       c                   x'0AB2'
     d EPT_QOERV       c                   x'0AB3'
     d EPT_QOEOL       c                   x'0AB4'
     d EPT_QOEOW       c                   x'0AB5'
     d EPT_QOECMWRK    c                   x'0AB6'
     d EPT_QOECMWKF    c                   x'0AB7'
     d EPT_QOECMDSF    c                   x'0AB8'
     d EPT_QOECMHLP    c                   x'0AB9'
     d EPT_QOECMPRQ    c                   x'0ABA'
     d EPT_QOEXITPQ    c                   x'0ABB'
     d EPT_QOEDCTCR    c                   x'0ABC'
     d EPT_QOEIEXIT    c                   x'0ABD'
     d EPT_QOEVLEDT    c                   x'0ABE'
     d EPT_QOEVLPRT    c                   x'0ABF'
     d EPT_QOEVLWRK    c                   x'0AC0'
     d EPT_QOEVLWKF    c                   x'0AC1'
     d EPT_QOEVLDSF    c                   x'0AC2'
     d EPT_QOEVLHLP    c                   x'0AC3'
     d EPT_QEXMRTW     c                   x'0AC4'
     d EPT_QOSDALO     c                   x'0AC5'
     d EPT_QOSVLCK1    c                   x'0AC6'
     d EPT_QOSADDSC    c                   x'0AC7'
     d EPT_QOSREASD    c                   x'0AC8'
     d EPT_QOSDIRF4    c                   x'0AC9'
     d EPT_QQAKASGN    c                   x'0ACA'
     d EPT_QODFIXDB    c                   x'0ACB'
     d EPT_QOSIAPIX    c                   x'0ACC'
     d EPT_QEDLANGL    c                   x'0ACD'
     d EPT_QTVUEHRT    c                   x'0ACE'
     d EPT_QDXHRTR     c                   x'0ACF'
     d EPT_QDXHSEND    c                   x'0AD0'
     d EPT_QDXHTERM    c                   x'0AD1'
     d EPT_QDXORCV     c                   x'0AD2'
     d EPT_QDXORCVX    c                   x'0AD3'
     d EPT_QDXPDSPQ    c                   x'0AD4'
     d EPT_QDXPRCV     c                   x'0AD5'
     d EPT_QDXPSEND    c                   x'0AD6'
     d EPT_QY2MSGX     c                   x'0AD7'
     d EPT_QDXXSTGM    c                   x'0AD8'
     d EPT_QDBTRGCM    c                   x'0AD9'
     d EPT_QWCIDSPR    c                   x'0ADA'
     d EPT_QSCMDICN    c                   x'0ADB'
     d EPT_QSCMMOD     c                   x'0ADC'
     d EPT_QSCMCOS     c                   x'0ADD'
     d EPT_QSCMAUTL    c                   x'0ADE'
     d EPT_QIZARNET    c                   x'0ADF'
     d EPT_QQAKDSCR    c                   x'0AE0'
     d EPT_QQA4PUB     c                   x'0AE1'
     d EPT_QDMDTAEV    c                   x'0AE2'
     d EPT_QDMACCIX    c                   x'0AE3'
     d EPT_QIDRCMH     c                   x'0AE4'
     d EPT_QIDYYW      c                   x'0AE5'
     d EPT_QIDYY       c                   x'0AE6'
     d EPT_QIDKA       c                   x'0AE7'
     d EPT_QIDAK       c                   x'0AE8'
     d EPT_QBNBIND     c                   x'0AE9'
     d EPT_QOEHPEX     c                   x'0AEA'
     d EPT_QEXDBLB     c                   x'0AEB'
     d EPT_QEXFPGM     c                   x'0AEC'
     d EPT_QEXRCLBS    c                   x'0AED'
     d EPT_QLGVLOC     c                   x'0AEE'
     d EPT_Q5BSTSVR    c                   x'0AEF'
     d EPT_QOHGETDP    c                   x'0AF0'
     d EPT_QOLCONIN    c                   x'0AF1'
     d EPT_QRCDMGNA    c                   x'0AF2'
     d EPT_QRCDMGNV    c                   x'0AF3'
     d EPT_QOERA       c                   x'0AF4'
     d EPT_QLSDSMOD    c                   x'0AF5'
     d EPT_QQUDA       c                   x'0AF6'
     d EPT_QQUDY       c                   x'0AF7'
     d EPT_QQUDT       c                   x'0AF8'
     d EPT_QQUPD       c                   x'0AF9'
     d EPT_QQURA       c                   x'0AFA'
     d EPT_QQURB       c                   x'0AFB'
     d EPT_QQURC       c                   x'0AFC'
     d EPT_QQURD       c                   x'0AFD'
     d EPT_QQURE       c                   x'0AFE'
     d EPT_QQURG       c                   x'0AFF'
     d EPT_QQURI       c                   x'0B00'
     d EPT_QQURJ       c                   x'0B01'
     d EPT_QQUTA       c                   x'0B02'
     d EPT_QQUTB       c                   x'0B03'
     d EPT_QQUTC       c                   x'0B04'
     d EPT_QQUTF       c                   x'0B05'
     d EPT_QQUTH       c                   x'0B06'
     d EPT_QTBXLATE    c                   x'0B07'
     d EPT_QUSRSTUQ    c                   x'0B08'
     d EPT_QFVAPVNA    c                   x'0B09'
     d EPT_QOHCHGA     c                   x'0B0A'
     d EPT_QDBRCIPO    c                   x'0B0B'
     d EPT_QJOJMNUX    c                   x'0B0C'
     d EPT_QRZGETRH    c                   x'0B0D'
     d EPT_QDXPSNIX    c                   x'0B0E'
     d EPT_QDXDEVNT    c                   x'0B0F'
     d EPT_QMHLSTEX    c                   x'0B10'
     d EPT_QMHPTMSD    c                   x'0B11'
     d EPT_QSYRCHLR    c                   x'0B12'
     d EPT_QSYRCATL    c                   x'0B13'
     d*EPT_QLINEPTE    c                   x'0B14'
     d EPT_QFSPCINT    c                   x'0B15'
     d EPT_QFSPCFLE    c                   x'0B16'
     d EPT_QFSCPVHM    c                   x'0B17'
     d EPT_QSQXPGM     c                   x'0B18'
     d EPT_QFSCPVH     c                   x'0B19'
     d EPT_QFSCPHV     c                   x'0B1A'
     d EPT_QFSCPYM     c                   x'0B1B'
     d EPT_QFSUPDWN    c                   x'0B1C'
     d EPT_QFSUPD      c                   x'0B1D'
     d EPT_QFSDWN      c                   x'0B1E'
     d EPT_QFSUFH      c                   x'0B1F'
     d EPT_QFSMAIN     c                   x'0B20'
     d EPT_QFSC7TO8    c                   x'0B21'
     d EPT_QFSC8TO7    c                   x'0B22'
     d EPT_QOLTMREH    c                   x'0B23'
     d EPT_QDBFSTCD    c                   x'0B24'
     d EPT_QDCCHLD     c                   x'0B25'
     d EPT_QSYGRHLR    c                   x'0B26'
     d EPT_QWPMODCA    c                   x'0B27'
     d EPT_QMNHCMD     c                   x'0B28'
     d EPT_QOKCHKOR    c                   x'0B29'
     d EPT_QCJQNCIR    c                   x'0B2A'
     d EPT_QOHRTVA     c                   x'0B2B'
     d EPT_QLNTEST     c                   x'0B2C'
     d EPT_QALWKPRB    c                   x'0B2D'
     d EPT_QALWKALV    c                   x'0B2E'
     d EPT_QQUMITXT    c                   x'0B2F'
     d EPT_QOFRSTCP    c                   x'0B30'
     d EPT_QOFRSTVC    c                   x'0B31'
     d EPT_QOFRSTIX    c                   x'0B32'
     d EPT_QOFDWXFM    c                   x'0B33'
     d EPT_QOFFMS      c                   x'0B34'
     d EPT_QOFIDP      c                   x'0B35'
     d EPT_QDBRNMLA    c                   x'0B36'
     d EPT_QDBRNMLB    c                   x'0B37'
     d EPT_QWCICLTR    c                   x'0B38'
     d EPT_QSITPP      c                   x'0B39'
     d EPT_QIDSTRID    c                   x'0B3A'
     d EPT_QDBSERVE    c                   x'0B3B'
     d EPT_QEZWRWTR    c                   x'0B3C'
     d EPT_QWCINIPP    c                   x'0B3D'
     d EPT_QCJQROUT    c                   x'0B3E'
     d EPT_QWCSDSMR    c                   x'0B3F'
     d EPT_QODADIR     c                   x'0B40'
     d EPT_QODAINIT    c                   x'0B41'
     d EPT_QODALOCK    c                   x'0B42'
     d EPT_QODAMAIN    c                   x'0B43'
     d EPT_QODAMCDR    c                   x'0B44'
     d EPT_QODATERM    c                   x'0B45'
     d EPT_QOCXLTB     c                   x'0B46'
     d EPT_QQXCLVSP    c                   x'0B47'
     d EPT_QHFDMCLN    c                   x'0B48'
     d EPT_QEZIXPWS    c                   x'0B49'
     d EPT_QEZLXPWS    c                   x'0B4A'
     d EPT_QEZCRIDX    c                   x'0B4B'
     d EPT_QEZIXCLU    c                   x'0B4C'
     d EPT_QEZCNPWR    c                   x'0B4D'
     d EPT_QEZATNWD    c                   x'0B4E'
     d EPT_QEZGRPGM    c                   x'0B4F'
     d EPT_QEZMAIN     c                   x'0B50'
     d EPT_QRCVDTAQ    c                   x'0B51'
     d EPT_QSNDDTAQ    c                   x'0B52'
     d EPT_QCLRDTAQ    c                   x'0B53'
     d EPT_QCJASFVR    c                   x'0B54'
     d EPT_QMHQCRTQ    c                   x'0B55'
     d EPT_QMHQDLTQ    c                   x'0B56'
     d EPT_QMHQREGQ    c                   x'0B57'
     d EPT_QMHQDRGQ    c                   x'0B58'
     d EPT_QMHQRSTQ    c                   x'0B59'
     d EPT_QMHQSAVQ    c                   x'0B5A'
     d EPT_QJOCJOVR    c                   x'0B5B'
     d EPT_QIDWW       c                   x'0B5C'
     d EPT_QIDWWW      c                   x'0B5D'
     d EPT_QIDZZ       c                   x'0B5E'
     d EPT_QIDZZW      c                   x'0B5F'
     d EPT_QDCRNFD     c                   x'0B60'
     d EPT_QDCRNFRC    c                   x'0B61'
     d EPT_QNXERROR    c                   x'0B62'
     d EPT_QSYRMAIP    c                   x'0B63'
     d EPT_QCJBABRT    c                   x'0B64'
     d EPT_QCJBCLOS    c                   x'0B65'
     d EPT_QCJBOPEN    c                   x'0B66'
     d EPT_QTVUTERM    c                   x'0B67'
     d EPT_QSWNWEV     c                   x'0B68'
     d EPT_Q5BENSVR    c                   x'0B69'
     d EPT_QPIPCCNV    c                   x'0B6A'
     d EPT_QESIEXT     c                   x'0B6B'
     d EPT_QAECVTPG    c                   x'0B6C'
     d EPT_QP0WINIT    c                   x'0B6D'
     d EPT_QCLSCAN     c                   x'0B6E'
     d EPT_QCACHECK    c                   x'0B6F'
     d EPT_QDBCHKLK    c                   x'0B70'
     d EPT_QPQMPSF     c                   x'0B71'
     d EPT_QSQTRG      c                   x'0B72'
     d EPT_QOECHECK    c                   x'0B73'
     d EPT_QUIMNPOP    c                   x'0B74'
     d*EPT_QLINEPTE    c                   x'0B75'
     d EPT_QDBCMPOP    c                   x'0B76'
     d EPT_QGDBBGCI    c                   x'0B77'
     d EPT_QY2FILEX    c                   x'0B78'
     d EPT_QSRDUPER    c                   x'0B7A'
     d EPT_QOESU       c                   x'0B7B'
     d*EPT_QLINEPTE    c                   x'0B7C'
     d EPT_QLIPGM01    c                   x'0B7D'
     d EPT_QLIPGM02    c                   x'0B7E'
     d EPT_QLIPGM03    c                   x'0B7F'
     d EPT_QLIPGM04    c                   x'0B80'
     d EPT_QLIPGM05    c                   x'0B81'
     d EPT_QLIPGM06    c                   x'0B82'
     d EPT_QLIPGM07    c                   x'0B83'
     d EPT_QLIPGM08    c                   x'0B84'
     d EPT_QLIPGM09    c                   x'0B85'
     d EPT_QLIPGM10    c                   x'0B86'
     d EPT_QCJBWRIT    c                   x'0B87'
     d EPT_QCJCAUTH    c                   x'0B88'
     d EPT_QCJPCLOS    c                   x'0B89'
     d EPT_QCJPEMPT    c                   x'0B8A'
     d EPT_QCJPOPEN    c                   x'0B8B'
     d EPT_QCJPREAD    c                   x'0B8C'
     d EPT_QCJPSEEK    c                   x'0B8D'
     d EPT_QCJPWRIT    c                   x'0B8E'
     d EPT_QOKRTVOR    c                   x'0B8F'
     d EPT_QUTSFR01    c                   x'0B90'
     d EPT_QUTSFR02    c                   x'0B91'
     d EPT_QQAYIEXT    c                   x'0B92'
     d EPT_QODMISC1    c                   x'0B93'
     d EPT_QZDCHGST    c                   x'0B94'
     d EPT_QWTAEVRY    c                   x'0B95'
     d EPT_QP0WTERM    c                   x'0B96'
     d EPT_QCIOBCHK    c                   x'0B97'
     d EPT_QWCCDSDC    c                   x'0B98'
     d EPT_QAEDBIO     c                   x'0B99'
     d EPT_QRZDEXIT    c                   x'0B9A'
     d EPT_QRZDCMN     c                   x'0B9B'
     d EPT_QPQSFC      c                   x'0B9C'
     d EPT_QRZDHRRT    c                   x'0B9D'
     d EPT_QRZDLWS     c                   x'0B9E'
     d EPT_QRZDPRC     c                   x'0B9F'
     d EPT_QPQXSPG     c                   x'0BA0'
     d EPT_QAEDSPO     c                   x'0BA1'
     d EPT_QSYRAUTL    c                   x'0BA2'
     d EPT_QAEDSPRT    c                   x'0BA3'
     d EPT_QAEDYNAT    c                   x'0BA4'
     d EPT_QAEFMSRV    c                   x'0BA5'
     d EPT_QAEINIT     c                   x'0BA6'
     d EPT_QAEINST     c                   x'0BA7'
     d EPT_QAEROUTE    c                   x'0BA8'
     d EPT_QAESTUB     c                   x'0BA9'
     d EPT_QAESQLIO    c                   x'0BAA'
     d EPT_QZMFXDIR    c                   x'0BAB'
     d EPT_QSRDSOPT    c                   x'0BAC'
     d EPT_QQQDBLOG    c                   x'0BAD'
     d EPT_QMAVERFY    c                   x'0BAE'
     d EPT_QOQINIT     c                   x'0BAF'
     d EPT_QFPHGFAT    c                   x'0BB0'
     d EPT_QMOVINIT    c                   x'0BB1'
     d EPT_QNMAPING    c                   x'0BB2'
     d EPT_QOQTERM     c                   x'0BB3'
     d EPT_QNMRCPP1    c                   x'0BB4'
     d EPT_QNMAPINGD   c                   x'0BB5'
     d EPT_QNMAREXECD  c                   x'0BB6'
     d EPT_QTQIXTND    c                   x'0BB7'
     d EPT_QCDCHKST    c                   x'0BB8'
     d EPT_QUSFXREG    c                   x'0BB9'
     d EPT_QVOICCLG    c                   x'0BBA'
     d EPT_QP0WKMRT    c                   x'0BBB'
     d EPT_QRZDSTG     c                   x'0BBC'
     d EPT_QOCCCHRD    c                   x'0BBD'
     d EPT_QLGPMCHC    c                   x'0BBE'
     d EPT_QDBSECOF    c                   x'0BBF'
     d EPT_QPQPDMGR    c                   x'0BC0'
     d EPT_QPQPEXIT    c                   x'0BC1'
     d EPT_QPQRMGR     c                   x'0BC2'
     d EPT_QPQCCOMM    c                   x'0BC3'
     d EPT_QPQCPINT    c                   x'0BC4'
     d EPT_QPQCICF     c                   x'0BC5'
     d EPT_QPQCARTC    c                   x'0BC6'
     d EPT_QPQCNACK    c                   x'0BC7'
     d EPT_QPKPSFPT    c                   x'0BC8'
     d EPT_QOQSESRV    c                   x'0BC9'
     d EPT_QOQCTL      c                   x'0BCA'
     d EPT_QOQPRAS2    c                   x'0BCB'
     d EPT_QRZLAN      c                   x'0BCC'
     d EPT_QOQGETAU    c                   x'0BCD'
     d EPT_QIDED       c                   x'0BCE'
     d EPT_QOHUPDEL    c                   x'0BCF'
     d EPT_QIDK1       c                   x'0BD0'
     d EPT_QIDK3       c                   x'0BD1'
     d EPT_QOSMODF2    c                   x'0BD2'
     d EPT_QOSPRSMD    c                   x'0BD3'
     d EPT_QOSMAINT    c                   x'0BD4'
     d EPT_QOSFILE2    c                   x'0BD5'
     d EPT_QOSRETV2    c                   x'0BD6'
     d EPT_QOSCTDDD    c                   x'0BD7'
     d EPT_QOSSRLDD    c                   x'0BD8'
     d EPT_QOSSRCH2    c                   x'0BD9'
     d EPT_QOSCVTSC    c                   x'0BDA'
     d EPT_QOSCOPY     c                   x'0BDB'
     d EPT_QOSADD      c                   x'0BDC'
     d EPT_QOSMOVE     c                   x'0BDD'
     d EPT_QOSREMOV    c                   x'0BDE'
     d EPT_QWPIPTRN    c                   x'0BDF'
     d EPT_QWTMEINA    c                   x'0BE0'
     d EPT_QWTMMFJB    c                   x'0BE1'
     d EPT_QOPMCV      c                   x'0BE2'
     d EPT_QFSCRTV     c                   x'0BE3'
     d EPT_QOHUPRCV    c                   x'0BE4'
     d EPT_QWTMMPJR    c                   x'0BE5'
     d EPT_QWTMEPJP    c                   x'0BE6'
     d EPT_QWTMMPJE    c                   x'0BE7'
     d EPT_QWTMCPPJ    c                   x'0BE8'
     d EPT_QOHSTSL     c                   x'0BE9'
     d EPT_QOHLSTIB    c                   x'0BEA'
     d EPT_QOHACK      c                   x'0BEB'
     d EPT_QOHACKRY    c                   x'0BEC'
     d EPT_QOHMAILP    c                   x'0BED'
     d EPT_QOHMLPRT    c                   x'0BEE'
     d EPT_QOHPRTCM    c                   x'0BEF'
     d EPT_QOHICHGD    c                   x'0BF0'
     d EPT_QOHFILDV    c                   x'0BF1'
     d EPT_QOHFDRCV    c                   x'0BF2'
     d EPT_QOHMLRCV    c                   x'0BF3'
     d EPT_QSPPSFWT    c                   x'0BF4'
     d EPT_QVOICHGE    c                   x'0BF5'
     d EPT_QJOUNJRN    c                   x'0BF6'
     d EPT_QUSSAVUQ    c                   x'0BF7'
     d EPT_QUIPRINT    c                   x'0BF8'
     d EPT_QWTCCSPJ    c                   x'0BF9'
     d EPT_QWTCCEPJ    c                   x'0BFA'
     d EPT_QWTMMSEP    c                   x'0BFB'
     d EPT_QWTSCPJR    c                   x'0BFC'
     d EPT_QDBCHEOD    c                   x'0BFD'
     d EPT_QQQTSORT    c                   x'0BFE'
     d EPT_QTAUSREX    c                   x'0BFF'
     d EPT_QWTCCDPJ    c                   x'0C00'
     d EPT_QPQPDGRP    c                   x'0C01'
     d EPT_QRUCRTAT    c                   x'0C02'
     d EPT_QRUCHGAT    c                   x'0C03'
     d EPT_QRUGETDS    c                   x'0C04'
     d EPT_QRUDLTDS    c                   x'0C05'
     d*EPT_QLINEPTE    c                   x'0C06'
     d*EPT_QLINEPTE    c                   x'0C07'
     d EPT_QWTMMRST    c                   x'0C08'
     d EPT_QWTMCCPJ    c                   x'0C09'
     d EPT_QMHVFYLT    c                   x'0C0A'
     d EPT_QDCRTFSR    c                   x'0C0B'
     d EPT_QFSSTRMA    c                   x'0C0C'
     d EPT_QDFSAVPV    c                   x'0C0D'
     d EPT_QONACFG     c                   x'0C0E'
     d EPT_QONVRYON    c                   x'0C0F'
     d EPT_QONVRYSA    c                   x'0C10'
     d EPT_QALWALRD    c                   x'0C11'
     d EPT_QRZDSTG2    c                   x'0C12'
     d EPT_QRZDTRA     c                   x'0C13'
     d EPT_QALWADDT    c                   x'0C14'
     d EPT_QALWADDA    c                   x'0C15'
     d EPT_QALWADPR    c                   x'0C16'
     d EPT_QALWADEX    c                   x'0C17'
     d EPT_QALRALRD    c                   x'0C18'
     d EPT_QALCALRD    c                   x'0C19'
     d EPT_QALAALRD    c                   x'0C1A'
     d EPT_QALGADSC    c                   x'0C1B'
     d EPT_QALGDTLQ    c                   x'0C1C'
     d EPT_QODCHKCP    c                   x'0C1D'
     d EPT_QODCHKVC    c                   x'0C1E'
     d EPT_QODCPYTX    c                   x'0C1F'
     d EPT_QOCCHPOP    c                   x'0C20'
     d EPT_QOCCWKRD    c                   x'0C21'
     d EPT_QOJRSTML    c                   x'0C22'
     d EPT_QCJQHATM    c                   x'0C23'
     d EPT_QACDEVSL    c                   x'0C24'
     d EPT_QQXRPTLE    c                   x'0C25'
     d EPT_QOCCWKRU    c                   x'0C26'
     d EPT_QRZPTRA     c                   x'0C27'
     d EPT_QPZLLGET    c                   x'0C28'
     d EPT_QQQACTIV    c                   x'0C2A'
     d EPT_QWPMOTRN    c                   x'0C2B'
     d EPT_QMHFLDMQ    c                   x'0C2C'
     d EPT_QRFCLOSE    c                   x'0C2D'
     d EPT_QAPDSMOD    c                   x'0C2E'
     d EPT_QRFERP      c                   x'0C2F'
     d EPT_QRFGET      c                   x'0C30'
     d EPT_QRFIOCMP    c                   x'0C31'
     d EPT_QRFOPEN     c                   x'0C32'
     d EPT_QRFPSR      c                   x'0C33'
     d EPT_QRFPSRDT    c                   x'0C34'
     d EPT_QRFPSREH    c                   x'0C35'
     d EPT_QRFPUT      c                   x'0C36'
     d EPT_QRFRST      c                   x'0C37'
     d EPT_QRFSUSPD    c                   x'0C38'
     d EPT_QRFVRYON    c                   x'0C39'
     d EPT_QA1DEVSL    c                   x'0C3A'
     d EPT_QWCRTVPT    c                   x'0C3B'
     d EPT_QDCPRVEP    c                   x'0C3C'
     d EPT_QIDXDDW     c                   x'0C3D'
     d EPT_QIDEXTW     c                   x'0C3E'
     d EPT_QSYSGNON    c                   x'0C3F'
     d EPT_QCDRNNM1    c                   x'0C40'
     d EPT_QDCCRCRL    c                   x'0C41'
     d EPT_QDCCHCRL    c                   x'0C42'
     d EPT_QDCCKCRL    c                   x'0C43'
     d EPT_QDCCRDRL    c                   x'0C44'
     d EPT_QDCCHDRL    c                   x'0C45'
     d*EPT_QLINEPTE    c                   x'0C46'
     d EPT_QOSUCHK1    c                   x'0C47'
     d EPT_QOSUCHK2    c                   x'0C48'
     d EPT_QOSUADDT    c                   x'0C49'
     d EPT_QOSUPOST    c                   x'0C4A'
     d EPT_QQXCKNAM    c                   x'0C4B'
     d EPT_QDXRLSPH    c                   x'0C4C'
     d EPT_QZDEBIN     c                   x'0C4D'
     d EPT_QZDEBOUT    c                   x'0C4E'
     d EPT_QOCNFYMG    c                   x'0C4F'
     d EPT_QOEB01      c                   x'0C50'
     d EPT_QQXDSTSP    c                   x'0C51'
     d EPT_QSYPWDCR    c                   x'0C52'
     d EPT_QSADEVSL    c                   x'0C53'
     d EPT_QSPWKSTS    c                   x'0C54'
     d EPT_QSPHNSTS    c                   x'0C55'
     d EPT_QMNCGPWD    c                   x'0C56'
     d EPT_QLIMODRM    c                   x'0C57'
     d EPT_QCLDESS     c                   x'0C58'
     d EPT_QOEDD       c                   x'0C59'
     d EPT_QOEGD       c                   x'0C5A'
     d EPT_QRZLANLI    c                   x'0C5B'
     d EPT_QSPPSFEX    c                   x'0C5C'
     d EPT_QRFPTHRU    c                   x'0C5D'
     d EPT_QSRIPLXT    c                   x'0C5E'
     d EPT_QWTCCDSC    c                   x'0C5F'
     d EPT_QWTMMDSC    c                   x'0C60'
     d EPT_QWTSEDTO    c                   x'0C61'
     d EPT_QEADELET    c                   x'0C62'
     d EPT_QDCCRDNT    c                   x'0C63'
     d EPT_QDCCHDNT    c                   x'0C64'
     d EPT_QDCCRCNT    c                   x'0C65'
     d EPT_QDCCHCNT    c                   x'0C66'
     d EPT_QODCVTCR    c                   x'0C67'
     d EPT_QPRRNNM1    c                   x'0C68'
     d EPT_QSQRNNM1    c                   x'0C69'
     d EPT_QWTSCWSE    c                   x'0C6A'
     d EPT_QTEIRTVD    c                   x'0C6B'
     d EPT_QRZTRA      c                   x'0C6C'
     d EPT_QSXWRKT1    c                   x'0C6D'
     d EPT_QOEB02      c                   x'0C6E'
     d EPT_QOEB03      c                   x'0C6F'
     d EPT_QOEB04      c                   x'0C70'
     d EPT_QOEB05      c                   x'0C71'
     d EPT_QOEB06      c                   x'0C72'
     d EPT_QOEB07      c                   x'0C73'
     d EPT_QOEB08      c                   x'0C74'
     d EPT_QOEB09      c                   x'0C75'
     d EPT_QOEB10      c                   x'0C76'
     d EPT_QOEB11      c                   x'0C77'
     d EPT_QOEB12      c                   x'0C78'
     d EPT_QOEB13      c                   x'0C79'
     d EPT_QOEB14      c                   x'0C7A'
     d EPT_QOEB15      c                   x'0C7B'
     d EPT_QOEB16      c                   x'0C7C'
     d EPT_QLPIVPD     c                   x'0C7D'
     d EPT_QMHSNUSR    c                   x'0C7E'
     d EPT_QOCCWKRR    c                   x'0C7F'
     d EPT_QOCCWKRC    c                   x'0C80'
     d EPT_QOCCWKRP    c                   x'0C81'
     d EPT_QOCPTABL    c                   x'0C82'
     d EPT_QEZWRDEV    c                   x'0C83'
     d EPT_QODRGZCP    c                   x'0C84'
     d EPT_QNFCNJOP    c                   x'0C85'
     d EPT_QEZPRDEV    c                   x'0C86'
     d EPT_QEZOPDEV    c                   x'0C87'
     d EPT_QOCVFYTM    c                   x'0C88'
     d EPT_QEZSAVIN    c                   x'0C89'
     d EPT_QMHQRDQD    c                   x'0C8A'
     d EPT_QNFIEXIT    c                   x'0C8B'
     d EPT_QOKCNFRM    c                   x'0C8C'
     d EPT_QOKPDSOR    c                   x'0C8D'
     d EPT_QRZLIST     c                   x'0C8E'
     d EPT_QOCXNODE    c                   x'0C8F'
     d EPT_QOCCPP      c                   x'0C90'
     d EPT_QRZSTG2     c                   x'0C91'
     d EPT_QOKPADOR    c                   x'0C92'
     d EPT_QUCRTDAE    c                   x'0C93'
     d EPT_QRZLWS2     c                   x'0C94'
     d EPT_QZSPCCOP    c                   x'0C95'
     d EPT_QZSPPMT     c                   x'0C96'
     d EPT_QRZLPRES    c                   x'0C97'
     d EPT_QRZDCLST    c                   x'0C98'
     d EPT_QRZDCSTG    c                   x'0C99'
     d EPT_QRZDCCMN    c                   x'0C9A'
     d EPT_QRZWHRRT    c                   x'0C9B'
     d EPT_QODRGZVC    c                   x'0C9C'
     d EPT_QQXSQLEX    c                   x'0C9D'
     d EPT_QQXMAINX    c                   x'0C9E'
     d EPT_QQXDSPRX    c                   x'0C9F'
     d EPT_QQXOBJPX    c                   x'0CA0'
     d EPT_QUREZR40    c                   x'0CA1'
     d EPT_QQXFRMPX    c                   x'0CA2'
     d EPT_QZPDOCE1    c                   x'0CA3'
     d EPT_QQXMKPSP    c                   x'0CA4'
     d EPT_QQXMKTSP    c                   x'0CA5'
     d EPT_QZPPTFDI    c                   x'0CA6'
     d EPT_QZPIEXIT    c                   x'0CA7'
     d EPT_QOCPTABB    c                   x'0CA8'
     d EPT_QEZBCKUP    c                   x'0CA9'
     d EPT_QEZBKADL    c                   x'0CAA'
     d EPT_QEZBKSLT    c                   x'0CAB'
     d EPT_QEZCHBL     c                   x'0CAC'
     d EPT_QEZCHBL2    c                   x'0CAD'
     d EPT_QEZCRBKL    c                   x'0CAE'
     d EPT_QEZINIT     c                   x'0CAF'
     d EPT_QEZRVLIB    c                   x'0CB0'
     d EPT_QSRSAVO     c                   x'0CB1'
     d EPT_QDCVCCRL    c                   x'0CB2'
     d EPT_QCIMRTX     c                   x'0CB3'
     d EPT_QOKPNADD    c                   x'0CB4'
     d EPT_QOKPNCHG    c                   x'0CB5'
     d EPT_QOKPNWRK    c                   x'0CB6'
     d EPT_QOKNNDTL    c                   x'0CB7'
     d EPT_QOKCALND    c                   x'0CB8'
     d EPT_QEDCHGCI    c                   x'0CB9'
     d EPT_QEDINEXT    c                   x'0CBA'
     d EPT_QOCINIT     c                   x'0CBB'
     d EPT_QOCEXIT     c                   x'0CBC'
     d EPT_QOCPCAL     c                   x'0CBD'
     d EPT_QOCPGRP     c                   x'0CBE'
     d EPT_QOCPNTC     c                   x'0CBF'
     d EPT_QOCCRITM    c                   x'0CC0'
     d EPT_QOCGTITM    c                   x'0CC1'
     d EPT_QOCCHITM    c                   x'0CC2'
     d EPT_QOCDLITM    c                   x'0CC3'
     d EPT_QOCCDPRD    c                   x'0CC4'
     d EPT_QOCCADRD    c                   x'0CC5'
     d EPT_QCICPYRA    c                   x'0CC6'
     d EPT_QWHRMCHK    c                   x'0CC7'
     d EPT_QQXCLVSQ    c                   x'0CC8'
     d EPT_QSQICOLL    c                   x'0CC9'
     d EPT_QSQIDBL     c                   x'0CCA'
     d EPT_QSQITABL    c                   x'0CCB'
     d EPT_QSQIPRPT    c                   x'0CCC'
     d EPT_QSQIEDIT    c                   x'0CCD'
     d EPT_QSQIFMT     c                   x'0CCE'
     d EPT_QSQILVL1    c                   x'0CCF'
     d EPT_QSQILVL2    c                   x'0CD0'
     d EPT_QSQILVL3    c                   x'0CD1'
     d EPT_QSQISHOW    c                   x'0CD2'
     d EPT_QOCCRMRD    c                   x'0CD3'
     d EPT_QJOIEJRN    c                   x'0CD4'
     d EPT_QJORYXRF    c                   x'0CD5'
     d EPT_QJOVLCMP    c                   x'0CD6'
     d EPT_QRZLOUTF    c                   x'0CD7'
     d EPT_QJOVLRTV    c                   x'0CD8'
     d EPT_QRZLCPRT    c                   x'0CD9'
     d EPT_QCIMRT2     c                   x'0CDA'
     d EPT_QPMBCVTD    c                   x'0CDB'
     d EPT_QSPPLSTX    c                   x'0CDC'
     d EPT_QSPQLSTX    c                   x'0CDD'
     d EPT_QEADRVR1    c                   x'0CDE'
     d EPT_QSCPTMSG    c                   x'0CDF'
     d EPT_QSCVPIEX    c                   x'0CE0'
     d EPT_QWTSCERP    c                   x'0CE1'
     d EPT_QHCQRYLN    c                   x'0CE2'
     d EPT_QWSMISC     c                   x'0CE3'
     d EPT_QCIOPNDX    c                   x'0CE4'
     d EPT_QDCCNFO     c                   x'0CE5'
     d EPT_QSXDSPP     c                   x'0CE6'
     d EPT_QSXPRTL     c                   x'0CE7'
     d EPT_QCIOPENP    c                   x'0CE8'
     d EPT_QCIOPENF    c                   x'0CE9'
     d EPT_QCIOPEND    c                   x'0CEA'
     d EPT_QOKGETD     c                   x'0CEB'
     d EPT_QLPCSOCK    c                   x'0CEC'
     d EPT_QLPIPL      c                   x'0CED'
     d EPT_QLPSVR      c                   x'0CEE'
     d EPT_QPZCPYIX    c                   x'0CEF'
     d EPT_QPQCTRC     c                   x'0CF0'
     d EPT_QURUYR40    c                   x'0CF1'
     d EPT_QHFFXREG    c                   x'0CF2'
     d EPT_QSPEXTWI    c                   x'0CF3'
     d EPT_QSWLDEV     c                   x'0CF4'
     d EPT_QSWLDSUC    c                   x'0CF5'
     d EPT_QSWLDCR     c                   x'0CF6'
     d EPT_QSWLD1SB    c                   x'0CF7'
     d EPT_QSWLDOSE    c                   x'0CF8'
     d EPT_QWCCAAYC    c                   x'0CF9'
     d EPT_QSXCHGPB    c                   x'0CFA'
     d EPT_QSXCHGPO    c                   x'0CFB'
     d EPT_QWCPUPRR    c                   x'0CFC'
     d EPT_QQXUNLCK    c                   x'0CFD'
     d EPT_QTEMEJCU    c                   x'0CFE'
     d EPT_QDCPVDLD    c                   x'0CFF'
     d EPT_QODRGZ      c                   x'0D00'
     d EPT_QEXCPMN     c                   x'0D01'
     d EPT_QEXEXIT     c                   x'0D02'
     d EPT_QTICRTSUP   c                   x'0D03'
     d EPT_QTISTRSUP   c                   x'0D04'
     d EPT_QTIENDSUP   c                   x'0D05'
     d EPT_QRFDWNLD    c                   x'0D06'
     d EPT_QRFNTYEX    c                   x'0D07'
     d EPT_QRFXLT      c                   x'0D08'
     d EPT_QQAKGETI    c                   x'0D09'
     d EPT_QQAKSSW     c                   x'0D0A'
     d EPT_QQAKSWDL    c                   x'0D0B'
     d EPT_QURBAR40    c                   x'0D0C'
     d EPT_QOLCLNUP    c                   x'0D0D'
     d EPT_QOKPOP      c                   x'0D0E'
     d EPT_QRERTVDQ    c                   x'0D0F'
     d EPT_QREXTRC     c                   x'0D10'
     d EPT_QEXCLOSE    c                   x'0D11'
     d EPT_QHCQRYEX    c                   x'0D12'
     d EPT_QCIPMPOP    c                   x'0D13'
     d EPT_QCISPPOP    c                   x'0D14'
     d EPT_QODMOVCP    c                   x'0D15'
     d EPT_QODMOVVC    c                   x'0D16'
     d EPT_QPDSSG      c                   x'0D17'
     d EPT_QLICLPOP    c                   x'0D18'
     d EPT_QLILBPOP    c                   x'0D19'
     d EPT_QSYPRPOP    c                   x'0D1A'
     d EPT_QTEMADPG    c                   x'0D1B'
     d EPT_QPDCALLS    c                   x'0D1C'
     d EPT_QPDMIR      c                   x'0D1D'
     d EPT_QWCPMNRR    c                   x'0D1E'
     d EPT_QRWADDDE    c                   x'0D1F'
     d EPT_QURLOCK     c                   x'0D20'
     d EPT_QONDSCNN    c                   x'0D21'
     d EPT_QLIRTVOB    c                   x'0D22'
     d EPT_QPDDRMTI    c                   x'0D23'
     d EPT_QTEMDBSV    c                   x'0D24'
     d EPT_QWCPRQRM    c                   x'0D25'
     d EPT_QTEMRLBP    c                   x'0D26'
     d EPT_QTEVRLJQ    c                   x'0D27'
     d EPT_QTEVSIRF    c                   x'0D28'
     d EPT_QODOBJSZ    c                   x'0D29'
     d EPT_QTEMSJVC    c                   x'0D2A'
     d EPT_QSYINT2     c                   x'0D2B'
     d EPT_QWCCCHCC    c                   x'0D2C'
     d EPT_QDCCRLET    c                   x'0D2D'
     d EPT_QDCCKLET    c                   x'0D2E'
     d EPT_QDCCHLET    c                   x'0D2F'
     d EPT_QDCVCLET    c                   x'0D30'
     d EPT_QUIPOP      c                   x'0D31'
     d EPT_QUISTSCN    c                   x'0D32'
     d EPT_QUICLINE    c                   x'0D33'
     d EPT_QALDLTAC    c                   x'0D34'
     d EPT_QALDSPMN    c                   x'0D35'
     d EPT_QALDTCOR    c                   x'0D36'
     d EPT_QALRPTAN    c                   x'0D37'
     d EPT_QALGTDTA    c                   x'0D38'
     d EPT_QNMADSCE    c                   x'0D39'
     d EPT_QNMRMSCE    c                   x'0D3A'
     d EPT_QNMADSCM    c                   x'0D3B'
     d EPT_QNMDLSCM    c                   x'0D3C'
     d EPT_QZSPRPOP    c                   x'0D3D'
     d EPT_QP0LSYSV    c                   x'0D3E'
     d EPT_QMAFILE     c                   x'0D3F'
     d EPT_QMAIEXIT    c                   x'0D40'
     d EPT_QMAMEDIA    c                   x'0D41'
     d EPT_QDMVOVRD    c                   x'0D42'
     d EPT_QDMCHOIC    c                   x'0D43'
     d EPT_QMAWKORI    c                   x'0D44'
     d EPT_QSCLICEH    c                   x'0D45'
     d EPT_QSCLICEV    c                   x'0D46'
     d EPT_QZSPSPOP    c                   x'0D47'
     d EPT_QLPCLNUP    c                   x'0D48'
     d EPT_QCMTEXIT    c                   x'0D49'
     d EPT_QCMRCLRS    c                   x'0D4A'
     d EPT_QTBSBDBX    c                   x'0D4B'
     d EPT_QTBAECHS    c                   x'0D4C'
     d EPT_QQQGET      c                   x'0D4D'
     d EPT_QQQSETUP    c                   x'0D4E'
     d EPT_QQQSQCMP    c                   x'0D4F'
     d EPT_QQXBLDIF    c                   x'0D50'
     d EPT_QSQIPLE     c                   x'0D51'
     d EPT_QTSTFRCB    c                   x'0D52'
     d EPT_QTSSCHGF    c                   x'0D53'
     d EPT_QEAWENR     c                   x'0D54'
     d EPT_QEAWMOD     c                   x'0D55'
     d EPT_QEAPRNT     c                   x'0D56'
     d EPT_QEADSPD     c                   x'0D57'
     d EPT_QEATRAN     c                   x'0D58'
     d EPT_QEAWSTU     c                   x'0D59'
     d EPT_QEAWCRS     c                   x'0D5A'
     d EPT_QEAWAUD     c                   x'0D5B'
     d EPT_QWPLDPRT    c                   x'0D5C'
     d EPT_QWCCWRLC    c                   x'0D5D'
     d EPT_QWCCWRLR    c                   x'0D5E'
     d EPT_QWCSXTJR    c                   x'0D5F'
     d EPT_QWCSXTCR    c                   x'0D60'
     d EPT_QWDGEXT     c                   x'0D61'
     d EPT_QSCADRT     c                   x'0D62'
     d EPT_QSCAEXIT    c                   x'0D63'
     d EPT_QESRPT      c                   x'0D64'
     d EPT_QSCAPLT     c                   x'0D65'
     d EPT_QWCPCRRR    c                   x'0D66'
     d EPT_QSCAPRT     c                   x'0D67'
     d EPT_QREXX       c                   x'0D68'
     d EPT_QREXINTC    c                   x'0D69'
     d EPT_QDCCRFD     c                   x'0D6A'
     d EPT_QOSDLAUT    c                   x'0D6B'
     d EPT_QOSCLAUT    c                   x'0D6C'
     d EPT_QOSRMTAT    c                   x'0D6D'
     d EPT_QOSLSTAT    c                   x'0D6E'
     d EPT_QODMISC4    c                   x'0D6F'
     d EPT_QODMISC5    c                   x'0D70'
     d EPT_QQA0BTCH    c                   x'0D71'
     d EPT_QQA0CPP     c                   x'0D72'
     d EPT_QTBAECHT    c                   x'0D73'
     d EPT_QTBAEJPN    c                   x'0D74'
     d EPT_QTBAEKOR    c                   x'0D75'
     d EPT_QTBEACHS    c                   x'0D76'
     d EPT_QTBEACHT    c                   x'0D77'
     d EPT_QTBEAJPN    c                   x'0D78'
     d EPT_QTBEAKOR    c                   x'0D79'
     d EPT_QOFRTVEN    c                   x'0D7A'
     d EPT_QSWNDMAN    c                   x'0D7B'
     d EPT_QSWNDCR     c                   x'0D7C'
     d EPT_QSWNDCRH    c                   x'0D7D'
     d EPT_QSWNDMRH    c                   x'0D7E'
     d EPT_QSWNDIAL    c                   x'0D7F'
     d EPT_QSWNDABC    c                   x'0D80'
     d EPT_QSWXCDPC    c                   x'0D81'
     d EPT_QZSPSPMT    c                   x'0D82'
     d EPT_QOERZ       c                   x'0D83'
     d EPT_QSQISCAN    c                   x'0D84'
     d EPT_QLSSSNI     c                   x'0D85'
     d EPT_QLSINSSN    c                   x'0D86'
     d EPT_QLSENSSN    c                   x'0D87'
     d EPT_QSPRESET    c                   x'0D88'
     d EPT_QOPTK       c                   x'0D89'
     d EPT_QCICPYCC    c                   x'0D8A'
     d EPT_QCICPYSA    c                   x'0D8B'
     d EPT_QLCCRTCD    c                   x'0D8C'
     d EPT_QLPINATO    c                   x'0D8D'
     d EPT_QLPWRKIP    c                   x'0D8E'
     d EPT_QLPINLPP    c                   x'0D8F'
     d EPT_QLPOCINS    c                   x'0D90'
     d EPT_QSPMNCFA    c                   x'0D91'
     d EPT_QLPCRTDT    c                   x'0D92'
     d EPT_QLPINITP    c                   x'0D93'
     d EPT_QUCRTDEA    c                   x'0D94'
     d EPT_QUCRTDAF    c                   x'0D95'
     d EPT_QUCRTDUS    c                   x'0D96'
     d EPT_QUCRTPDM    c                   x'0D97'
     d EPT_QNMEVK      c                   x'0D98'
     d EPT_QALDSPDY    c                   x'0D99'
     d EPT_QALCADPX    c                   x'0D9A'
     d EPT_QOSMMIDP    c                   x'0D9B'
     d EPT_QUPSSG      c                   x'0D9C'
     d EPT_QUPCNFG     c                   x'0D9D'
     d EPT_QQQISVSU    c                   x'0D9E'
     d EPT_QWTMMSDJ    c                   x'0D9F'
     d EPT_QWCCCHPC    c                   x'0DA0'
     d EPT_QMHCLSAP    c                   x'0DA1'
     d EPT_QESSRVRQ    c                   x'0DA2'
     d EPT_QEACEXIT    c                   x'0DA3'
     d EPT_QEASWPST    c                   x'0DA4'
     d EPT_QTEMCHDB    c                   x'0DA5'
     d EPT_QCJCRTPD    c                   x'0DA6'
     d EPT_QCJCHGPR    c                   x'0DA7'
     d EPT_QCJDSPPR    c                   x'0DA8'
     d EPT_QDRMAIN     c                   x'0DA9'
     d EPT_QDRREAD     c                   x'0DAA'
     d EPT_QDRWRITE    c                   x'0DAB'
     d EPT_QDRPRINT    c                   x'0DAC'
     d EPT_QDRDSPAL    c                   x'0DAD'
     d EPT_QDBTRIGG    c                   x'0DAE'
     d EPT_QPZPCEXT    c                   x'0DAF'
     d EPT_QURUNLCK    c                   x'0DB0'
     d EPT_QIZARSTX    c                   x'0DB1'
     d EPT_QRZGET      c                   x'0DB2'
     d EPT_QSCMSGEV    c                   x'0DB3'
     d EPT_QSCSBWCH    c                   x'0DB4'
     d EPT_QZSPWCTO    c                   x'0DB5'
     d EPT_QRZCRTOB    c                   x'0DB6'
     d EPT_QCLDOCMD    c                   x'0DB7'
     d EPT_QRZINIT     c                   x'0DB8'
     d EPT_QRZBLDAS    c                   x'0DB9'
     d EPT_QRZUNLCK    c                   x'0DBA'
     d EPT_QSCWCMON    c                   x'0DBB'
     d EPT_QRZCEC      c                   x'0DBC'
     d EPT_QRZSTG      c                   x'0DBD'
     d EPT_QRZLWS      c                   x'0DBE'
     d EPT_QRZCMN      c                   x'0DBF'
     d EPT_QSPRCSTG    c                   x'0DC0'
     d EPT_QSXRMTL     c                   x'0DC1'
     d EPT_QSXRMTR1    c                   x'0DC2'
     d EPT_QSXRMTR2    c                   x'0DC3'
     d EPT_QSXRMCLN    c                   x'0DC4'
     d EPT_QSXLSACT    c                   x'0DC5'
     d EPT_QSXVLDWP    c                   x'0DC6'
     d EPT_QSXDLTPS    c                   x'0DC7'
     d EPT_QSXQUERY    c                   x'0DC8'
     d EPT_QSXDSPD2    c                   x'0DC9'
     d EPT_QSXGETPB    c                   x'0DCA'
     d EPT_QEZ1111     c                   x'0DCB'
     d EPT_QOKDIRVC    c                   x'0DCC'
     d EPT_QQXRSLOB    c                   x'0DCD'
     d EPT_QLPHNDIP    c                   x'0DCE'
     d EPT_QLPDLTIP    c                   x'0DCF'
     d EPT_QOKTPOST    c                   x'0DD0'
     d EPT_QOKPTWRK    c                   x'0DD1'
     d EPT_QOKPTADD    c                   x'0DD2'
     d EPT_QOKTADDT    c                   x'0DD3'
     d EPT_QOKCALDD    c                   x'0DD4'
     d EPT_QOKPTDTL    c                   x'0DD5'
     d EPT_QOKPTCHG    c                   x'0DD6'
     d EPT_QOKPTLST    c                   x'0DD7'
     d EPT_QOKPSRCH    c                   x'0DD8'
     d EPT_QOKXLATE    c                   x'0DD9'
     d EPT_QWCPRSRE    c                   x'0DDA'
     d EPT_QPZDBMGR    c                   x'0DDB'
     d EPT_QPZSYNC     c                   x'0DDC'
     d EPT_QPZEND      c                   x'0DDD'
     d EPT_QESSETUP    c                   x'0DDE'
     d EPT_QESASRQS    c                   x'0DDF'
     d EPT_QESASTST    c                   x'0DE0'
     d EPT_QESRCVAN    c                   x'0DE1'
     d EPT_QESFXSTR    c                   x'0DE2'
     d EPT_QESFXRCV    c                   x'0DE3'
     d EPT_QEDRTVL     c                   x'0DE4'
     d EPT_QEDIEXT     c                   x'0DE5'
     d EPT_QEDSSP      c                   x'0DE6'
     d EPT_QEDSCTL     c                   x'0DE7'
     d EPT_QEDADDR     c                   x'0DE8'
     d EPT_QEDRMVR     c                   x'0DE9'
     d EPT_QEDCHGR     c                   x'0DEA'
     d EPT_QEDRTVR     c                   x'0DEB'
     d EPT_QEDLSACT    c                   x'0DEC'
     d EPT_QEDSCLL     c                   x'0DED'
     d EPT_QWCCDSPC    c                   x'0DEE'
     d EPT_QEGMAIN     c                   x'0DEF'
     d EPT_QEGAECON    c                   x'0DF0'
     d EPT_QEATPBTM    c                   x'0DF1'
     d EPT_QSZSTPRD    c                   x'0DF2'
     d EPT_QSZEXPRD    c                   x'0DF3'
     d EPT_QSZLKPRD    c                   x'0DF4'
     d EPT_QRZRTVSN    c                   x'0DF5'
     d EPT_QEDMODMA    c                   x'0DF6'
     d EPT_QOED2       c                   x'0DF7'
     d EPT_QLIODPOP    c                   x'0DF8'
     d EPT_QLSMDADD    c                   x'0DF9'
     d EPT_QPTPOP      c                   x'0DFA'
     d EPT_QCLRTVCV    c                   x'0DFB'
     d EPT_QCDRTVCV    c                   x'0DFC'
     d EPT_QPMMSLTT    c                   x'0DFD'
     d EPT_QLMADPRF    c                   x'0DFE'
     d EPT_QLMADPRM    c                   x'0DFF'
     d EPT_QLMADRMV    c                   x'0E00'
     d EPT_QSQTRGIO    c                   x'0E01'
     d EPT_QQXRTVOI    c                   x'0E02'
     d EPT_QRZRSTPD    c                   x'0E03'
     d EPT_QRZSAVPD    c                   x'0E04'
     d EPT_QLMCRSHD    c                   x'0E05'
     d EPT_QLMDSPRF    c                   x'0E06'
     d EPT_QLMDSREM    c                   x'0E07'
     d EPT_QLMEXTEX    c                   x'0E08'
     d EPT_QLMFVECT    c                   x'0E09'
     d EPT_QLMREMHD    c                   x'0E0A'
     d EPT_QLMREMST    c                   x'0E0B'
     d EPT_QLMRNGIF    c                   x'0E0C'
     d EPT_QLMUSREX    c                   x'0E0D'
     d EPT_QSWPDLSM    c                   x'0E0E'
     d EPT_QLMVALAD    c                   x'0E0F'
     d EPT_QTQGTCC2    c                   x'0E10'
     d EPT_QQXOBJPR    c                   x'0E11'
     d EPT_QTEXNBPC    c                   x'0E12'
     d EPT_QLMVALPR    c                   x'0E13'
     d EPT_QLMVALRA    c                   x'0E14'
     d EPT_QLMVALRM    c                   x'0E15'
     d EPT_QLMWKADF    c                   x'0E16'
     d EPT_QLMWKADP    c                   x'0E17'
     d EPT_QSXWRKTX    c                   x'0E18'
     d EPT_QSXTXTAL    c                   x'0E19'
     d EPT_QSXVLDSP    c                   x'0E1A'
     d EPT_QSXPTFAL    c                   x'0E1B'
     d EPT_QSPFXASP    c                   x'0E1C'
     d EPT_QPAGJIEH    c                   x'0E1D'
     d EPT_QDCRTFL     c                   x'0E1E'
     d EPT_QNFUSREX    c                   x'0E1F'
     d EPT_QDBCFPOP    c                   x'0E20'
     d EPT_QUISAVE     c                   x'0E21'
     d EPT_QSPCLPRT    c                   x'0E22'
     d EPT_QSPCLDSP    c                   x'0E23'
     d EPT_QALPRALR    c                   x'0E24'
     d EPT_QPZINZSY    c                   x'0E25'
     d EPT_QPZDLOBJ    c                   x'0E26'
     d EPT_QTVUEH      c                   x'0E27'
     d EPT_QTVUINVE    c                   x'0E28'
     d EPT_QTVSSYSR    c                   x'0E29'
     d EPT_QTVSEVHD    c                   x'0E2A'
     d EPT_QSPOPENG    c                   x'0E2B'
     d EPT_QSPOPENP    c                   x'0E2C'
     d EPT_QCJRTVPR    c                   x'0E2D'
     d EPT_QCJPROP     c                   x'0E2E'
     d EPT_QMNCPYL     c                   x'0E2F'
     d EPT_QZSPIPX     c                   x'0E30'
     d EPT_QEZCLINT    c                   x'0E31'
     d EPT_QEZCLOFC    c                   x'0E32'
     d EPT_QDBTRISV    c                   x'0E33'
     d EPT_QTNCMTEP    c                   x'0E34'
     d EPT_QTEVBPCH    c                   x'0E35'
     d EPT_QEZCLJL     c                   x'0E36'
     d EPT_QCMWRKJB    c                   x'0E37'
     d EPT_QCMCNINF    c                   x'0E38'
     d EPT_QCMWJOPT    c                   x'0E39'
     d EPT_QCMWKEVT    c                   x'0E3A'
     d EPT_QCMWKEXT    c                   x'0E3B'
     d EPT_QCMIEXIT    c                   x'0E3C'
     d EPT_QCMLSTEN    c                   x'0E3D'
     d EPT_QDBAPPAN    c                   x'0E3E'
     d EPT_QDBMEEH     c                   x'0E3F'
     d EPT_QAESQL97    c                   x'0E40'
     d EPT_QDBFIXIQ    c                   x'0E41'
     d EPT_QDBAPMGR    c                   x'0E42'
     d EPT_QDBMAINT    c                   x'0E43'
     d EPT_QSHTERSE    c                   x'0E44'
     d EPT_QAESTORG    c                   x'0E45'
     d EPT_QSHRCVOB    c                   x'0E46'
     d EPT_QSHINT1     c                   x'0E47'
     d EPT_QEZUSRPR    c                   x'0E48'
     d EPT_QEZDOBJD    c                   x'0E49'
     d EPT_QEZGEXIT    c                   x'0E4A'
     d EPT_QICLSTEN    c                   x'0E4B'
     d EPT_QICCONIN    c                   x'0E4C'
     d EPT_QMHWRMSS    c                   x'0E4D'
     d EPT_QTVSEXIT    c                   x'0E4E'
     d EPT_QND5MAIN    c                   x'0E4F'
     d EPT_QND5ITRM    c                   x'0E50'
     d EPT_QND5CDIS    c                   x'0E51'
     d EPT_QOKXTRNS    c                   x'0E52'
     d EPT_QZSPIPXI    c                   x'0E53'
     d EPT_QZSPJEND    c                   x'0E54'
     d EPT_QMNDSPWS    c                   x'0E55'
     d EPT_QSQIPOP     c                   x'0E56'
     d EPT_QHCCCFG     c                   x'0E57'
     d EPT_QTNRSYNC    c                   x'0E58'
     d EPT_QGSDLTRS    c                   x'0E59'
     d EPT_QAESTRA     c                   x'0E5A'
     d EPT_QRWCHGDE    c                   x'0E5B'
     d EPT_QUPCMNVR    c                   x'0E5C'
     d EPT_QUIMNSAV    c                   x'0E5D'
     d EPT_QCICPYVL    c                   x'0E5E'
     d EPT_QSCMBSS     c                   x'0E5F'
     d EPT_QQXCLIMX    c                   x'0E60'
     d EPT_QQXCLSTP    c                   x'0E61'
     d EPT_QQXCLSTQ    c                   x'0E62'
     d EPT_QQXSQL      c                   x'0E63'
     d EPT_QQXFRMPR    c                   x'0E64'
     d EPT_QQXCFQDT    c                   x'0E65'
     d EPT_QQXEDBFD    c                   x'0E66'
     d EPT_QQXEDBMD    c                   x'0E67'
     d EPT_QQXEDBOV    c                   x'0E68'
     d EPT_QQXEE       c                   x'0E69'
     d EPT_QQXCRTEM    c                   x'0E6A'
     d EPT_QQXJBINF    c                   x'0E6B'
     d EPT_QQXPFINF    c                   x'0E6C'
     d EPT_QQXSYSVL    c                   x'0E6D'
     d EPT_QQXDSPRT    c                   x'0E6E'
     d EPT_QTEMRBCU    c                   x'0E6F'
     d EPT_QOSOXIT     c                   x'0E70'
     d EPT_QZSPJSTR    c                   x'0E71'
     d EPT_QRZBLDIX    c                   x'0E72'
     d EPT_QUHIXPOP    c                   x'0E73'
     d EPT_QEZCHGOP    c                   x'0E74'
     d EPT_QEZCHGPW    c                   x'0E75'
     d EPT_QEZCRTJR    c                   x'0E76'
     d EPT_QUHHYPER    c                   x'0E77'
     d EPT_QSWCDSEL    c                   x'0E78'
     d EPT_QODSRPRE    c                   x'0E79'
     d EPT_QODSRPOS    c                   x'0E7A'
     d EPT_QLPDLCPR    c                   x'0E7B'
     d EPT_QTNTRSYN    c                   x'0E7C'
     d EPT_QTNRSYSV    c                   x'0E7D'
     d EPT_QEZCLRPQ    c                   x'0E7E'
     d EPT_QEZCMPP     c                   x'0E7F'
     d EPT_QTNRLBRQ    c                   x'0E80'
     d EPT_QEZCURU     c                   x'0E81'
     d EPT_QEZDATVL    c                   x'0E82'
     d EPT_QEZDFTPM    c                   x'0E83'
     d EPT_QTNI4GET    c                   x'0E84'
     d EPT_QTNSNDJE    c                   x'0E85'
     d EPT_QTNPREP     c                   x'0E86'
     d EPT_QEZGETSE    c                   x'0E87'
     d EPT_QEZJBPRF    c                   x'0E88'
     d EPT_QTNDSPCD    c                   x'0E89'
     d EPT_QEZRMVSM    c                   x'0E8A'
     d EPT_QRWDSPDE    c                   x'0E8B'
     d EPT_QTNDSPCS    c                   x'0E8C'
     d EPT_QTNRSCBL    c                   x'0E8D'
     d EPT_QEZSNDM     c                   x'0E8E'
     d EPT_QTNWRKCD    c                   x'0E8F'
     d EPT_QEZ1111C    c                   x'0E90'
     d EPT_QTNDFNBL    c                   x'0E91'
     d EPT_QTEMRPDS    c                   x'0E92'
     d EPT_QLPINZCP    c                   x'0E93'
     d EPT_QUROFC      c                   x'0E94'
     d EPT_QSZCPFID    c                   x'0E95'
     d EPT_QSZCNLCG    c                   x'0E96'
     d EPT_QOHBLDDP    c                   x'0E97'
     d EPT_QODDLTDL    c                   x'0E98'
     d EPT_QOKSADDT    c                   x'0E99'
     d EPT_QSPGETST    c                   x'0E9A'
     d EPT_QSPDSPFM    c                   x'0E9B'
     d EPT_QSPDSPWM    c                   x'0E9C'
     d EPT_QZSPMJOB    c                   x'0E9D'
     d EPT_QSPUPDPF    c                   x'0E9E'
     d EPT_QTNPRINT    c                   x'0E9F'
     d EPT_QWSPRINT    c                   x'0EA0'
     d EPT_QOHFIXQ     c                   x'0EA1'
     d EPT_QEZAUT      c                   x'0EA2'
     d EPT_QEZS36E     c                   x'0EA3'
     d EPT_QEXCLRCI    c                   x'0EA4'
     d EPT_QWTPMHDJ    c                   x'0EA5'
     d EPT_QWTPITDP    c                   x'0EA6'
     d EPT_QHFDSPFS    c                   x'0EA7'
     d EPT_QRWWRKDE    c                   x'0EA8'
     d EPT_QCM0TCPC    c                   x'0EA9'
     d EPT_QESUC       c                   x'0EAA'
     d EPT_QLIEDTLL    c                   x'0EAB'
     d EPT_QSQTRGPM    c                   x'0EAC'
     d EPT_QREXBUF     c                   x'0EAD'
     d EPT_QREXQ       c                   x'0EAE'
     d EPT_QREXVAR     c                   x'0EAF'
     d EPT_QCM0TRC     c                   x'0EB0'
     d EPT_QRECDBMI    c                   x'0EB1'
     d EPT_QWSSYSRQ    c                   x'0EB2'
     d EPT_QCM0IEXT    c                   x'0EB3'
     d EPT_QTNLOG      c                   x'0EB4'
     d EPT_QSPUPDPQ    c                   x'0EB5'
     d EPT_QSPVFYAS    c                   x'0EB6'
     d EPT_QSCENTRC    c                   x'0EB7'
     d EPT_QSCFNTRC    c                   x'0EB8'
     d EPT_QAESTUB3    c                   x'0EB9'
     d EPT_QNMACQFP    c                   x'0EBA'
     d EPT_QRWRMVDE    c                   x'0EBB'
     d EPT_QOHJBCNL    c                   x'0EBC'
     d EPT_QOHMISC     c                   x'0EBD'
     d EPT_QQXDTOBJ    c                   x'0EBE'
     d EPT_QOKPTMWK    c                   x'0EBF'
     d EPT_QOKPTADM    c                   x'0EC0'
     d EPT_QOKTMBRO    c                   x'0EC1'
     d EPT_QTVSCMD     c                   x'0EC2'
     d EPT_QTVSGETL    c                   x'0EC3'
     d EPT_QTVSINIT    c                   x'0EC4'
     d EPT_QTVSREAD    c                   x'0EC5'
     d EPT_QTVSWRIT    c                   x'0EC6'
     d EPT_QTVUGETL    c                   x'0EC7'
     d EPT_QTVUINIT    c                   x'0EC8'
     d EPT_QTVUREAD    c                   x'0EC9'
     d EPT_QTVUWRIT    c                   x'0ECA'
     d EPT_QQXRTTXT    c                   x'0ECB'
     d EPT_QQXMSGQU    c                   x'0ECC'
     d EPT_QCUCRTSI    c                   x'0ECD'
     d EPT_QCUCHGSI    c                   x'0ECE'
     d EPT_QCUDSPSI    c                   x'0ECF'
     d EPT_QCUCSIPO    c                   x'0ED0'
     d EPT_QRWVLDCK    c                   x'0ED1'
     d EPT_QRWCHGPO    c                   x'0ED2'
     d EPT_QRWWKEXT    c                   x'0ED3'
     d EPT_QTNRSRSP    c                   x'0ED4'
     d EPT_QMHRTMSS    c                   x'0ED5'
     d EPT_QMHSNSTA    c                   x'0ED6'
     d EPT_QMHSNINQ    c                   x'0ED7'
     d EPT_QWCSRTVR    c                   x'0ED8'
     d EPT_QPRROOTP    c                   x'0ED9'
     d EPT_QRWSARDB    c                   x'0EDA'
     d EPT_QRWTARDB    c                   x'0EDB'
     d EPT_QRWSBIND    c                   x'0EDC'
     d EPT_QRWTBIND    c                   x'0EDD'
     d EPT_QOSUPDEA    c                   x'0EDE'
     d EPT_QOSPUTEA    c                   x'0EDF'
     d EPT_QOSGETEA    c                   x'0EE0'
     d EPT_QRWSEXEC    c                   x'0EE1'
     d EPT_QRWTEXEC    c                   x'0EE2'
     d EPT_QTNCRLBP    c                   x'0EE3'
     d EPT_QDBGRXFR    c                   x'0EE4'
     d EPT_QSCPNTRC    c                   x'0EE5'
     d EPT_QWSWINCT    c                   x'0EE6'
     d EPT_QMNCLRMQ    c                   x'0EE7'
     d EPT_QRWTCMMT    c                   x'0EE8'
     d EPT_QRWSDSCD    c                   x'0EE9'
     d EPT_QRWTDSCD    c                   x'0EEA'
     d EPT_QRWSINTR    c                   x'0EEB'
     d EPT_QRWTINTR    c                   x'0EEC'
     d EPT_QRWEVENT    c                   x'0EED'
     d EPT_QLICNACS    c                   x'0EEE'
     d EPT_QSQCONN     c                   x'0EEF'
     d EPT_QSQPCMD     c                   x'0EF0'
     d EPT_QSQPCPKG    c                   x'0EF1'
     d EPT_QSQSCPKG    c                   x'0EF2'
     d EPT_QSQPDBRM    c                   x'0EF3'
     d EPT_QSQDLTPK    c                   x'0EF4'
     d EPT_QSQSAVPK    c                   x'0EF5'
     d EPT_QSQRSTPK    c                   x'0EF6'
     d EPT_QSQRECOV    c                   x'0EF7'
     d EPT_QODIDXC     c                   x'0EF8'
     d EPT_QTNTRACE    c                   x'0EF9'
     d EPT_QDBCNVFT    c                   x'0EFA'
     d EPT_QTNCRDAR    c                   x'0EFB'
     d EPT_QOEIO       c                   x'0EFC'
     d EPT_QLGETTBL    c                   x'0EFD'
     d EPT_QLGLDTBL    c                   x'0EFE'
     d EPT_QLGPSID     c                   x'0EFF'
     d EPT_QOSAPIVC    c                   x'0F00'
     d EPT_QSQCMTER    c                   x'0F01'
     d EPT_QIZARSYS    c                   x'0F02'
     d EPT_QDBADDCT    c                   x'0F03'
     d EPT_QSQICPKG    c                   x'0F04'
     d EPT_QSQSYSPK    c                   x'0F05'
     d EPT_QRWDDMIF    c                   x'0F06'
     d EPT_QHFMCEXT    c                   x'0F07'
     d EPT_QTBMXTMX    c                   x'0F08'
     d EPT_QZDCMDCF    c                   x'0F09'
     d EPT_QZDCMDRT    c                   x'0F0A'
     d EPT_QRWSQRY     c                   x'0F0B'
     d EPT_QRWTQRY     c                   x'0F0C'
     d EPT_QRWXBLDF    c                   x'0F0D'
     d EPT_QRWXPRSF    c                   x'0F0E'
     d EPT_QRWSCMMT    c                   x'0F0F'
     d EPT_QCISRCAT    c                   x'0F10'
     d EPT_QEXOXRF     c                   x'0F11'
     d EPT_QGSCRTRS    c                   x'0F12'
     d EPT_QLIDLOBJ    c                   x'0F13'
     d EPT_QRUADALC    c                   x'0F14'
     d EPT_QRUADALD    c                   x'0F15'
     d EPT_QSRPSCPR    c                   x'0F16'
     d EPT_QSRROCPR    c                   x'0F17'
     d EPT_QSRSOCPR    c                   x'0F18'
     d EPT_QDBCHGCT    c                   x'0F19'
     d EPT_QUICCRTM    c                   x'0F1A'
     d EPT_QWCCLFEC    c                   x'0F1B'
     d EPT_QWDCADJ     c                   x'0F1C'
     d EPT_QWDCADR     c                   x'0F1D'
     d EPT_QWDCCRG     c                   x'0F1E'
     d EPT_QTEVINVR    c                   x'0F1F'
     d EPT_QZDCMDNM    c                   x'0F20'
     d EPT_QWTSCBCI    c                   x'0F21'
     d EPT_QWTCCBCI    c                   x'0F22'
     d EPT_QWTMMBCI    c                   x'0F23'
     d EPT_QSCIEXIT    c                   x'0F24'
     d EPT_QSCDSTSO    c                   x'0F25'
     d EPT_QTBMXSBX    c                   x'0F26'
     d EPT_QLPRMPGM    c                   x'0F27'
     d EPT_QSRTGTRS    c                   x'0F28'
     d EPT_QJOVLDCK    c                   x'0F29'
     d EPT_QSQRCPKG    c                   x'0F2A'
     d EPT_QDBRMVCT    c                   x'0F2B'
     d EPT_QTEVMSG     c                   x'0F2C'
     d EPT_QDBADDPK    c                   x'0F2D'
     d EPT_QDBRMVPK    c                   x'0F2E'
     d EPT_QTACDENS    c                   x'0F2F'
     d EPT_QNMRTVFP    c                   x'0F30'
     d EPT_QTAVDENS    c                   x'0F31'
     d EPT_QWCSCVLR    c                   x'0F32'
     d EPT_QDBVFYCT    c                   x'0F33'
     d EPT_QSQALTER    c                   x'0F34'
     d EPT_QTOCUX1     c                   x'0F35'
     d EPT_QNMMSTEH    c                   x'0F36'
     d EPT_QNMTEXIT    c                   x'0F37'
     d EPT_QECCVTEC    c                   x'0F38'
     d EPT_QECCVTEW    c                   x'0F39'
     d EPT_QECEDT      c                   x'0F3A'
     d EPT_QOHIOUTF    c                   x'0F3B'
     d EPT_QTOCIX1     c                   x'0F3C'
     d EPT_QSZCRTDF    c                   x'0F3D'
     d EPT_QSZCRTOP    c                   x'0F3E'
     d EPT_QTOCOPT     c                   x'0F3F'
     d EPT_QNMTIEXT    c                   x'0F40'
     d EPT_QNMAPCTL    c                   x'0F41'
     d EPT_QNMACP1     c                   x'0F42'
     d EPT_QNMACIE     c                   x'0F43'
     d EPT_QNMACEH     c                   x'0F44'
     d EPT_QESMGR      c                   x'0F45'
     d EPT_QWCJSTYE    c                   x'0F46'
     d EPT_QWCJHTYE    c                   x'0F47'
     d EPT_QWCJFXYE    c                   x'0F48'
     d EPT_QWCJERYE    c                   x'0F49'
     d EPT_QWCJHNRE    c                   x'0F4A'
     d EPT_QEZBKSCD    c                   x'0F4B'
     d EPT_QEZBKMSG    c                   x'0F4C'
     d EPT_QEZBKWM     c                   x'0F4D'
     d EPT_QEZDCSCD    c                   x'0F4E'
     d EPT_QEZDSSTS    c                   x'0F4F'
     d EPT_QCCOPDEV    c                   x'0F50'
     d EPT_QWCCCHYC    c                   x'0F51'
     d EPT_QOKRNUSR    c                   x'0F52'
     d EPT_QOKRNMCP    c                   x'0F53'
     d EPT_QCCOPSYS    c                   x'0F54'
     d EPT_QOKRNPOP    c                   x'0F55'
     d EPT_QOKRNMPL    c                   x'0F56'
     d EPT_QOKMOD      c                   x'0F57'
     d EPT_QOHRNUSR    c                   x'0F5A'
     d EPT_QODRTVVC    c                   x'0F5B'
     d EPT_QODRTVCP    c                   x'0F5C'
     d EPT_QDCCHFLE    c                   x'0F5D'
     d EPT_QDCCRSPT    c                   x'0F5E'
     d EPT_QDCCHSPT    c                   x'0F5F'
     d EPT_QCCWRKCC    c                   x'0F60'
     d EPT_QOJSVVCP    c                   x'0F61'
     d EPT_QOJSVCPR    c                   x'0F62'
     d EPT_QOJSVCP2    c                   x'0F63'
     d EPT_QOJRSTVC    c                   x'0F64'
     d EPT_QOJRSTCP    c                   x'0F65'
     d EPT_QOJRSTDL    c                   x'0F66'
     d EPT_QOJSRIXT    c                   x'0F67'
     d EPT_QOJRSTIX    c                   x'0F68'
     d EPT_QWCJSTJE    c                   x'0F69'
     d EPT_QWCJHTJE    c                   x'0F6A'
     d EPT_QWCCWRYC    c                   x'0F6B'
     d EPT_QWCSWRYR    c                   x'0F6C'
     d EPT_QTOCWTE     c                   x'0F6D'
     d EPT_QTOCATE     c                   x'0F6E'
     d EPT_QTOCRTE     c                   x'0F6F'
     d EPT_QTOCPING    c                   x'0F70'
     d EPT_QTOAPING    c                   x'0F71'
     d EPT_QTOASTT     c                   x'0F72'
     d EPT_QTOAUSTT    c                   x'0F73'
     d EPT_QTOAOPN     c                   x'0F74'
     d EPT_QTOASND     c                   x'0F75'
     d EPT_QLPSVCPR    c                   x'0F76'
     d EPT_QSCAXDRT    c                   x'0F77'
     d EPT_QSCAXFMT    c                   x'0F78'
     d EPT_QSZPDDCR    c                   x'0F79'
     d EPT_QNFRNUSR    c                   x'0F7A'
     d EPT_QSHDCPLP    c                   x'0F7B'
     d EPT_QTOACLS     c                   x'0F7C'
     d EPT_QSPSDTAQ    c                   x'0F7D'
     d EPT_QQXXLATE    c                   x'0F7E'
     d EPT_QQXCLITF    c                   x'0F7F'
     d EPT_QSQFLAG     c                   x'0F80'
     d EPT_QSQFTABF    c                   x'0F81'
     d EPT_QSQFTABS    c                   x'0F82'
     d EPT_QSQCHGPK    c                   x'0F83'
     d EPT_QWDCADQ     c                   x'0F84'
     d EPT_QOHICHGV    c                   x'0F85'
     d EPT_QOSISNDV    c                   x'0F86'
     d EPT_QOSRCVIX    c                   x'0F87'
     d EPT_QND5VRYO    c                   x'0F88'
     d EPT_QHFOPNSF    c                   x'0F89'
     d EPT_QHFRDSF     c                   x'0F8A'
     d EPT_QHFWRTSF    c                   x'0F8B'
     d EPT_QHFCHGFP    c                   x'0F8C'
     d EPT_QHFCLOSF    c                   x'0F8D'
     d EPT_QHFRTVAT    c                   x'0F8E'
     d EPT_QHFCHGAT    c                   x'0F8F'
     d EPT_QHFDLTSF    c                   x'0F90'
     d EPT_QOHFIXXX    c                   x'0F91'
     d EPT_QSQMSGAR    c                   x'0F92'
     d EPT_QONX4REC    c                   x'0F93'
     d EPT_QONX4RIX    c                   x'0F94'
     d EPT_QICFMERR    c                   x'0F95'
     d EPT_QOKDPTUP    c                   x'0F96'
     d EPT_QOKLOCUP    c                   x'0F97'
     d EPT_QOKPALOC    c                   x'0F98'
     d EPT_QOKPDLOC    c                   x'0F99'
     d EPT_QOKPSLOC    c                   x'0F9A'
     d EPT_QOKPCLOC    c                   x'0F9B'
     d EPT_QOKLOCCP    c                   x'0F9C'
     d EPT_QOKCALLD    c                   x'0F9D'
     d EPT_QOKPWLOC    c                   x'0F9E'
     d EPT_QOKPPLOC    c                   x'0F9F'
     d EPT_QOKWSHCP    c                   x'0FA0'
     d EPT_QOKPSWRK    c                   x'0FA1'
     d EPT_QOKSHDCP    c                   x'0FA2'
     d EPT_QOKSHUPD    c                   x'0FA3'
     d EPT_QOKCALSD    c                   x'0FA4'
     d EPT_QOKCALCD    c                   x'0FA5'
     d EPT_QOKPCWRK    c                   x'0FA6'
     d EPT_QOKPSPOS    c                   x'0FA7'
     d EPT_QOKSHPOP    c                   x'0FA8'
     d EPT_QOKSHRMV    c                   x'0FA9'
     d EPT_QOKRTVRT    c                   x'0FAA'
     d EPT_QOKATTCP    c                   x'0FAB'
     d EPT_QOKAPOP     c                   x'0FAC'
     d EPT_QOKCSUP     c                   x'0FAD'
     d EPT_QOKCCTL     c                   x'0FAE'
     d EPT_QOKCPYCP    c                   x'0FAF'
     d EPT_QOKCNEXT    c                   x'0FB0'
     d EPT_QOKCAPPC    c                   x'0FB1'
     d EPT_QOKFUTDT    c                   x'0FB2'
     d EPT_QWSMSWAP    c                   x'0FB3'
     d EPT_QOKCCTOR    c                   x'0FB4'
     d EPT_QOKCVTDT    c                   x'0FB5'
     d EPT_QFIOKR50    c                   x'0FB6'
     d EPT_QOKDSPDP    c                   x'0FB7'
     d EPT_QOKSCOND    c                   x'0FB8'
     d EPT_QWPAPUT     c                   x'0FB9'
     d EPT_QWPAPTFL    c                   x'0FBA'
     d EPT_QWPXPUT     c                   x'0FBB'
     d EPT_QGSGETRS    c                   x'0FBC'
     d EPT_QOCCTLOF    c                   x'0FBD'
     d EPT_QWCSNSYR    c                   x'0FBE'
     d EPT_QWCSXTYR    c                   x'0FBF'
     d EPT_QWCCRMYC    c                   x'0FC0'
     d EPT_QWCCHRYC    c                   x'0FC1'
     d EPT_QSCSNTRC    c                   x'0FC2'
     d EPT_QWCJMNYR    c                   x'0FC3'
     d EPT_QWCJSRYR    c                   x'0FC4'
     d EPT_QWCSRSYR    c                   x'0FC5'
     d EPT_QWCSSVYR    c                   x'0FC6'
     d EPT_QGSCRTSP    c                   x'0FC7'
     d EPT_QSROUTFL    c                   x'0FC8'
     d EPT_QGSSAVFR    c                   x'0FC9'
     d EPT_QLYSETS     c                   x'0FCA'
     d EPT_QLYGETS     c                   x'0FCB'
     d EPT_QLYWRTBI    c                   x'0FCC'
     d EPT_QLYRDBI     c                   x'0FCD'
     d EPT_QGYLANWR    c                   x'0FCE'
     d EPT_QOKCQDOC    c                   x'0FCF'
     d EPT_QOKPSTCH    c                   x'0FD0'
     d EPT_QOKXITCK    c                   x'0FD1'
     d EPT_QOKRNIPL    c                   x'0FD2'
     d EPT_QOHRCVIX    c                   x'0FD3'
     d EPT_QNMWKSOC    c                   x'0FD4'
     d EPT_QNMDPSOC    c                   x'0FD5'
     d EPT_QNMSOCXT    c                   x'0FD6'
     d EPT_QNMAMEH     c                   x'0FD7'
     d EPT_QNMAMRC     c                   x'0FD8'
     d EPT_QNMAMSOC    c                   x'0FD9'
     d EPT_QNMAMSC     c                   x'0FDA'
     d EPT_QNMAMEP     c                   x'0FDB'
     d EPT_QNMAMGR     c                   x'0FDC'
     d EPT_QNMAMSL     c                   x'0FDD'
     d EPT_QNMFRPRS    c                   x'0FDE'
     d EPT_QNMFRUPR    c                   x'0FDF'
     d EPT_QNMFRCR     c                   x'0FE0'
     d EPT_QNMINDEX    c                   x'0FE1'
     d EPT_QNMFRCH     c                   x'0FE2'
     d EPT_QNMFRPX     c                   x'0FE3'
     d EPT_QNMFRIXT    c                   x'0FE4'
     d EPT_QNMAPYFR    c                   x'0FE5'
     d EPT_QNMFRRSE    c                   x'0FE6'
     d EPT_QNMFRRAE    c                   x'0FE7'
     d EPT_QNMFRAAE    c                   x'0FE8'
     d EPT_QNMFRASE    c                   x'0FE9'
     d EPT_QNMFRWSE    c                   x'0FEA'
     d EPT_QNMFRSXT    c                   x'0FEB'
     d EPT_QNMFRCAE    c                   x'0FEC'
     d EPT_QNMFRWAE    c                   x'0FED'
     d EPT_QNMFRAXT    c                   x'0FEE'
     d EPT_QNMFRMSE    c                   x'0FEF'
     d EPT_QNMFRSPX    c                   x'0FF0'
     d EPT_QNMFRCSE    c                   x'0FF1'
     d EPT_QNMFRMAE    c                   x'0FF2'
     d EPT_QNMFRXTP    c                   x'0FF3'
     d EPT_QNMFRWK     c                   x'0FF4'
     d EPT_QNMFRXT     c                   x'0FF5'
     d EPT_QBNDSPPA    c                   x'0FF6'
     d EPT_QALCHGAL    c                   x'0FF7'
     d EPT_QALFRAAE    c                   x'0FF8'
     d EPT_QALFRVAE    c                   x'0FF9'
     d EPT_QALFRCVL    c                   x'0FFA'
     d EPT_QALFRAVL    c                   x'0FFB'
     d EPT_QALFRCAE    c                   x'0FFC'
     d EPT_QALFRAPX    c                   x'0FFD'
     d EPT_QALFRVAP    c                   x'0FFE'
     d EPT_QQQJDCMP    c                   x'0FFF'
     d EPT_QD0STRTS    c                   x'1000'
     d EPT_QD0ENDTS    c                   x'1001'
     d EPT_QBNCRTPG    c                   x'1002'
     d EPT_QD0TRNDS    c                   x'1003'
     d EPT_QSXFTRPB    c                   x'1004'
     d EPT_QSXFLTR     c                   x'1005'
     d EPT_QCIDSPSA    c                   x'1006'
     d EPT_QALMGR      c                   x'1007'
     d EPT_QUCRTPMM    c                   x'1008'
     d EPT_QUCRTPFT    c                   x'1009'
     d EPT_QUCRTPDT    c                   x'100A'
     d EPT_QUCCRTCO    c                   x'100B'
     d EPT_QUCCOMP     c                   x'100C'
     d EPT_QUCTXDSP    c                   x'100D'
     d EPT_QUCTXPRT    c                   x'100E'
     d EPT_QUCASDSP    c                   x'100F'
     d EPT_QUCASPRT    c                   x'1010'
     d EPT_QUCCVTKT    c                   x'1011'
     d EPT_QUCCVDAE    c                   x'1012'
     d EPT_QUCCVDEA    c                   x'1013'
     d EPT_QUCCVDAF    c                   x'1014'
     d EPT_QUCCVDUS    c                   x'1015'
     d EPT_QUCCVPDM    c                   x'1016'
     d EPT_QUCCVPMM    c                   x'1017'
     d EPT_QUCCVPFT    c                   x'1018'
     d EPT_QUCCVPDT    c                   x'1019'
     d EPT_QBNXMAIN    c                   x'101A'
     d EPT_QFIOCCVT    c                   x'101B'
     d EPT_QFIOCR50    c                   x'101C'
     d EPT_QFIOFCVT    c                   x'101D'
     d EPT_QFIOFR50    c                   x'101E'
     d EPT_QFIOKCVT    c                   x'101F'
     d EPT_QFIOSCVT    c                   x'1020'
     d EPT_QFIOSR50    c                   x'1021'
     d EPT_QFIOFCSZ    c                   x'1022'
     d EPT_QLPEXIT0    c                   x'1023'
     d EPT_QLZAAKVC    c                   x'1024'
     d EPT_QSZBLDIX    c                   x'1025'
     d EPT_QEZWKSGN    c                   x'1026'
     d EPT_QEZOPSGN    c                   x'1027'
     d EPT_QGSDSPFN    c                   x'1028'
     d EPT_QSQCVQDT    c                   x'1029'
     d EPT_QRZCNDL     c                   x'102A'
     d EPT_QRZRSTOH    c                   x'102B'
     d EPT_QRZLOCK     c                   x'102C'
     d EPT_QPZDLT      c                   x'102D'
     d EPT_QPZDSPPT    c                   x'102E'
     d EPT_QPZPTFDT    c                   x'102F'
     d EPT_QPZCOVER    c                   x'1030'
     d EPT_QOKSJBCP    c                   x'1031'
     d EPT_QDCCKDPT    c                   x'1032'
     d EPT_QDCCRDPT    c                   x'1033'
     d EPT_QDCCHDPT    c                   x'1034'
     d EPT_QPDLOGER    c                   x'1035'
     d EPT_QPDLOGC     c                   x'1036'
     d EPT_QSYLIBAU    c                   x'1037'
     d EPT_QSZRTVPD    c                   x'1038'
     d EPT_QLZACHGP    c                   x'1039'
     d EPT_QBNCRTSP    c                   x'103A'
     d EPT_QOTDCCVN    c                   x'103B'
     d EPT_QSCSAVAP    c                   x'103C'
     d EPT_QSCCHKCT    c                   x'103D'
     d EPT_QSCDLTCT    c                   x'103E'
     d EPT_QSCENDCT    c                   x'103F'
     d EPT_QSCEXTCT    c                   x'1040'
     d EPT_QSCPRTCT    c                   x'1041'
     d EPT_QSCPRTC1    c                   x'1042'
     d EPT_QSCSTRCT    c                   x'1043'
     d EPT_QEZCHGBK    c                   x'1044'
     d EPT_QEZBKPOP    c                   x'1045'
     d EPT_QEZCKCGF    c                   x'1046'
     d EPT_QEZRTVBK    c                   x'1047'
     d EPT_QEZRUNBK    c                   x'1048'
     d EPT_QEZSVIBM    c                   x'1049'
     d EPT_QEZDSPBK    c                   x'104A'
     d EPT_QLGRTVSS    c                   x'104B'
     d EPT_QSZCPDO     c                   x'104C'
     d EPT_QLGVLID     c                   x'104D'
     d EPT_QSZCPLO     c                   x'104E'
     d EPT_QLGCNVSS    c                   x'104F'
     d EPT_QSZPKG      c                   x'1050'
     d EPT_QSZCHKPO    c                   x'1051'
     d EPT_QOSCPGCP    c                   x'1052'
     d EPT_QNXIEXIT    c                   x'1053'
     d EPT_QSZCIEXT    c                   x'1054'
     d EPT_QSQIRDBL    c                   x'1055'
     d EPT_QSQIPKGL    c                   x'1056'
     d EPT_QSQIDUPR    c                   x'1057'
     d EPT_QHEACT      c                   x'1058'
     d EPT_QHEIEXIT    c                   x'1059'
     d EPT_QHEWRKAL    c                   x'105A'
     d EPT_QSXFVASE    c                   x'105B'
     d EPT_QSXFVCSE    c                   x'105C'
     d EPT_QSXFAPAE    c                   x'105D'
     d EPT_QSXFCPAE    c                   x'105E'
     d EPT_QSXFIEXT    c                   x'105F'
     d EPT_QSXPRTPB    c                   x'1060'
     d EPT_QSZSPREX    c                   x'1061'
     d EPT_QJODRUPD    c                   x'1062'
     d EPT_QTNSAV      c                   x'1063'
     d EPT_QTNUQEVT    c                   x'1064'
     d EPT_QTNT1EVT    c                   x'1065'
     d EPT_QTNT2EVT    c                   x'1066'
     d EPT_QTNIPLSV    c                   x'1067'
     d EPT_QIZARTV     c                   x'1068'
     d EPT_QIZARTVX    c                   x'1069'
     d EPT_QEZRTVDI    c                   x'106A'
     d EPT_QEZRCLM     c                   x'106B'
     d EPT_QEZSEPOB    c                   x'106C'
     d EPT_QEZCMPST    c                   x'106D'
     d EPT_QEZCLNUP    c                   x'106E'
     d EPT_QEZWRDSK    c                   x'106F'
     d EPT_QEZPRTDI    c                   x'1070'
     d EPT_QSYUPSIZ    c                   x'1071'
     d EPT_QPZRSTLD    c                   x'1072'
     d EPT_QPZSAVLD    c                   x'1073'
     d EPT_QPZSRD      c                   x'1074'
     d EPT_QPZPCCR     c                   x'1075'
     d EPT_QFIOECVT    c                   x'1076'
     d EPT_QPZCRTEX    c                   x'1077'
     d EPT_QPZGENID    c                   x'1078'
     d EPT_QSQSTATS    c                   x'1079'
     d EPT_QP0ZADDE    c                   x'107A'
     d EPT_QZSPUIXD    c                   x'107B'
     d EPT_QMHRLEX     c                   x'107C'
     d EPT_QEZDSHST    c                   x'107D'
     d EPT_QTVUUI      c                   x'107E'
     d EPT_QOESAVDC    c                   x'107F'
     d EPT_QCIDSPMA    c                   x'1080'
     d EPT_QCIDSPPA    c                   x'1081'
     d EPT_QBNVCCPG    c                   x'1082'
     d EPT_QTNDCBEH    c                   x'1083'
     d EPT_QOEVLCRT    c                   x'1084'
     d EPT_QOEVLDSP    c                   x'1085'
     d EPT_QOKCHGDL    c                   x'1086'
     d EPT_QOEDH       c                   x'1087'
     d EPT_QSPVRYAS    c                   x'1088'
     d EPT_QQXQRYSV    c                   x'1089'
     d EPT_QQQJOBST    c                   x'108A'
     d EPT_QBNVCUPG    c                   x'108B'
     d EPT_QSPMAINT    c                   x'108C'
     d EPT_QSPFIXUP    c                   x'108D'
     d EPT_QOERTVSW    c                   x'108E'
     d EPT_QOEPRTSW    c                   x'108F'
     d EPT_QOETWAPI    c                   x'1090'
     d EPT_QSCAPIEX    c                   x'1091'
     d EPT_QOKDRX      c                   x'1092'
     d EPT_QOKCHIPE    c                   x'1093'
     d EPT_QOKCHEAB    c                   x'1094'
     d EPT_QOEAS       c                   x'1095'
     d EPT_QFIOMR50    c                   x'1096'
     d EPT_QSCPMTCT    c                   x'1097'
     d EPT_QOEAUT      c                   x'1098'
     d EPT_QALDTSYM    c                   x'1099'
     d EPT_QSQMSGAS    c                   x'109A'
     d EPT_QEZBKHST    c                   x'109B'
     d EPT_QEZSNDMG    c                   x'109C'
     d EPT_QDVCLRPL    c                   x'109D'
     d EPT_QDVSOACC    c                   x'109E'
     d EPT_QSCDLTAP    c                   x'109F'
     d EPT_QSCAPLST    c                   x'10A0'
     d EPT_QSCVLICL    c                   x'10A1'
     d EPT_QPDAIXIT    c                   x'10A2'
     d EPT_QPDWRKPB    c                   x'10A3'
     d EPT_QSXFCAPX    c                   x'10A4'
     d EPT_QMHRMVM     c                   x'10A5'
     d EPT_QMHRMVPM    c                   x'10A6'
     d EPT_QMHRCVM     c                   x'10A7'
     d EPT_QMHRCVPM    c                   x'10A8'
     d EPT_QMHMOVPM    c                   x'10A9'
     d EPT_QMHRSNEM    c                   x'10AA'
     d EPT_QMHRCVIX    c                   x'10AB'
     d EPT_QMHSNDM     c                   x'10AC'
     d EPT_QMHSNDPM    c                   x'10AD'
     d EPT_QMHSNDRM    c                   x'10AE'
     d EPT_QZDKILLQ    c                   x'10AF'
     d EPT_QZDSQCLN    c                   x'10B0'
     d EPT_QZDINZDQ    c                   x'10B1'
     d EPT_QS2RSVID    c                   x'10B2'
     d EPT_QS2SCRID    c                   x'10B3'
     d EPT_QS2SNDDS    c                   x'10B4'
     d EPT_QS2SNDSC    c                   x'10B5'
     d EPT_QS2LSTPR    c                   x'10B6'
     d EPT_QS2RCVDS    c                   x'10B7'
     d EPT_QS2RCVSC    c                   x'10B8'
     d EPT_QS2DSTIX    c                   x'10B9'
     d EPT_QS2SENDR    c                   x'10BA'
     d EPT_QS2RCVR     c                   x'10BB'
     d EPT_QS2RCVIX    c                   x'10BC'
     d EPT_QS2STSND    c                   x'10BD'
     d EPT_QS2CRMUT    c                   x'10BE'
     d EPT_QS2CSMUT    c                   x'10BF'
     d EPT_QZDSIEXT    c                   x'10C0'
     d EPT_QZDSFINX    c                   x'10C1'
     d EPT_QZDSFIND    c                   x'10C2'
     d EPT_QS2SSINT    c                   x'10C3'
     d EPT_QS2SRINT    c                   x'10C4'
     d EPT_QS2SFINR    c                   x'10C5'
     d EPT_QS2SCREP    c                   x'10C6'
     d EPT_QS2SRSEQ    c                   x'10C7'
     d EPT_QS2SDELT    c                   x'10C8'
     d EPT_QS2SCHGR    c                   x'10C9'
     d EPT_QS2SCMUQ    c                   x'10CA'
     d EPT_QS2SRSET    c                   x'10CB'
     d EPT_QBNVCDMD    c                   x'10CC'
     d EPT_QDBLNGMV    c                   x'10CD'
     d EPT_QS2SIEXT    c                   x'10CE'
     d EPT_QSQREXX     c                   x'10CF'
     d EPT_QSQENDAG    c                   x'10D0'
     d EPT_QEZEXIT     c                   x'10D1'
     d EPT_QQUSTRQRY   c                   x'10D2'
     d EPT_QWSPTGUI    c                   x'10D3'
     d EPT_QDBPRCRL    c                   x'10D4'
     d EPT_QZDSOPRD    c                   x'10D5'
     d EPT_QBNUPDBP    c                   x'10D6'
     d EPT_QSCMMODL    c                   x'10D7'
     d EPT_QSYSAUDR    c                   x'10D8'
     d EPT_QSYCGOBA    c                   x'10D9'
     d EPT_QSYCGURA    c                   x'10DA'
     d EPT_QOELT       c                   x'10DB'
     d EPT_QOEFFV      c                   x'10DC'
     d EPT_QODALMAP    c                   x'10DD'
     d EPT_QSPWOEVT    c                   x'10DE'
     d EPT_QPDAPIL     c                   x'10DF'
     d EPT_QBNUPDAT    c                   x'10E0'
     d EPT_QSQPPUTS    c                   x'10E1'
     d EPT_QSQPRPKG    c                   x'10E2'
     d EPT_QPMBPCS     c                   x'10E3'
     d EPT_QCDCHKCS    c                   x'10E4'
     d EPT_QCADRV2     c                   x'10E5'
     d EPT_QTNENDAG    c                   x'10E6'
     d EPT_QTNUPAGA    c                   x'10E7'
     d EPT_QSYSMPVE    c                   x'10E8'
     d EPT_QWSHLGUI    c                   x'10E9'
     d EPT_QSXINEXT    c                   x'10EA'
     d EPT_QDCPVDPA    c                   x'10EB'
     d EPT_QFVLSTNL    c                   x'10EC'
     d EPT_QFVNODCR    c                   x'10ED'
     d EPT_QFVNODAE    c                   x'10EE'
     d EPT_QFVNODRE    c                   x'10EF'
     d EPT_QFVNODWE    c                   x'10F0'
     d EPT_QFVNODEX    c                   x'10F1'
     d EPT_QFVNODIX    c                   x'10F2'
     d EPT_QUCCVXFM    c                   x'10F3'
     d EPT_QUCGETTB    c                   x'10F4'
     d EPT_QUCRTNTB    c                   x'10F5'
     d EPT_QUCRTXFM    c                   x'10F6'
     d EPT_QUCXFPRT    c                   x'10F7'
     d EPT_QUCRTVVC    c                   x'10F8'
     d EPT_QEXCHJCB    c                   x'10F9'
     d EPT_QTEXRPDD    c                   x'10FA'
     d EPT_QTEXRMVM    c                   x'10FB'
     d EPT_QUHEDTIX    c                   x'10FC'
     d EPT_QDCPVIIS    c                   x'10FD'
     d EPT_QCPGRANT    c                   x'10FE'
     d EPT_QOSDSAUD    c                   x'10FF'
     d EPT_QOSCHAUD    c                   x'1100'
     d EPT_QOSAUDVC    c                   x'1101'
     d EPT_QODAUDIT    c                   x'1102'
     d EPT_QMHSCPEV    c                   x'1103'
     d EPT_QTNDESJN    c                   x'1104'
     d EPT_QZSPUIXL    c                   x'1105'
     d EPT_QNMTIEH     c                   x'1106'
     d EPT_QNMTIXT     c                   x'1107'
     d EPT_QSECCAJE    c                   x'1108'
     d EPT_QDCSTUBB    c                   x'1109'
     d EPT_QDCSTUBC    c                   x'110A'
     d EPT_QDCSTUBD    c                   x'110B'
     d EPT_QDCSTUBE    c                   x'110C'
     d EPT_QDCCRLDI    c                   x'110D'
     d EPT_QDCCHLDI    c                   x'110E'
     d EPT_QDCCKLDI    c                   x'110F'
     d EPT_QDCVCLDI    c                   x'1110'
     d EPT_QDCCRLFR    c                   x'1111'
     d EPT_QDCCHLFR    c                   x'1112'
     d EPT_QDCVCLFR    c                   x'1113'
     d EPT_QDCCKLFR    c                   x'1114'
     d EPT_QDCCRIFR    c                   x'1115'
     d EPT_QDCCHIFR    c                   x'1116'
     d EPT_QDCCKIFR    c                   x'1117'
     d EPT_QDCVCIFR    c                   x'1118'
     d EPT_QMHCVJMQ    c                   x'1119'
     d EPT_QMHPQSEH    c                   x'111A'
     d EPT_QTBEXIT     c                   x'111B'
     d EPT_QS2STSIX    c                   x'111C'
     d EPT_QOPEF       c                   x'111D'
     d EPT_QLISETSS    c                   x'111E'
     d EPT_QSYEVTNT    c                   x'111F'
     d EPT_QSYEVTAF    c                   x'1120'
     d EPT_QSYEVTLK    c                   x'1121'
     d EPT_QTONTRCRTE  c                   x'1122'
     d EPT_QTEXRTVS    c                   x'1123'
     d EPT_QTEXDBGI    c                   x'1124'
     d EPT_QTEXDDSH    c                   x'1125'
     d EPT_QOKNNPOP    c                   x'1126'
     d EPT_QOGCSHIN    c                   x'1127'
     d EPT_QOGCSHCL    c                   x'1128'
     d EPT_QALINEXT    c                   x'1129'
     d EPT_QSYEVTN2    c                   x'112A'
     d EPT_QSYJRNLK    c                   x'112B'
     d EPT_QINEXIT2    c                   x'112C'
     d EPT_QPMASERV    c                   x'112D'
     d EPT_QTVTNCSH    c                   x'112E'
     d EPT_QYPEENDP    c                   x'112F'
     d EPT_QOKPLCHG    c                   x'1131'
     d EPT_QUSRSTUS    c                   x'1132'
     d EPT_QUSRSTUI    c                   x'1133'
     d EPT_QDBSVRCV    c                   x'1134'
     d EPT_QFIROUTE    c                   x'1135'
     d EPT_QEZSNDM2    c                   x'1136'
     d EPT_QEZSNDM4    c                   x'1137'
     d EPT_QEZCLNMQ    c                   x'1138'
     d EPT_QTSSTRMF    c                   x'1139'
     d EPT_QTSREGFS    c                   x'113A'
     d EPT_QSQDFOPM    c                   x'113B'
     d EPT_QDBCHGNG    c                   x'113C'
     d EPT_QZSPWIPI    c                   x'113D'
     d EPT_QNXENDC     c                   x'113E'
     d EPT_QOCPINV     c                   x'113F'
     d EPT_QOCEVOKE    c                   x'1140'
     d EPT_QWVPDAGE    c                   x'1141'
     d EPT_QWVCCDLA    c                   x'1142'
     d EPT_QWVCCDAG    c                   x'1143'
     d EPT_QWVPMDAG    c                   x'1144'
     d EPT_QSQJOBTM    c                   x'1145'
     d EPT_QPMHEAP     c                   x'1146'
     d EPT_QZDACRTP    c                   x'1147'
     d EPT_QRZLBLD     c                   x'1148'
     d EPT_QRZLBLC     c                   x'1149'
     d EPT_QRZLBLST    c                   x'114A'
     d EPT_QRZLBLHW    c                   x'114B'
     d EPT_QRZLBLUP    c                   x'114C'
     d EPT_QRZLBL4I    c                   x'114D'
     d EPT_QRZLBL01    c                   x'114E'
     d EPT_QRZLBL02    c                   x'114F'
     d EPT_QRZLBL03    c                   x'1150'
     d EPT_QBNDSPSP    c                   x'1151'
     d EPT_QBNVCDSP    c                   x'1152'
     d EPT_QCLDSPVC    c                   x'1153'
     d EPT_QLPEXIT     c                   x'1154'
     d EPT_QHFIEXIT    c                   x'1155'
     d EPT_QZSPWIPO    c                   x'1156'
     d EPT_QZSPWIPR    c                   x'1157'
     d EPT_QRZMIG4     c                   x'1158'
     d EPT_QZSPWIRO    c                   x'1159'
     d EPT_QZSPWIPA    c                   x'115A'
     d EPT_QODLSTOB    c                   x'115B'
     d EPT_QODSWILL    c                   x'115C'
     d EPT_QTQMKMAP    c                   x'115D'
     d EPT_QTEXRMDD    c                   x'115E'
     d EPT_QLZACRT     c                   x'115F'
     d EPT_QLZAUPD     c                   x'1160'
     d EPT_QLZARTVI    c                   x'1161'
     d EPT_QLZAJOB     c                   x'1162'
     d EPT_QLZAIPL     c                   x'1163'
     d EPT_QLZARCOV    c                   x'1164'
     d EPT_QLZAIEXT    c                   x'1165'
     d EPT_QLZAWRK     c                   x'1166'
     d EPT_QLZAWLUO    c                   x'1167'
     d EPT_QLZADSP     c                   x'1168'
     d EPT_QLZACHG     c                   x'1169'
     d EPT_QLZAUSRX    c                   x'116A'
     d EPT_QLZAREQ     c                   x'116B'
     d EPT_QLZARLS     c                   x'116C'
     d EPT_QLZARTV     c                   x'116D'
     d EPT_QLZARHND    c                   x'116E'
     d EPT_QLEDAGE     c                   x'116F'
     d EPT_QBNVCUSP    c                   x'1170'
     d EPT_QTNMCDRI    c                   x'1171'
     d EPT_QEZCHPRF    c                   x'1172'
     d EPT_QLGPG001    c                   x'1173'
     d EPT_QLGPG002    c                   x'1174'
     d EPT_QTBDSPTB    c                   x'1175'
     d EPT_QTBPOSTO    c                   x'1176'
     d EPT_QLGPTLID    c                   x'1177'
     d EPT_QBNWRKEO    c                   x'1178'
     d EPT_QPDRSLPI    c                   x'1179'
     d EPT_QBNCHGSP    c                   x'117A'
     d EPT_QBNRTVSP    c                   x'117B'
     d EPT_QNXDMCLN    c                   x'117D'
     d EPT_QPDPAALO    c                   x'117E'
     d EPT_QPDPACDI    c                   x'117F'
     d EPT_QPDPACON    c                   x'1180'
     d EPT_QPDPACPG    c                   x'1181'
     d EPT_QPDPADEA    c                   x'1182'
     d EPT_QPDPADSP    c                   x'1183'
     d EPT_QPDPADUT    c                   x'1184'
     d EPT_QPDPAGEL    c                   x'1185'
     d EPT_QPDPAGRC    c                   x'1186'
     d EPT_QPDPAGVS    c                   x'1187'
     d EPT_QPDPAIOP    c                   x'1188'
     d EPT_QPDPAMIR    c                   x'1189'
     d EPT_QPDPAMOD    c                   x'118A'
     d EPT_QPDPAVAR    c                   x'118B'
     d EPT_QLZASAPD    c                   x'118C'
     d EPT_QLZARSPD    c                   x'118D'
     d EPT_QBNUPDPG    c                   x'118E'
     d EPT_QBNUPDSP    c                   x'118F'
     d EPT_QTEXRPLP    c                   x'1190'
     d EPT_QBNINZPP    c                   x'1191'
     d EPT_QBNADDAS    c                   x'1192'
     d EPT_QBNADDAT    c                   x'1193'
     d EPT_QBNADDWH    c                   x'1194'
     d EPT_QBNADDVR    c                   x'1195'
     d EPT_QBNADDBE    c                   x'1196'
     d EPT_QBNREGPP    c                   x'1197'
     d EPT_QBNPPCHK    c                   x'1198'
     d EPT_QBNUXTRA    c                   x'1199'
     d EPT_QTASX400    c                   x'119A'
     d EPT_QTADENS     c                   x'119B'
     d EPT_QDCCRLFX    c                   x'119C'
     d EPT_QDCCHLFX    c                   x'119D'
     d EPT_QDCCKLFX    c                   x'119E'
     d EPT_QMAORDRQ    c                   x'119F'
     d EPT_QMAORDRV    c                   x'11A0'
     d EPT_QTOTJOBS    c                   x'11A1'
     d EPT_QTOAEND     c                   x'11A2'
     d EPT_QTOAGTID    c                   x'11A3'
     d EPT_QTOASTRM    c                   x'11A4'
     d EPT_QTOATIME    c                   x'11A5'
     d EPT_QTOAUOPN    c                   x'11A6'
     d EPT_QTOAUSND    c                   x'11A7'
     d EPT_QTOAUCLS    c                   x'11A8'
     d EPT_QTOAURCV    c                   x'11A9'
     d EPT_QTOAAPIU    c                   x'11AA'
     d EPT_QTOAENDJ    c                   x'11AB'
     d EPT_QTOAABRT    c                   x'11AC'
     d EPT_QTOAAPID    c                   x'11AD'
     d EPT_QTOARCV     c                   x'11AE'
     d EPT_QTOAGHBN    c                   x'11AF'
     d EPT_QTOAISLA    c                   x'11B0'
     d EPT_QTOAQRYD    c                   x'11B1'
     d EPT_QTOAISUP    c                   x'11B2'
     d EPT_QWTMMCME    c                   x'11B3'
     d EPT_QWTMMRTE    c                   x'11B4'
     d EPT_QWTMMWSE    c                   x'11B5'
     d EPT_QWVSCDTL    c                   x'11B6'
     d EPT_QDCDSIPX    c                   x'11B7'
     d EPT_QZDASNAC    c                   x'11B8'
     d EPT_QZDRVKAC    c                   x'11B9'
     d EPT_QZDLSTAC    c                   x'11BA'
     d EPT_QWSGRID     c                   x'11BB'
     d EPT_QFVADDA     c                   x'11BC'
     d EPT_QFVCRCHG    c                   x'11BD'
     d EPT_QFVCRCRT    c                   x'11BE'
     d EPT_QFVCRIDX    c                   x'11BF'
     d EPT_QFVCRPX     c                   x'11C0'
     d EPT_QFVLSTA     c                   x'11C1'
     d EPT_QFVRMVA     c                   x'11C2'
     d EPT_QFVRTVCD    c                   x'11C3'
     d EPT_QWCIBAEQ    c                   x'11C4'
     d EPT_QWCICCWO    c                   x'11C5'
     d EPT_QWCIDSWO    c                   x'11C6'
     d EPT_QSPCADSP    c                   x'11C7'
     d EPT_QLICVTTP    c                   x'11C8'
     d EPT_QLICOBJD    c                   x'11C9'
     d EPT_QEMCFGSN    c                   x'11CA'
     d EPT_QEMCFGEX    c                   x'11CB'
     d EPT_QEMCFGIN    c                   x'11CC'
     d EPT_QEMCFGOV    c                   x'11CD'
     d EPT_QSQSAVUT    c                   x'11CE'
     d EPT_QODSWFIN    c                   x'11CF'
     d EPT_QUIFTEXT    c                   x'11D0'
     d EPT_QSQCALL     c                   x'11D1'
     d EPT_QQMGBTBL    c                   x'11D2'
     d EPT_QDDVTAPF    c                   x'11D3'
     d EPT_QDDCHOIC    c                   x'11D4'
     d EPT_QQQMKF      c                   x'11D5'
     d EPT_QTOSACC     c                   x'11D6'
     d EPT_QTOSACCV    c                   x'11D7'
     d EPT_QTOSBCL     c                   x'11D8'
     d EPT_QTOSCAT     c                   x'11D9'
     d EPT_QTOSCATP    c                   x'11DA'
     d EPT_QTOSCATV    c                   x'11DB'
     d EPT_QTOSCCMP    c                   x'11DC'
     d EPT_QTOSCFG     c                   x'11DD'
     d EPT_QTOSCFIE    c                   x'11DE'
     d EPT_QTOSCTLJ    c                   x'11DF'
     d EPT_QTOSINZF    c                   x'11E0'
     d EPT_QTOSJEVH    c                   x'11E1'
     d EPT_QTOSMAIN    c                   x'11E2'
     d EPT_QTOSPCM     c                   x'11E3'
     d EPT_QTOSPRCF    c                   x'11E4'
     d EPT_QTOSPRCM    c                   x'11E5'
     d EPT_QTOSRCM     c                   x'11E6'
     d EPT_QTOSRCVR    c                   x'11E7'
     d EPT_QTOSSEVH    c                   x'11E8'
     d EPT_QTOSSYSN    c                   x'11E9'
     d EPT_QTOSTEVH    c                   x'11EA'
     d EPT_QSQSEQCDA   c                   x'11EB'
     d EPT_QLMAICMD    c                   x'11EC'
     d EPT_QSQCVTOP    c                   x'11ED'
     d EPT_QLMCICMD    c                   x'11EE'
     d EPT_QPMMJTRM    c                   x'11EF'
     d EPT_QLMRICMD    c                   x'11F0'
     d EPT_QLMRNCMD    c                   x'11F1'
     d EPT_QLMWKVAL    c                   x'11F2'
     d EPT_QLMBLDF     c                   x'11F3'
     d EPT_QLMDSPLF    c                   x'11F4'
     d EPT_QLMDSPPF    c                   x'11F5'
     d EPT_QLMSMTHD    c                   x'11F6'
     d EPT_QL6ACQ      c                   x'11F7'
     d EPT_QL6ACQR     c                   x'11F8'
     d EPT_QL6EVSND    c                   x'11F9'
     d EPT_QL6EVRCV    c                   x'11FA'
     d EPT_QL6RCVCF    c                   x'11FB'
     d EPT_QL6RSRCV    c                   x'11FC'
     d EPT_QL6CFAIL    c                   x'11FD'
     d EPT_QL6L6ERP    c                   x'11FE'
     d EPT_QL6LRPPP    c                   x'11FF'
     d EPT_QL6RXREV    c                   x'1200'
     d EPT_QL6STMGT    c                   x'1201'
     d EPT_QL6VRYOF    c                   x'1202'
     d EPT_QL6IFRGT    c                   x'1203'
     d EPT_QL6INXDR    c                   x'1204'
     d EPT_QL6VRYON    c                   x'1205'
     d EPT_QL6ACRT     c                   x'1206'
     d EPT_QL6ATERM    c                   x'1207'
     d EPT_QL6PSH      c                   x'1208'
     d EPT_QL6RLBLP    c                   x'1209'
     d EPT_QL6ROLLB    c                   x'120A'
     d EPT_QL6ACERR    c                   x'120B'
     d EPT_QL6ACRCV    c                   x'120C'
     d EPT_QOKDLPOP    c                   x'120D'
     d EPT_QDBALTFI    c                   x'120E'
     d EPT_QTNEV1SV    c                   x'120F'
     d EPT_QWCISTSJ    c                   x'1210'
     d EPT_QWCAHNKE    c                   x'1211'
     d EPT_QSQSAVPG    c                   x'1212'
     d EPT_QDMFCLSE    c                   x'1213'
     d EPT_QDBAUERR    c                   x'1214'
     d EPT_QDBCHKLA    c                   x'1215'
     d EPT_QPZCMPTI    c                   x'1216'
     d EPT_QPZCRTPT    c                   x'1217'
     d EPT_QSPDSPPI    c                   x'1218'
     d EPT_QSPRTVPI    c                   x'1219'
     d EPT_QSPCHGPI    c                   x'121A'
     d EPT_QSPCPIPO    c                   x'121B'
     d EPT_QUSRGFIN    c                   x'121C'
     d EPT_QFVCNVNL    c                   x'121D'
     d EPT_QSQSEQRS    c                   x'121E'
     d EPT_QMHMFPOV    c                   x'121F'
     d EPT_QMHCHMSF    c                   x'1220'
     d EPT_QDCCRLWL    c                   x'1221'
     d EPT_QDCCHLWL    c                   x'1222'
     d EPT_QDCCKLWL    c                   x'1223'
     d EPT_QDCVCLWL    c                   x'1224'
     d EPT_QTAADD      c                   x'1225'
     d EPT_QTARMV      c                   x'1226'
     d EPT_QTAMNT      c                   x'1227'
     d EPT_QTADMT      c                   x'1228'
     d EPT_QTARBD      c                   x'1229'
     d EPT_QTAINFO     c                   x'122A'
     d EPT_QTADVOL     c                   x'122B'
     d EPT_QTACVOL     c                   x'122C'
     d EPT_QTAWVOL     c                   x'122D'
     d EPT_QTACRTC     c                   x'122E'
     d EPT_QTADLTC     c                   x'122F'
     d EPT_QDCPRNWS    c                   x'1231'
     d EPT_QDCACIN     c                   x'1232'
     d EPT_QSYWRKPG    c                   x'1233'
     d EPT_QSYWRKP1    c                   x'1234'
     d EPT_QDBPOSIX    c                   x'1235'
     d EPT_QZMFXLOG    c                   x'1236'
     d EPT_QTONSOCK    c                   x'1237'
     d EPT_QTOCDUPF    c                   x'1238'
     d EPT_QWPEXPRT    c                   x'1239'
     d EPT_QSQLOPEN    c                   x'123A'
     d EPT_QSQLCLSE    c                   x'123B'
     d EPT_QSQLCMIT    c                   x'123C'
     d EPT_QSQEXPLN    c                   x'123D'
     d EPT_QDBVFYCP    c                   x'123E'
     d EPT_QDBCPMGR    c                   x'123F'
     d EPT_QDBCPPAN    c                   x'1240'
     d EPT_QDBWRKCT    c                   x'1241'
     d EPT_QDBEVCP     c                   x'1242'
     d EPT_QDBDSPCP    c                   x'1243'
     d EPT_QESQRYPS    c                   x'1244'
     d EPT_QTOCCFCP    c                   x'1245'
     d EPT_QTOCAPCP    c                   x'1246'
     d EPT_QTOCAPOR    c                   x'1247'
     d EPT_QTOCRPOR    c                   x'1248'
     d EPT_QTOCARSI    c                   x'1249'
     d EPT_QTOCRRSI    c                   x'124A'
     d EPT_QTOCCATR    c                   x'124B'
     d EPT_QTOCCAP     c                   x'124C'
     d EPT_QTOCCHT     c                   x'124D'
     d EPT_QTOCMHT     c                   x'124E'
     d EPT_QTOCRNHT    c                   x'124F'
     d EPT_QTOCWPOO    c                   x'1250'
     d EPT_QTOCWRSO    c                   x'1251'
     d EPT_QTOCWRTO    c                   x'1252'
     d EPT_QOKNCKCP    c                   x'1253'
     d EPT_QZMFEXIT    c                   x'1254'
     d EPT_QWCPARB2    c                   x'1255'
     d EPT_QWCPARB3    c                   x'1256'
     d EPT_QTOCARTE    c                   x'1257'
     d EPT_QTOCRRTE    c                   x'1258'
     d EPT_QTOCCRTE    c                   x'1259'
     d EPT_QWCPARB4    c                   x'125A'
     d EPT_QTOCVRTE    c                   x'125B'
     d EPT_QTOCAIFC    c                   x'125C'
     d EPT_QTOCRIFC    c                   x'125D'
     d EPT_QTOCCIFC    c                   x'125E'
     d EPT_QTOCPIFC    c                   x'125F'
     d EPT_QTOCVIFC    c                   x'1260'
     d EPT_QTOCSIFC    c                   x'1261'
     d EPT_QTOCEIFC    c                   x'1262'
     d EPT_QTOCTCPI    c                   x'1263'
     d EPT_QTOCTCIX    c                   x'1264'
     d EPT_QTOCSTCP    c                   x'1265'
     d EPT_QWCPARB5    c                   x'1266'
     d EPT_QTOCSTIX    c                   x'1267'
     d EPT_QTOCETCP    c                   x'1268'
     d EPT_QTOCSRV     c                   x'1269'
     d EPT_QTOCDCND    c                   x'126A'
     d EPT_QTOCLDMD    c                   x'126B'
     d EPT_QTOCRNME    c                   x'126C'
     d EPT_QTOCWIFC    c                   x'126D'
     d EPT_QTOCWIFO    c                   x'126E'
     d EPT_QTOCWPOR    c                   x'126F'
     d EPT_QTOCWRSI    c                   x'1270'
     d EPT_QTOCWRTE    c                   x'1271'
     d EPT_QTONCLOS    c                   x'1272'
     d EPT_QTONQSRT    c                   x'1273'
     d EPT_QTONSNAM    c                   x'1274'
     d EPT_QTONSTAT    c                   x'1275'
     d EPT_QTONUIXD    c                   x'1276'
     d EPT_QTONUIXL    c                   x'1277'
     d EPT_QTONVLIC    c                   x'1278'
     d EPT_QWTLECEM    c                   x'1279'
     d EPT_QTVENDLN    c                   x'127A'
     d EPT_QTOCGIXP    c                   x'127B'
     d EPT_QTOICONV    c                   x'127C'
     d EPT_QSOCPIPS    c                   x'127D'
     d EPT_QSPCRQVC    c                   x'127E'
     d EPT_QSPCHQVC    c                   x'127F'
     d EPT_QUSRXPGM    c                   x'1280'
     d EPT_QSPOPNWT    c                   x'1281'
     d EPT_QTNGETCD    c                   x'1282'
     d EPT_QTNHRDEH    c                   x'1283'
     d EPT_QL6DCRCV    c                   x'1284'
     d EPT_QL6RCVSD    c                   x'1285'
     d EPT_QL6RSACQ    c                   x'1286'
     d EPT_QL6RSSND    c                   x'1287'
     d EPT_QL6RSYNC    c                   x'1288'
     d EPT_QL6XCSND    c                   x'1289'
     d EPT_QPZPTFIN    c                   x'128A'
     d EPT_QPZINSFX    c                   x'128B'
     d EPT_QDCCRNTB    c                   x'128C'
     d EPT_QDCCHNTB    c                   x'128D'
     d EPT_QDCDLNTB    c                   x'128E'
     d EPT_QDCRTNTB    c                   x'128F'
     d EPT_QDCDSNTB    c                   x'1290'
     d EPT_QDCCPNTB    c                   x'1291'
     d EPT_QDCWKNTB    c                   x'1292'
     d EPT_QDCCRNWS    c                   x'1293'
     d EPT_QDCCKNWS    c                   x'1294'
     d EPT_QDCCHNWS    c                   x'1295'
     d EPT_QDCVCNWS    c                   x'1296'
     d EPT_QDCDLNWS    c                   x'1297'
     d EPT_QDCRTNWS    c                   x'1298'
     d EPT_QDCDSNWS    c                   x'1299'
     d EPT_QDCCPNWS    c                   x'129A'
     d EPT_QDCWKNWS    c                   x'129B'
     d EPT_QDCLKSTG    c                   x'129C'
     d EPT_QPZEVNHN    c                   x'129D'
     d EPT_QDCVRNWS    c                   x'129E'
     d EPT_QDCCKFST    c                   x'129F'
     d EPT_QDCCKNTB    c                   x'12A0'
     d EPT_QDCVCNTB    c                   x'12A1'
     d EPT_QSQITBLX    c                   x'12A3'
     d EPT_QFPAWWAL    c                   x'12A4'
     d EPT_QFPACRAL    c                   x'12A5'
     d EPT_QFPACHAL    c                   x'12A6'
     d EPT_QFPAVCAL    c                   x'12A7'
     d EPT_QFPACKAL    c                   x'12A8'
     d EPT_QFPADSAL    c                   x'12A9'
     d EPT_QFPADLAL    c                   x'12AA'
     d EPT_QFPAPOAL    c                   x'12AB'
     d EPT_QFPAWWSG    c                   x'12AC'
     d EPT_QFPACRSG    c                   x'12AD'
     d EPT_QTACGYVC    c                   x'12AE'
     d EPT_QFPADSSG    c                   x'12AF'
     d EPT_QFPADLSG    c                   x'12B0'
     d EPT_QTANOTH     c                   x'12B1'
     d EPT_QTASETC     c                   x'12B2'
     d EPT_QFPAPOSG    c                   x'12B3'
     d EPT_QFPASDMS    c                   x'12B4'
     d EPT_QFPASBCM    c                   x'12B5'
     d EPT_QFPAPROF    c                   x'12B6'
     d EPT_QFPAACTV    c                   x'12B7'
     d EPT_QFPAMON     c                   x'12B8'
     d EPT_QFPASTRT    c                   x'12B9'
     d EPT_QTOVMIGP    c                   x'12BA'
     d EPT_QFPASHUT    c                   x'12BB'
     d EPT_QFPACRYP    c                   x'12BC'
     d EPT_QFPASHAR    c                   x'12BD'
     d EPT_QFPALOCK    c                   x'12BE'
     d EPT_QFPANCMD    c                   x'12BF'
     d EPT_QFPASEND    c                   x'12C0'
     d EPT_QFPDFSIZ    c                   x'12C1'
     d EPT_QFPHVRYC    c                   x'12C2'
     d EPT_QFPAWWST    c                   x'12C3'
     d EPT_QTAINEXT    c                   x'12C4'
     d EPT_QFPADSUS    c                   x'12C5'
     d EPT_QFPADSSN    c                   x'12C6'
     d EPT_QTOC4V3     c                   x'12C7'
     d EPT_QFPADSSC    c                   x'12C8'
     d EPT_QPZPRSCD    c                   x'12C9'
     d EPT_QZSPWIAO    c                   x'12CA'
     d EPT_QFPAXXX1    c                   x'12CB'
     d EPT_QFPAXXX2    c                   x'12CC'
     d EPT_QFPAXXX3    c                   x'12CD'
     d EPT_QFPAXXX4    c                   x'12CE'
     d EPT_QFPAXXX5    c                   x'12CF'
     d EPT_QZSPWLCO    c                   x'12D0'
     d EPT_QLZAADDC    c                   x'12D1'
     d EPT_QLZAALK     c                   x'12D2'
     d EPT_QLZADSPC    c                   x'12D3'
     d EPT_QLZAINST    c                   x'12D4'
     d EPT_QLZARLK     c                   x'12D5'
     d EPT_QLZARMVC    c                   x'12D6'
     d EPT_QLZAMDIR    c                   x'12D7'
     d EPT_QLZAMPGM    c                   x'12D8'
     d EPT_QZRKPROB    c                   x'12D9'
     d EPT_QACSOTP     c                   x'12DA'
     d EPT_QDBARCFR    c                   x'12DB'
     d EPT_QBNRTVAS    c                   x'12DC'
     d EPT_QESDSPSA    c                   x'12DD'
     d EPT_QESCHGSA    c                   x'12DE'
     d EPT_QESCSAPO    c                   x'12DF'
     d EPT_QESRSRVA    c                   x'12E0'
     d EPT_QESCSRVA    c                   x'12E1'
     d EPT_QESSAVMA    c                   x'12E2'
     d EPT_QMHCHGEM    c                   x'12E3'
     d EPT_QMHLJOBL    c                   x'12E4'
     d EPT_QMHLSTM     c                   x'12E5'
     d EPT_QMHPRMM     c                   x'12E6'
     d EPT_QMHRTVM     c                   x'12E7'
     d EPT_QMHRMQAT    c                   x'12E8'
     d EPT_QMHSNDBM    c                   x'12E9'
     d EPT_QMHRMFAT    c                   x'12EA'
     d EPT_QUHDSPH     c                   x'12EB'
     d EPT_QUHPRTH     c                   x'12EC'
     d EPT_QUIADDLE    c                   x'12ED'
     d EPT_QUIADDLM    c                   x'12EE'
     d EPT_QUIADDPA    c                   x'12EF'
     d EPT_QUIADDPW    c                   x'12F0'
     d EPT_QUICLOA     c                   x'12F1'
     d EPT_QUIDLTL     c                   x'12F2'
     d EPT_QUIDSPP     c                   x'12F3'
     d EPT_QUIGETLE    c                   x'12F4'
     d EPT_QUIGETLM    c                   x'12F5'
     d EPT_QUIGETV     c                   x'12F6'
     d EPT_QUIOPNDA    c                   x'12F7'
     d EPT_QUIOPNPA    c                   x'12F8'
     d EPT_QUIPRTP     c                   x'12F9'
     d EPT_QUIRMVLE    c                   x'12FA'
     d EPT_QUIRMVPA    c                   x'12FB'
     d EPT_QUIRMVPW    c                   x'12FC'
     d EPT_QUISETLA    c                   x'12FD'
     d EPT_QUISETSC    c                   x'12FE'
     d EPT_QUIUPDLE    c                   x'12FF'
     d EPT_QFPHVARY    c                   x'1300'
     d EPT_QSYCHGPR    c                   x'1301'
     d EPT_QSYCHGPW    c                   x'1302'
     d EPT_QSYCUSRA    c                   x'1303'
     d EPT_QSYCVTA     c                   x'1304'
     d EPT_QSYGETPH    c                   x'1305'
     d EPT_QSYLAUTU    c                   x'1306'
     d EPT_QSYLATLO    c                   x'1307'
     d EPT_QSYLOBJP    c                   x'1308'
     d EPT_QSYLOBJA    c                   x'1309'
     d EPT_QSYLUSRA    c                   x'130A'
     d EPT_QSYRLSPH    c                   x'130B'
     d EPT_QSYRUSRA    c                   x'130C'
     d EPT_QSYRUSRI    c                   x'130D'
     d EPT_QMHRDQM     c                   x'130E'
     d EPT_QJOSJRNE    c                   x'130F'
     d EPT_QTNRCMTI    c                   x'1310'
     d EPT_QTNADDCR    c                   x'1311'
     d EPT_QTNRMVCR    c                   x'1312'
     d EPT_QDMRTVFO    c                   x'1313'
     d EPT_QCLCPCMD    c                   x'1314'
     d EPT_QOKSCHD     c                   x'1315'
     d EPT_QOKPUDF     c                   x'1316'
     d EPT_QFPHCRSS    c                   x'1317'
     d EPT_QFPHDLSS    c                   x'1318'
     d EPT_QFPHCRTD    c                   x'1319'
     d EPT_QTQADDII    c                   x'131A'
     d EPT_QFPHDLTD    c                   x'131B'
     d EPT_QFPHALCD    c                   x'131C'
     d EPT_QFPHRTVD    c                   x'131D'
     d EPT_QFPHLSTD    c                   x'131E'
     d EPT_QPDCRTDP    c                   x'131F'
     d EPT_QFVRTVSL    c                   x'1320'
     d EPT_QEZCLNOQ    c                   x'1321'
     d EPT_QUSRJOBI    c                   x'1322'
     d EPT_QSWSVEV     c                   x'1323'
     d EPT_QSWSVFR     c                   x'1324'
     d EPT_QSWSVSUC    c                   x'1325'
     d EPT_QSWSVDEA    c                   x'1326'
     d EPT_QUSAXPGM    c                   x'1327'
     d EPT_QESAUTNF    c                   x'1328'
     d EPT_QZPAIJOB    c                   x'1329'
     d EPT_QZPAISTR    c                   x'132A'
     d EPT_QZPAIEND    c                   x'132B'
     d EPT_QZPAIXIT    c                   x'132C'
     d EPT_QP0LRPTH    c                   x'132D'
     d EPT_QSPOPNWX    c                   x'132E'
     d EPT_QSKDUMP     c                   x'132F'
     d EPT_QSYENCPW    c                   x'1330'
     d EPT_QSYRTVEP    c                   x'1331'
     d EPT_QUSRTVEI    c                   x'1332'
     d EPT_QUSRGPT     c                   x'1333'
     d EPT_QUSDRGPT    c                   x'1334'
     d EPT_QUSADDEP    c                   x'1335'
     d EPT_QUSRMVEP    c                   x'1336'
     d EPT_QTOCPRTE    c                   x'1337'
     d EPT_QOSOSCB     c                   x'1338'
     d EPT_QOSCVTEA    c                   x'1339'
     d EPT_QODCHKEY    c                   x'133A'
     d EPT_QODXRTCD    c                   x'133B'
     d EPT_QMACMPTF    c                   x'133C'
     d EPT_QDCCKSTG    c                   x'133D'
     d EPT_QDCRNWSD    c                   x'133E'
     d EPT_QDCWKCFG    c                   x'133F'
     d EPT_QUSCHGPA    c                   x'1340'
     d EPT_QUSLJOB     c                   x'1341'
     d EPT_QP0LVHDI    c                   x'1342'
     d EPT_QWCCCJOB    c                   x'1343'
     d EPT_QWCCHGTN    c                   x'1344'
     d EPT_QWCCVTDT    c                   x'1345'
     d EPT_QWCLASBS    c                   x'1346'
     d EPT_QWCLOBJL    c                   x'1347'
     d EPT_QWCLSCDE    c                   x'1348'
     d EPT_QWCRDTAA    c                   x'1349'
     d EPT_QWCRNETA    c                   x'134A'
     d EPT_QWCRSSTS    c                   x'134B'
     d EPT_QWCRSVAL    c                   x'134C'
     d EPT_QWDLSJBQ    c                   x'134D'
     d EPT_QWDRJOBD    c                   x'134E'
     d EPT_QWDRSBSD    c                   x'134F'
     d EPT_QWTSETP     c                   x'1350'
     d EPT_QTQIVOPM    c                   x'1351'
     d EPT_QLICHGLL    c                   x'1352'
     d EPT_QLIRLIBD    c                   x'1353'
     d EPT_QLIRNMO     c                   x'1354'
     d EPT_QLIRNMOG    c                   x'1355'
     d EPT_QUSLOBJ     c                   x'1356'
     d EPT_QUSROBJD    c                   x'1357'
     d EPT_QTQICVT     c                   x'1358'
     d EPT_QPDDCTL     c                   x'1359'
     d EPT_QZSPWLOC    c                   x'135A'
     d EPT_QP0ZCHGE    c                   x'135B'
     d EPT_QP0ZUPDL    c                   x'135C'
     d EPT_QSCAUTOS    c                   x'135D'
     d EPT_QDCPOLP     c                   x'135E'
     d EPT_QP0MSJML    c                   x'135F'
     d EPT_QP0MSMTX    c                   x'1360'
     d EPT_QP0MSMM     c                   x'1361'
     d EPT_QP0MSMP     c                   x'1362'
     d EPT_QSYCHKIT    c                   x'1363'
     d EPT_QRZCFG      c                   x'1364'
     d EPT_QRZCFGA     c                   x'1365'
     d EPT_QRZCFGD     c                   x'1366'
     d EPT_QRZCFGS     c                   x'1367'
     d EPT_QRZSTG3     c                   x'1368'
     d EPT_QTNTREVT    c                   x'1369'
     d EPT_QTNSLTCV    c                   x'136A'
     d EPT_QSQCKAUT    c                   x'136B'
     d EPT_QTACHOIC    c                   x'136C'
     d EPT_QTADUPVC    c                   x'136D'
     d EPT_QTAINZVC    c                   x'136E'
     d EPT_QSRSAV      c                   x'136F'
     d EPT_QSRRST      c                   x'1370'
     d EPT_QSRDSP      c                   x'1371'
     d EPT_QSRDSPEX    c                   x'1372'
     d EPT_QWDEXJQI    c                   x'1373'
     d EPT_QSREXDEV    c                   x'1374'
     d EPT_QLGTRDTA    c                   x'1375'
     d EPT_QTNENDSV    c                   x'1376'
     d EPT_QUILNGNM    c                   x'1377'
     d EPT_QSCMSTMF    c                   x'1378'
     d EPT_QP0LCSCO    c                   x'1379'
     d EPT_QP0LCWRL    c                   x'137A'
     d EPT_QP0LCDSL    c                   x'137B'
     d EPT_QP0LCIUP    c                   x'137C'
     d EPT_QP0LCDSH    c                   x'137D'
     d EPT_QP0LCDSN    c                   x'137E'
     d EPT_QP0LCUIL    c                   x'137F'
     d EPT_QP0LCUAU    c                   x'1380'
     d EPT_QP0LCCHC    c                   x'1381'
     d EPT_QP0LCPCC    c                   x'1382'
     d EPT_QP0LCDSC    c                   x'1383'
     d EPT_QP0LCRVC    c                   x'1384'
     d EPT_QP0LCCRD    c                   x'1385'
     d EPT_QP0LCRMD    c                   x'1386'
     d EPT_QP0LCCPY    c                   x'1387'
     d EPT_QP0LCMOV    c                   x'1388'
     d EPT_QP0LCRNM    c                   x'1389'
     d EPT_QP0LCADL    c                   x'138A'
     d EPT_QP0LCRML    c                   x'138B'
     d EPT_QP0LCCKI    c                   x'138C'
     d EPT_QP0LCCKO    c                   x'138D'
     d EPT_QP0LCDTS    c                   x'138E'
     d EPT_QP0LCSTD    c                   x'138F'
     d EPT_QP0LCDOA    c                   x'1390'
     d EPT_QP0LCCDA    c                   x'1391'
     d EPT_QDCPVNWS    c                   x'1392'
     d EPT_QMHJLDB     c                   x'1393'
     d EPT_QSXCGETV    c                   x'1394'
     d EPT_QTADSPC     c                   x'1395'
     d EPT_QTACMLB     c                   x'1396'
     d EPT_QTADMLB     c                   x'1397'
     d EPT_QDBCNVXR    c                   x'1398'
     d EPT_QSPCHQPO    c                   x'1399'
     d EPT_QESQRYSU    c                   x'139A'
     d EPT_QUSWRKRI    c                   x'139B'
     d EPT_QWDRSBJQ    c                   x'139C'
     d EPT_Q1PEXIT     c                   x'139D'
     d EPT_QP0FINIT    c                   x'139E'
     d EPT_QP0LMNTS    c                   x'139F'
     d EPT_QODVINIT    c                   x'13A0'
     d EPT_QPWFSTP0    c                   x'13A1'
     d EPT_QPWFSTP1    c                   x'13A2'
     d EPT_QPWFSTP2    c                   x'13A3'
     d EPT_QZDSNPIX    c                   x'13A4'
     d EPT_QZDMFCLN    c                   x'13A5'
     d EPT_QZDAGFS     c                   x'13A6'
     d EPT_QDBTRIG2    c                   x'13A7'
     d EPT_QMHCRJMQ    c                   x'13A8'
     d EPT_QSPRMTDR    c                   x'13A9'
     d EPT_QFPAADSV    c                   x'13AA'
     d EPT_QTATAPCH    c                   x'13AB'
     d EPT_QTADEVCH    c                   x'13AC'
     d EPT_QTASYSCH    c                   x'13AD'
     d EPT_QTACGYCH    c                   x'13AE'
     d EPT_QPDAUTPR    c                   x'13AF'
     d EPT_QPDAUTP2    c                   x'13B0'
     d EPT_QPDTIMER    c                   x'13B1'
     d EPT_QQQCHGA     c                   x'13B2'
     d EPT_QQQCHGAP    c                   x'13B3'
     d EPT_QPDGENSS    c                   x'13B4'
     d EPT_QTQMKMP1    c                   x'13B5'
     d EPT_QTQMKMP2    c                   x'13B6'
     d EPT_QWPZATRN    c                   x'13B7'
     d EPT_QUSRSPLA    c                   x'13B8'
     d EPT_QUSLSPL     c                   x'13B9'
     d EPT_QSPROUTQ    c                   x'13BA'
     d EPT_QSPRJOBQ    c                   x'13BB'
     d EPT_QSPOPNSP    c                   x'13BC'
     d EPT_QSPCLOSP    c                   x'13BD'
     d EPT_QSPCRTSP    c                   x'13BE'
     d EPT_QSPGETSP    c                   x'13BF'
     d EPT_QSPPUTSP    c                   x'13C0'
     d EPT_QSPMOVSP    c                   x'13C1'
     d EPT_QSPMOVJB    c                   x'13C2'
     d EPT_QZCAADDC    c                   x'13C3'
     d EPT_QZCARMVC    c                   x'13C4'
     d EPT_QZCAREFC    c                   x'13C5'
     d EPT_QZCAUPDC    c                   x'13C6'
     d EPT_QLGCNVCS    c                   x'13C7'
     d EPT_QSQCHKS     c                   x'13C8'
     d EPT_QZMFACHG    c                   x'13C9'
     d EPT_QZMFACRT    c                   x'13CA'
     d EPT_QZMFADDC    c                   x'13CB'
     d EPT_QZMFAIXT    c                   x'13CC'
     d EPT_QZMFALOG    c                   x'13CD'
     d EPT_QZMFAPG1    c                   x'13CE'
     d EPT_QZMFARSV    c                   x'13CF'
     d EPT_QZMFARTV    c                   x'13D0'
     d EPT_QZMFASCR    c                   x'13D1'
     d EPT_QZMFASQC    c                   x'13D2'
     d EPT_QZMFCATR    c                   x'13D3'
     d EPT_QZMFDLTC    c                   x'13D4'
     d EPT_QZMFLSTC    c                   x'13D5'
     d EPT_QSYCUSRS    c                   x'13D6'
     d EPT_QALGENA     c                   x'13D7'
     d EPT_QALRTVA     c                   x'13D8'
     d EPT_QALSNDA     c                   x'13D9'
     d EPT_QBNLPGMI    c                   x'13DA'
     d EPT_QBNLSPGM    c                   x'13DB'
     d EPT_QBNRSPGM    c                   x'13DC'
     d EPT_QCAPCMD     c                   x'13DD'
     d EPT_QCDRCMDI    c                   x'13DE'
     d EPT_QCLRPGAS    c                   x'13DF'
     d EPT_QCLRPGMI    c                   x'13E0'
     d EPT_QCLSPGAS    c                   x'13E1'
     d EPT_QDBCNVME    c                   x'13E2'
     d EPT_QTSSCDRA    c                   x'13E3'
     d EPT_QDBRTVFD    c                   x'13E4'
     d EPT_QUSLMBR     c                   x'13E5'
     d EPT_QUSRMBRD    c                   x'13E6'
     d EPT_QDCLCFGD    c                   x'13E7'
     d EPT_QDCRCFGS    c                   x'13E8'
     d EPT_QDCRCTLD    c                   x'13E9'
     d EPT_QDCRDEVD    c                   x'13EA'
     d EPT_QDCRLIND    c                   x'13EB'
     d EPT_QDFRTVFD    c                   x'13EC'
     d EPT_QEARMVBM    c                   x'13ED'
     d EPT_QEZLSGNU    c                   x'13EE'
     d EPT_QHFCLODR    c                   x'13EF'
     d EPT_QHFCPYSF    c                   x'13F0'
     d EPT_QHFCRTDR    c                   x'13F1'
     d EPT_QHFCTLFS    c                   x'13F2'
     d EPT_QHFFRCSF    c                   x'13F3'
     d EPT_QHFGETSZ    c                   x'13F4'
     d EPT_QHFLSTFS    c                   x'13F5'
     d EPT_QHFLULSF    c                   x'13F6'
     d EPT_QP0LRTXT    c                   x'13F7'
     d EPT_QZCATHR     c                   x'13F8'
     d EPT_QZCAEVH     c                   x'13F9'
     d EPT_QP0QUSTG    c                   x'13FA'
     d EPT_QFPAWXAL    c                   x'13FB'
     d EPT_QFPAWXST    c                   x'13FC'
     d EPT_QFPAWXSN    c                   x'13FD'
     d EPT_QFPAWXSG    c                   x'13FE'
     d EPT_QFPAWWSN    c                   x'13FF'
     d EPT_QFPAVARY    c                   x'1400'
     d EPT_QFPACHUA    c                   x'1401'
     d EPT_QPMCPFRT    c                   x'1402'
     d EPT_QQQUPDVW    c                   x'1403'
     d EPT_QSYUSREP    c                   x'1404'
     d EPT_QSZURAIR    c                   x'1405'
     d EPT_QTOCPPPJL2  c                   x'1406'
     d EPT_QTVUCLIE    c                   x'1407'
     d EPT_QRWTRESY    c                   x'1408'
     d EPT_QDBCHGTR    c                   x'1409'
     d EPT_QLIRTVLL    c                   x'140A'
     d EPT_QPQPDPDF    c                   x'140B'
     d EPT_QFPASVSC    c                   x'140C'
     d EPT_QQXCPIEX    c                   x'140D'
     d EPT_QFPASBCD    c                   x'140E'
     d EPT_QQXMAIN     c                   x'140F'
     d EPT_QTSSCDTA    c                   x'1410'
     d EPT_QTSSRDTA    c                   x'1411'
     d EPT_QTSTRDTA    c                   x'1412'
     d EPT_QTSSCDTQ    c                   x'1413'
     d EPT_QTSSSNDQ    c                   x'1414'
     d EPT_QTOCETCT    c                   x'1415'
     d EPT_QTOCWHTE    c                   x'1416'
     d EPT_QTOCWHTO    c                   x'1417'
     d EPT_QTOCVRSI    c                   x'1418'
     d EPT_QTOICLCV    c                   x'1419'
     d EPT_QTOITBLK    c                   x'141A'
     d EPT_QTOISTRG    c                   x'141B'
     d EPT_QSOCWIFC    c                   x'141C'
     d EPT_QSOCWIFO    c                   x'141D'
     d EPT_QSOCWRTE    c                   x'141E'
     d EPT_QSOCWRTO    c                   x'141F'
     d EPT_QTOIINS1    c                   x'1420'
     d EPT_QTSSRDTQ    c                   x'1421'
     d EPT_QSOCACTI    c                   x'1422'
     d EPT_QSOCALOC    c                   x'1423'
     d EPT_QSOCCITL    c                   x'1424'
     d EPT_QSOCCLTI    c                   x'1425'
     d EPT_QSOCCLOC    c                   x'1426'
     d EPT_QSOCCTOS    c                   x'1427'
     d EPT_QSOCEVTH    c                   x'1428'
     d EPT_QSOCPLOC    c                   x'1429'
     d EPT_QSOCPTOS    c                   x'142A'
     d EPT_QSOCRLOC    c                   x'142B'
     d EPT_QSOCSIFC    c                   x'142C'
     d EPT_QSRSVAUT    c                   x'142D'
     d EPT_QSRRSAUT    c                   x'142E'
     d EPT_QMAWODBF    c                   x'142F'
     d EPT_QMASNDRQ    c                   x'1430'
     d EPT_QMARCVRQ    c                   x'1431'
     d EPT_QMABLDWO    c                   x'1432'
     d EPT_QMAPRSWO    c                   x'1433'
     d EPT_QTSTRDTQ    c                   x'1434'
     d EPT_QMAWRKOR    c                   x'1435'
     d EPT_QMACNTIN    c                   x'1436'
     d EPT_QSQHSTLX    c                   x'1437'
     d EPT_QRZCSA      c                   x'1438'
     d EPT_QRZDCSA     c                   x'1439'
     d EPT_QTOSGCDB    c                   x'143A'
     d EPT_QTOSJRNL    c                   x'143B'
     d EPT_QP0LFSD     c                   x'143C'
     d EPT_QP0FSYPF    c                   x'143D'
     d EPT_QP0FRCSD    c                   x'143E'
     d EPT_QP0FRCSU    c                   x'143F'
     d EPT_QP0FRCLM    c                   x'1440'
     d EPT_QP0FFSWK    c                   x'1441'
     d EPT_QP0DROOT    c                   x'1442'
     d EPT_QP0DIPLR    c                   x'1443'
     d EPT_QP0DDSRC    c                   x'1444'
     d EPT_QP0DRCLM    c                   x'1445'
     d EPT_QP0DDJIC    c                   x'1446'
     d EPT_QODDUMP2    c                   x'1447'
     d EPT_QEDLNGV     c                   x'1448'
     d EPT_QJOJRNIM    c                   x'1449'
     d EPT_QPQCXDRV    c                   x'144A'
     d EPT_QTSSCLRQ    c                   x'144B'
     d EPT_QODCRTLB    c                   x'144C'
     d EPT_QSPSNDWM    c                   x'144D'
     d EPT_QTEDBINT    c                   x'144E'
     d EPT_QTEXADRV    c                   x'144F'
     d EPT_QTEXAWCB    c                   x'1450'
     d EPT_QTEXCRTS    c                   x'1451'
     d EPT_QTEXCRTV    c                   x'1452'
     d EPT_QTEXCWCB    c                   x'1453'
     d EPT_QTEXDESS    c                   x'1454'
     d EPT_QTEXDSTD    c                   x'1455'
     d EPT_QTEXDWCB    c                   x'1456'
     d EPT_QTEXFMOD    c                   x'1457'
     d EPT_QTEXLPDD    c                   x'1458'
     d EPT_QTEXMMFD    c                   x'1459'
     d EPT_QTEXPPFD    c                   x'145A'
     d EPT_QTEXRMVP    c                   x'145B'
     d EPT_QTEXRTSP    c                   x'145C'
     d EPT_QTEXSTOV    c                   x'145D'
     d EPT_QTEXUTIL    c                   x'145E'
     d EPT_QTEXVWIN    c                   x'145F'
     d EPT_QWPOPNCMD   c                   x'1460'
     d EPT_QSOCFGIP    c                   x'1461'
     d EPT_QSOCIP03    c                   x'1462'
     d EPT_QSOCIP04    c                   x'1463'
     d EPT_QFPDDELF    c                   x'1464'
     d EPT_QFPDGETF    c                   x'1465'
     d EPT_QODMKDMG    c                   x'1466'
     d EPT_QFPDPUTF    c                   x'1467'
     d EPT_QFPDRNMF    c                   x'1468'
     d EPT_QFPDRSIZ    c                   x'1469'
     d EPT_QFPDSIZE    c                   x'146A'
     d EPT_QTQINDX1    c                   x'146B'
     d EPT_QTQINDX2    c                   x'146C'
     d EPT_QTQMAPS     c                   x'146D'
     d EPT_QTQMAPS2    c                   x'146E'
     d EPT_QTQRECOV    c                   x'146F'
     d EPT_QTQSETUP    c                   x'1470'
     d EPT_QZMFBEIX    c                   x'1471'
     d EPT_QZMFBIGE    c                   x'1472'
     d EPT_QZMFCOPN    c                   x'1473'
     d EPT_QTQMKMP3    c                   x'1474'
     d EPT_QZMFEEND    c                   x'1475'
     d EPT_QZMFESIX    c                   x'1476'
     d EPT_QZMFTINT    c                   x'1477'
     d EPT_QZMFTIXT    c                   x'1478'
     d EPT_QZMFXCLN    c                   x'1479'
     d EPT_QZMFXFNQ    c                   x'147A'
     d EPT_QZMFXFNX    c                   x'147B'
     d EPT_QZMFXGSQ    c                   x'147C'
     d EPT_QZMFXIPL    c                   x'147D'
     d EPT_QZMFXIXT    c                   x'147E'
     d EPT_QZMFXKQ     c                   x'147F'
     d EPT_QZMFXNDQ    c                   x'1480'
     d EPT_QZMFXPG2    c                   x'1481'
     d EPT_QZMFXPG3    c                   x'1482'
     d EPT_QZMFXPG4    c                   x'1483'
     d EPT_QZMFXPG5    c                   x'1484'
     d EPT_QZMFXPIN    c                   x'1485'
     d EPT_QZMFXQIN    c                   x'1486'
     d EPT_QZMFXRCL    c                   x'1487'
     d EPT_QZMFXSPF    c                   x'1488'
     d EPT_QZMFXSPM    c                   x'1489'
     d EPT_QZMFXSPX    c                   x'148A'
     d EPT_QZMFXSXT    c                   x'148B'
     d EPT_QWPLANDR    c                   x'148C'
     d EPT_QZMFESTR    c                   x'148D'
     d EPT_QZMFXPG1    c                   x'148E'
     d EPT_QTQGETCC    c                   x'148F'
     d EPT_QP0QINIT    c                   x'1490'
     d EPT_QP0WKRNL    c                   x'1491'
     d EPT_QWCSVRJR    c                   x'1492'
     d EPT_QSYCHAUD    c                   x'1493'
     d EPT_QSYCHAUT    c                   x'1494'
     d EPT_QSYCHOWN    c                   x'1495'
     d EPT_QSYDSPAU    c                   x'1496'
     d EPT_QSYWRKAU    c                   x'1497'
     d EPT_QODTRACE    c                   x'1498'
     d EPT_QTAIXMGR    c                   x'1499'
     d EPT_QTAMLD      c                   x'149A'
     d EPT_QESPRCAU    c                   x'149B'
     d EPT_QESANOTE    c                   x'149C'
     d EPT_QTAEXIT1    c                   x'149D'
     d EPT_QP0ZWRKE    c                   x'149E'
     d EPT_QODLMRVY    c                   x'149F'
     d EPT_QTALVMGR    c                   x'14A0'
     d EPT_QZXAEWLM    c                   x'14A1'
     d EPT_QZXCEWLO    c                   x'14A2'
     d EPT_QZXCEWLM    c                   x'14A3'
     d EPT_QZXDEWLM    c                   x'14A4'
     d EPT_QBNRTVBS    c                   x'14A5'
     d EPT_QZXAEWCM    c                   x'14A6'
     d EPT_QZXCEWCO    c                   x'14A7'
     d EPT_QZXCEWCM    c                   x'14A8'
     d EPT_QZXDEWCM    c                   x'14A9'
     d EPT_QZXAPTCE    c                   x'14AA'
     d EPT_QZXCPTCE    c                   x'14AB'
     d EPT_QZXDPTCE    c                   x'14AC'
     d EPT_QZXRPTCE    c                   x'14AD'
     d EPT_QZXABCDE    c                   x'14AE'
     d EPT_QZXCBCDO    c                   x'14AF'
     d EPT_QZXCBCDE    c                   x'14B0'
     d EPT_QZXDBCDE    c                   x'14B1'
     d EPT_QZXRBCDE    c                   x'14B2'
     d EPT_QZXCHKEWL   c                   x'14B3'
     d EPT_QZXCHKPTC   c                   x'14B4'
     d EPT_QZXCINZ     c                   x'14B5'
     d EPT_QZDCRMSG    c                   x'14B6'
     d EPT_QLZAMACP    c                   x'14B7'
     d EPT_QTNECCID    c                   x'14B8'
     d EPT_QTNHRD      c                   x'14B9'
     d EPT_QTNCNLRS    c                   x'14BA'
     d EPT_QDBXREFM    c                   x'14BB'
     d EPT_QRZCFGE     c                   x'14BC'
     d EPT_QHSSGENS    c                   x'14BD'
     d EPT_QBNUAAT     c                   x'14BE'
     d EPT_QYYCCLOS    c                   x'14BF'
     d EPT_QYYCGETS    c                   x'14C0'
     d EPT_QRCCLNUP    c                   x'14C1'
     d EPT_QYYCGETM    c                   x'14C2'
     d EPT_QYYCPUT     c                   x'14C3'
     d EPT_QYYCPUTM    c                   x'14C4'
     d EPT_QYYCPUTD    c                   x'14C5'
     d EPT_QYYCFEOD    c                   x'14C6'
     d EPT_QYYCUDR     c                   x'14C7'
     d EPT_QNPSXPFD    c                   x'14C8'
     d EPT_QHFMOVSF    c                   x'14C9'
     d EPT_QHFOPNDR    c                   x'14CA'
     d EPT_QHFRDDR     c                   x'14CB'
     d EPT_QHFRGFS     c                   x'14CC'
     d EPT_QHFRNMDR    c                   x'14CD'
     d EPT_QHFRNMSF    c                   x'14CE'
     d EPT_QHFSETSZ    c                   x'14CF'
     d EPT_QLGRTVLI    c                   x'14D0'
     d EPT_QLGSCNMX    c                   x'14D1'
     d EPT_QLGSORT     c                   x'14D2'
     d EPT_QLGSRTIO    c                   x'14D3'
     d EPT_QLPLPRDS    c                   x'14D4'
     d EPT_QLZAADDK    c                   x'14D5'
     d EPT_QLZADDLI    c                   x'14D6'
     d EPT_QLZARTVK    c                   x'14D7'
     d EPT_QMHSNDSM    c                   x'14D8'
     d EPT_QNMCHGMN    c                   x'14D9'
     d EPT_QNMDRGAP    c                   x'14DA'
     d EPT_QNMDRGFN    c                   x'14DB'
     d EPT_QBNLMODI    c                   x'14DC'
     d EPT_QNMDRGTI    c                   x'14DD'
     d EPT_QNMENDAP    c                   x'14DE'
     d EPT_QNMRCVDT    c                   x'14DF'
     d EPT_QNMRCVOC    c                   x'14E0'
     d EPT_QNMREGAP    c                   x'14E1'
     d EPT_QNMRGFN     c                   x'14E2'
     d EPT_QNMRGTI     c                   x'14E3'
     d EPT_QNMRRGF     c                   x'14E4'
     d EPT_QNMRTVMN    c                   x'14E5'
     d EPT_QNMSNDER    c                   x'14E6'
     d EPT_QNMSNDRP    c                   x'14E7'
     d EPT_QNMSNDRQ    c                   x'14E8'
     d EPT_QNMSTRAP    c                   x'14E9'
     d EPT_QOGCHGOE    c                   x'14EA'
     d EPT_QOGRTVOE    c                   x'14EB'
     d EPT_QOKDSPX4    c                   x'14EC'
     d EPT_QPMLPFRD    c                   x'14ED'
     d EPT_QPMWKCOL    c                   x'14EE'
     d EPT_QPRCRTPG    c                   x'14EF'
     d EPT_QPZCRTFX    c                   x'14F0'
     d EPT_QPZGENNM    c                   x'14F1'
     d EPT_QPZLOGFX    c                   x'14F2'
     d EPT_QQQQRY      c                   x'14F3'
     d EPT_QSPRWTRI    c                   x'14F4'
     d EPT_QSQPRCED    c                   x'14F5'
     d EPT_QSRLSAVF    c                   x'14F6'
     d EPT_QSZCRTPD    c                   x'14F7'
     d EPT_QSZCRTPL    c                   x'14F8'
     d EPT_QSZDLTPD    c                   x'14F9'
     d EPT_QSZDLTPL    c                   x'14FA'
     d EPT_QSZPKGPO    c                   x'14FB'
     d EPT_QSZRTVPR    c                   x'14FC'
     d EPT_QSZSLTPR    c                   x'14FD'
     d EPT_QTERTVPV    c                   x'14FE'
     d EPT_QTNCHGCO    c                   x'14FF'
     d EPT_QTNRBRQD    c                   x'1500'
     d EPT_QTVCLOVT    c                   x'1501'
     d EPT_QTVOPNVT    c                   x'1502'
     d EPT_QTVRDVT     c                   x'1503'
     d EPT_QTVSNDRQ    c                   x'1504'
     d EPT_QTVWRTVT    c                   x'1505'
     d EPT_QTWAIDSP    c                   x'1506'
     d EPT_QBNRMODI    c                   x'1507'
     d EPT_QTWCHKSP    c                   x'1508'
     d EPT_QUIPUTV     c                   x'1509'
     d EPT_QUIRTVLA    c                   x'150A'
     d EPT_QUSADDUI    c                   x'150B'
     d EPT_QUSCHGUS    c                   x'150C'
     d EPT_QUSCRTUI    c                   x'150D'
     d EPT_QUSCRTUQ    c                   x'150E'
     d EPT_QUSCRTUS    c                   x'150F'
     d EPT_QUSCUSAT    c                   x'1510'
     d EPT_QUSDLTUI    c                   x'1511'
     d EPT_QUSDLTUQ    c                   x'1512'
     d EPT_QUSDLTUS    c                   x'1513'
     d EPT_QUSPTRUS    c                   x'1514'
     d EPT_QUSRMVUI    c                   x'1515'
     d EPT_QUSRTVUI    c                   x'1516'
     d EPT_QUSRTVUS    c                   x'1517'
     d EPT_QUSRUIAT    c                   x'1518'
     d EPT_QUSRUSAT    c                   x'1519'
     d EPT_QVTRMSTG    c                   x'151A'
     d EPT_QDBLDBR     c                   x'151B'
     d EPT_QUSLFLD     c                   x'151C'
     d EPT_QUSLRCD     c                   x'151D'
     d EPT_QWPZTAFP    c                   x'151E'
     d EPT_QWTCTLTR    c                   x'151F'
     d EPT_QWTDMPFR    c                   x'1520'
     d EPT_QWTDMPLF    c                   x'1521'
     d EPT_QWTSETLF    c                   x'1522'
     d EPT_QWTSETTR    c                   x'1523'
     d EPT_QEZAST      c                   x'1524'
     d EPT_QEZBCHJB    c                   x'1525'
     d EPT_QEZMSG      c                   x'1526'
     d EPT_QEZOUTPT    c                   x'1527'
     d EPT_QLRCHGCM    c                   x'1528'
     d EPT_QLRRTVCE    c                   x'1529'
     d EPT_QLRSETCE    c                   x'152A'
     d EPT_QLZAGENK    c                   x'152B'
     d EPT_QMHCTLJL    c                   x'152C'
     d EPT_QMARQSOA    c                   x'152D'
     d EPT_QHFDRGFS    c                   x'152E'
     d EPT_QJORJIDI    c                   x'152F'
     d EPT_QTQCVRT     c                   x'1530'
     d EPT_QTQGCCN     c                   x'1531'
     d EPT_QTQGESP     c                   x'1532'
     d EPT_QTQGRDC     c                   x'1533'
     d EPT_QTQSCSP     c                   x'1534'
     d EPT_QPZRTVFX    c                   x'1535'
     d EPT_QZMFAQRY    c                   x'1536'
     d EPT_QHFDLTDR    c                   x'1537'
     d EPT_QWPZHPTR    c                   x'1538'
     d EPT_QSPCHGOQ    c                   x'1539'
     d EPT_QSPBSEPP    c                   x'153A'
     d EPT_QSPBOPNC    c                   x'153B'
     d EPT_QDCCCFGD    c                   x'153C'
     d EPT_QGSLRSC     c                   x'153D'
     d EPT_QGSCPYRS    c                   x'153E'
     d EPT_QLPCDINF    c                   x'153F'
     d EPT_QLPCDRST    c                   x'1540'
     d EPT_QLGRTVLC    c                   x'1541'
     d EPT_QRZCRTH     c                   x'1542'
     d EPT_QTQSMXC     c                   x'1543'
     d EPT_QTQGCTL     c                   x'1544'
     d EPT_QRZDLTE     c                   x'1545'
     d EPT_QRZCHGE     c                   x'1546'
     d EPT_QRZDLTH     c                   x'1547'
     d EPT_QRZRRCA     c                   x'1548'
     d EPT_QZDCRFSO    c                   x'1549'
     d EPT_QZDWTFSO    c                   x'154A'
     d EPT_QZDRDFSO    c                   x'154B'
     d EPT_QZDASNID    c                   x'154C'
     d EPT_QZDRVKID    c                   x'154D'
     d EPT_QZDLSTID    c                   x'154E'
     d EPT_QZDRTVID    c                   x'154F'
     d EPT_QLPISLNG    c                   x'1550'
     d EPT_QWSRTVOI    c                   x'1551'
     d EPT_QRZRRSI     c                   x'1552'
     d EPT_QRZRTVR     c                   x'1553'
     d EPT_QRZSCHE     c                   x'1554'
     d EPT_QDCALCLB    c                   x'1555'
     d EPT_QDCWKMLB    c                   x'1556'
     d EPT_QDCCHCIO    c                   x'1557'
     d EPT_QDCCHDIO    c                   x'1558'
     d EPT_QDCCRCIO    c                   x'1559'
     d EPT_QDCCRDIO    c                   x'155A'
     d EPT_QDCPOCIO    c                   x'155B'
     d EPT_QDCPODIO    c                   x'155C'
     d EPT_QDCPVIOD    c                   x'155D'
     d EPT_QDCVCCIO    c                   x'155E'
     d EPT_QDCVCDIO    c                   x'155F'
     d EPT_QRECKOVR    c                   x'1560'
     d EPT_QREPMSGS    c                   x'1561'
     d EPT_QREQSRNK    c                   x'1562'
     d EPT_QAETRACE    c                   x'1563'
     d EPT_QRESXCAL    c                   x'1564'
     d EPT_QAEUDLT     c                   x'1565'
     d EPT_QREXCMD     c                   x'1566'
     d EPT_QREXFPGM    c                   x'1567'
     d EPT_QREXINTZ    c                   x'1568'
     d EPT_QREXMETA    c                   x'1569'
     d EPT_QREXTOD     c                   x'156A'
     d EPT_QREXUNIN    c                   x'156B'
     d EPT_QWTPCPUT    c                   x'156C'
     d EPT_QWTPCGET    c                   x'156D'
     d EPT_QWTMCAT2    c                   x'156E'
     d EPT_QLPWRKUS    c                   x'156F'
     d EPT_QLPTAPSZ    c                   x'1570'
     d EPT_QMOBKMGR    c                   x'1571'
     d EPT_QMOCADDS    c                   x'1572'
     d EPT_QMOCADDV    c                   x'1573'
     d EPT_QMOCCHGV    c                   x'1574'
     d EPT_QMOCCHLD    c                   x'1575'
     d EPT_QMOCCPOP    c                   x'1576'
     d EPT_QMOCCPYF    c                   x'1577'
     d EPT_QMOCCPYP    c                   x'1578'
     d EPT_QMOCCRTP    c                   x'1579'
     d EPT_QOKDPT      c                   x'157A'
     d EPT_QMOCCVT     c                   x'157B'
     d EPT_QMOCDBKD    c                   x'157D'
     d EPT_QMOCDBKF    c                   x'157E'
     d EPT_QMOCDLCD    c                   x'157F'
     d EPT_QMOCDLTF    c                   x'1580'
     d EPT_QMOCDLTP    c                   x'1581'
     d EPT_QMOCDSPA    c                   x'1582'
     d EPT_QMOCDSPF    c                   x'1583'
     d EPT_QMOCDSPL    c                   x'1584'
     d EPT_QMOCDSPO    c                   x'1585'
     d EPT_QMOCDSPP    c                   x'1586'
     d EPT_QMOCDSPS    c                   x'1587'
     d EPT_QMOCRNMO    c                   x'1588'
     d EPT_QMOCDSPV    c                   x'1589'
     d EPT_QMOCDUPO    c                   x'158A'
     d EPT_QMOCFRMB    c                   x'158B'
     d EPT_QMOCGETF    c                   x'158C'
     d EPT_QMOCHGE     c                   x'158D'
     d EPT_QMOCINIT    c                   x'158E'
     d EPT_QMOCIPOP    c                   x'158F'
     d EPT_QMOCLIST    c                   x'1590'
     d EPT_QMOCLOSE    c                   x'1591'
     d EPT_QMOCPRCD    c                   x'1592'
     d EPT_QMOCRHF     c                   x'1593'
     d EPT_QMOCRIDX    c                   x'1594'
     d EPT_QMOCRMVS    c                   x'1595'
     d EPT_QMOCRMVV    c                   x'1596'
     d EPT_QMOCRNMF    c                   x'1597'
     d EPT_QMOCSHF     c                   x'1598'
     d EPT_QMOCTOB     c                   x'1599'
     d EPT_QMOCVPOP    c                   x'159A'
     d EPT_QMOCWBKD    c                   x'159B'
     d EPT_QMOCWBKF    c                   x'159C'
     d EPT_QMOCWRKF    c                   x'159D'
     d EPT_QMOCWRKO    c                   x'159E'
     d EPT_QMOCWRKP    c                   x'159F'
     d EPT_QMOCWRKV    c                   x'15A0'
     d EPT_QMODBOPN    c                   x'15A1'
     d EPT_QMODIREC    c                   x'15A2'
     d EPT_QMODMAIN    c                   x'15A3'
     d EPT_QMODRMGR    c                   x'15A4'
     d EPT_QMOEVHDL    c                   x'15A5'
     d EPT_QMOFEOV     c                   x'15A6'
     d EPT_QMOFLMGR    c                   x'15A7'
     d EPT_QMOFMTR     c                   x'15A8'
     d EPT_QMOFSCPY    c                   x'15A9'
     d EPT_QMOINITO    c                   x'15AA'
     d EPT_QMOINITP    c                   x'15AB'
     d EPT_QMOINMIG    c                   x'15AC'
     d EPT_QMOINUSE    c                   x'15AD'
     d EPT_QMOIXMGR    c                   x'15AE'
     d EPT_QMOIXREC    c                   x'15AF'
     d EPT_QMOLAN      c                   x'15B0'
     d EPT_QMOLKMGR    c                   x'15B1'
     d EPT_QMOLVMGR    c                   x'15B2'
     d EPT_QMOMGOVR    c                   x'15B3'
     d EPT_QMOOPEN     c                   x'15B4'
     d EPT_QMORCVSP    c                   x'15B5'
     d EPT_QMOREGFS    c                   x'15B6'
     d EPT_QMOREQIO    c                   x'15B7'
     d EPT_QMOSAMGR    c                   x'15B8'
     d EPT_QMOTERMP    c                   x'15B9'
     d EPT_QMAEXTCT    c                   x'15BA'
     d EPT_QDMDSPOF    c                   x'15BB'
     d EPT_QAEUMM      c                   x'15BC'
     d EPT_QAEUM124    c                   x'15BD'
     d EPT_QAEUTST     c                   x'15BE'
     d EPT_QAEUWWE     c                   x'15BF'
     d EPT_QAGC10      c                   x'15C0'
     d EPT_QAGC11      c                   x'15C1'
     d EPT_QAGG10      c                   x'15C2'
     d EPT_QAGG11      c                   x'15C3'
     d EPT_QSQPROC     c                   x'15C4'
     d EPT_QREXXX      c                   x'15C5'
     d EPT_QRECALVP    c                   x'15C6'
     d EPT_QRECALLQ    c                   x'15C7'
     d EPT_QQQSTRDM    c                   x'15C8'
     d EPT_QQQENDDM    c                   x'15C9'
     d EPT_QWCJLEND    c                   x'15CA'
     d EPT_QWCJLSTR    c                   x'15CB'
     d EPT_QWCJLSVR    c                   x'15CC'
     d EPT_QCSTCRACPP  c                   x'15CD'
     d EPT_QLGSJATR    c                   x'15CE'
     d EPT_QP0SDJSM    c                   x'15CF'
     d EPT_QP0SWJSM    c                   x'15D0'
     d EPT_QP0SRJSM    c                   x'15D1'
     d EPT_QP0SWSMN    c                   x'15D2'
     d EPT_QLIPGM11    c                   x'15D3'
     d EPT_QLIPGM12    c                   x'15D4'
     d EPT_QLIPGM13    c                   x'15D5'
     d EPT_QLIPGM14    c                   x'15D6'
     d EPT_QLIPGM15    c                   x'15D7'
     d EPT_QODCDNCP    c                   x'15D8'
     d EPT_QSQEVENT    c                   x'15D9'
     d EPT_QWTATNAD    c                   x'15DA'
     d EPT_QJORCVJE    c                   x'15DB'
     d EPT_QMOCCHKO    c                   x'15DC'
     d EPT_QZSPVCRT    c                   x'15DD'
     d EPT_QZSPVCSR    c                   x'15DE'
     d EPT_QZNFBIOD    c                   x'15DF'
     d EPT_QZNFMNTD    c                   x'15E0'
     d EPT_QZNFNFSD    c                   x'15E1'
     d EPT_QZNFNLMD    c                   x'15E2'
     d EPT_QZNFNSMD    c                   x'15E3'
     d EPT_QZNFRPCD    c                   x'15E4'
     d EPT_QTORCFCP    c                   x'15E5'
     d EPT_QTORCRTM    c                   x'15E6'
     d EPT_QTORRTDC    c                   x'15E7'
     d EPT_QTORRTDP    c                   x'15E8'
     d EPT_QTORWCFM    c                   x'15E9'
     d EPT_QTORWCFO    c                   x'15EA'
     d EPT_QWCAHNIM    c                   x'15EB'
     d EPT_QWCIBWIX    c                   x'15EC'
     d EPT_QDCCKLBS    c                   x'15ED'
     d EPT_QDBRGPFL    c                   x'15EE'
     d EPT_QIMGCFCP    c                   x'15EF'
     d EPT_QIMGCFVC    c                   x'15F0'
     d EPT_QLPDLPP     c                   x'15F1'
     d EPT_QLPDTLP     c                   x'15F2'
     d EPT_QLPLPPM     c                   x'15F3'
     d EPT_QLPLPPO     c                   x'15F4'
     d EPT_QLPNTFND    c                   x'15F5'
     d EPT_QLPPREP     c                   x'15F6'
     d EPT_QLPVRYDV    c                   x'15F7'
     d EPT_QLPWSFW     c                   x'15F8'
     d EPT_QODRCFID    c                   x'15F9'
     d EPT_QSPPVDLP    c                   x'15FA'
     d EPT_QSPVCDLP    c                   x'15FB'
     d EPT_QSRRATBL    c                   x'15FC'
     d EPT_QQXPLMII    c                   x'15FD'
     d EPT_QFPAXXX6    c                   x'15FE'
     d EPT_QFPAXXX7    c                   x'15FF'
     d EPT_QFPAXXX8    c                   x'1600'
     d EPT_QFPAXXX9    c                   x'1601'
     d EPT_QFPAXX10    c                   x'1602'
     d EPT_QFPAXX11    c                   x'1603'
     d EPT_QFPAXX12    c                   x'1604'
     d EPT_QFPAXX13    c                   x'1605'
     d EPT_QFPAXX14    c                   x'1606'
     d EPT_QFPAXX15    c                   x'1607'
     d EPT_QFPHXXX1    c                   x'1608'
     d EPT_QFPHXXX2    c                   x'1609'
     d EPT_QPMDDPS     c                   x'160A'
     d EPT_QLICLNUA    c                   x'160B'
     d EPT_QLIRCLLI    c                   x'160C'
     d EPT_QMASYSIN    c                   x'160E'
     d EPT_QCSTDTACPP  c                   x'160F'
     d EPT_QCSTENDR    c                   x'1610'
     d EPT_QP0FRCS2    c                   x'1611'
     d EPT_QSPFNWDR    c                   x'1612'
     d EPT_QESMEDPG    c                   x'1613'
     d EPT_QFPHXXX3    c                   x'1614'
     d EPT_QPADEVR     c                   x'1615'
     d EPT_QPADEVS     c                   x'1616'
     d EPT_QCLIEXIT    c                   x'1617'
     d EPT_QP0DCFID    c                   x'1618'
     d EPT_QP0DRCFD    c                   x'1619'
     d EPT_QP0DRCLT    c                   x'161A'
     d EPT_QP0ZENPO    c                   x'161B'
     d EPT_QCNSCMDD    c                   x'161C'
     d EPT_QFPAMONB    c                   x'161D'
     d EPT_QFPAMONN    c                   x'161E'
     d EPT_QFPARSET    c                   x'161F'
     d EPT_QFPASRSU    c                   x'1620'
     d EPT_QFPASSVL    c                   x'1621'
     d EPT_QPAITRMP    c                   x'1622'
     d EPT_QFPAVRYN    c                   x'1623'
     d EPT_QDBGETDRQO  c                   x'1624'
     d EPT_QDBGETMQO   c                   x'1625'
     d EPT_QLICRDBF    c                   x'1626'
     d EPT_QOKADDDP    c                   x'1627'
     d EPT_QOKCHGDP    c                   x'1628'
     d EPT_QOKRMVDP    c                   x'1629'
     /* Display Long Text (QUILNGTX) API */
     d EPT_QUILNGTX    c                   x'162A'
     d EPT_QTALCTG     c                   x'162B'
     d EPT_QTAPIPE     c                   x'162C'
     d EPT_QTARDCAP    c                   x'162D'
     d EPT_QDBRTVSN    c                   x'162E'
     d EPT_QEZCHBKL    c                   x'162F'
     d EPT_QEZCHBKS    c                   x'1630'
     d EPT_QEZRTBKD    c                   x'1631'
     d EPT_QEZRTBKH    c                   x'1632'
     d EPT_QEZRTBKO    c                   x'1633'
     d EPT_QEZRTBKS    c                   x'1634'
     d EPT_QSYRAUTU    c                   x'1635'
     d EPT_QSZCHKTG    c                   x'1636'
     d EPT_QWDLSBSE    c                   x'1637'
     d EPT_QWTRTVPX    c                   x'1638'
     d EPT_QWTSETPX    c                   x'1639'
     d EPT_QGYRHRI     c                   x'163A'
     d EPT_QGYRHRL     c                   x'163B'
     d EPT_QWCRJBST    c                   x'163C'
     d EPT_QSYCHGID    c                   x'163D'
     d EPT_QSYRTVUA    c                   x'163E'
     d EPT_QSYCHGDS    c                   x'163F'
     d EPT_QTADMPDV    c                   x'1640'
     d EPT_QTARDINF    c                   x'1641'
     d EPT_QTQRCSC     c                   x'1642'
     d EPT_QLGRLNGI    c                   x'1643'
     d EPT_QTQSMXC2    c                   x'1644'
     d EPT_QSYRTVSE    c                   x'1645'
     d EPT_QWTCHGJB    c                   x'1646'
     d EPT_QIMGCVTI    c                   x'1647'
     d EPT_QSYADVLE    c                   x'1648'
     d EPT_QSYCHVLE    c                   x'1649'
     d EPT_QSYFDVLE    c                   x'164A'
     d EPT_QSYRMVLE    c                   x'164B'
     d EPT_QWCRIPLA    c                   x'164C'
     d EPT_QWCRTVCA    c                   x'164D'
     d EPT_QZLSADFS    c                   x'164E'
     d EPT_QZLSADPS    c                   x'164F'
     d EPT_QZLSCHFS    c                   x'1650'
     d EPT_QZLSCHPS    c                   x'1651'
     d EPT_QZLSCHSG    c                   x'1652'
     d EPT_QZLSCHSI    c                   x'1653'
     d EPT_QZLSCHSN    c                   x'1654'
     d EPT_QZLSENDS    c                   x'1655'
     d EPT_QZLSENSS    c                   x'1656'
     d EPT_QZLSLSTI    c                   x'1657'
     d EPT_QZLSRMS     c                   x'1658'
     d EPT_QZLSSTRS    c                   x'1659'
     d EPT_QZLSOLST    c                   x'165A'
     d EPT_QSYRUPWD    c                   x'165B'
     d EPT_QSYSUPWD    c                   x'165C'
     d EPT_QZNFRTVE    c                   x'165D'
     d EPT_QSYADDUC    c                   x'165E'
     d EPT_QSYADDVC    c                   x'165F'
     d EPT_QSYCHKVC    c                   x'1660'
     d EPT_QSYFNDCU    c                   x'1661'
     d EPT_QSYLSTUC    c                   x'1662'
     d EPT_QSYLSTVC    c                   x'1663'
     d EPT_QSYPARSC    c                   x'1664'
     d EPT_QSYRMVUC    c                   x'1665'
     d EPT_QSYRMVVC    c                   x'1666'
     d EPT_QWTDTJBS    c                   x'1667'
     d EPT_QLZAELKE    c                   x'1668'
     d EPT_QP0LFLOP    c                   x'1669'
     d EPT_QQQCSDBM    c                   x'166A'
     d EPT_QQQDSDBM    c                   x'166B'
     d EPT_QQQESDBM    c                   x'166C'
     d EPT_QQQCOORD    c                   x'166D'
     d EPT_QQQPDCMP    c                   x'166E'
     d EPT_QQQPDOPT    c                   x'166F'
     d EPT_QQQPDQRY    c                   x'1670'
     d EPT_QQQTEMP1    c                   x'1671'
     d EPT_QQQTEMP2    c                   x'1672'
     d EPT_QDBXREF2    c                   x'1673'
     d EPT_QSQINODL    c                   x'1674'
     d EPT_QTSPCLOS    c                   x'1675'
     d EPT_QTSPFEOD    c                   x'1676'
     d EPT_QTSPGETK    c                   x'1677'
     d EPT_QTSPGETM    c                   x'1678'
     d EPT_QTSPGETS    c                   x'1679'
     d EPT_QTSPIEXT    c                   x'167A'
     d EPT_QTSPOPEN    c                   x'167B'
     d EPT_QTSPPUT     c                   x'167C'
     d EPT_QTSPPUTM    c                   x'167D'
     d EPT_QTSPUDR     c                   x'167E'
     d EPT_QTSSDIST    c                   x'167F'
     d EPT_QTSTDIST    c                   x'1680'
     d EPT_QWCPCOM1    c                   x'1681'
     d EPT_QWCPCOM2    c                   x'1682'
     d EPT_QWPZNAUT    c                   x'1683'
     d EPT_QQXRPTM2    c                   x'1684'
     d EPT_QTACHRSC    c                   x'1685'
     d EPT_QTAMCMGR    c                   x'1686'
     d EPT_QTNXASVT    c                   x'1687'
     d EPT_QWDGSAV     c                   x'1688'
     d EPT_QJOBUBCT    c                   x'1689'
     d EPT_QSCGNTRC    c                   x'168A'
     d EPT_QSMCHGPW    c                   x'168B'
     d EPT_QSMSIGN     c                   x'168C'
     d EPT_QSQDLTPM    c                   x'168D'
     d EPT_QFPACKSA    c                   x'168E'
     d EPT_QFPACKUA    c                   x'168F'
     d EPT_QFPACKUE    c                   x'1690'
     d EPT_QFPACNSA    c                   x'1691'
     d EPT_QFPACNUA    c                   x'1692'
     d EPT_QFPADNSA    c                   x'1693'
     d EPT_QFPADNUA    c                   x'1694'
     d EPT_QFPADXUS    c                   x'1695'
     d EPT_QFPAPOSA    c                   x'1696'
     d EPT_QFPAPOUA    c                   x'1697'
     d EPT_QFPAPRDL    c                   x'1698'
     d EPT_QFPASLNU    c                   x'1699'
     d EPT_QFPASNWA    c                   x'169A'
     d EPT_QFPASNWU    c                   x'169B'
     d EPT_QFPASRNC    c                   x'169C'
     d EPT_QFPAWWUE    c                   x'169D'
     d EPT_QFPZPRT     c                   x'169E'
     d EPT_QPRPH01L    c                   x'169F'
     d EPT_QPRPH11L    c                   x'16A0'
     d EPT_QP0FPINI    c                   x'16A1'
     d EPT_QSQDSSTM    c                   x'16A2'
     d EPT_QDBCRTNG    c                   x'16A3'
     d EPT_QSWSTUBA    c                   x'16A4'
     d EPT_QSWSTUBB    c                   x'16A5'
     d EPT_QSWSTUBC    c                   x'16A6'
     d EPT_QSWSTUBD    c                   x'16A7'
     d EPT_QTECDSWP    c                   x'16A8'
     d EPT_QTEMCKOP    c                   x'16A9'
     d EPT_QTSPGETD    c                   x'16AA'
     d EPT_QTSPPTDR    c                   x'16AB'
     d EPT_QWCSCDF2    c                   x'16AC'
     d EPT_QWCSVRD2    c                   x'16AD'
     d EPT_QWTCCCSJ    c                   x'16AE'
     d EPT_QWTCPCSJ    c                   x'16AF'
     d EPT_QWTSXTSR    c                   x'16B0'
     d EPT_QSZRSTPA    c                   x'16B1'
     d EPT_QDBDSPNG    c                   x'16B2'
     d EPT_QDBRSTNG    c                   x'16B3'
     d EPT_QFPACACH    c                   x'16B4'
     d EPT_QFPAPRFE    c                   x'16B5'
     d EPT_QFPAPRFJ    c                   x'16B6'
     d EPT_QFPAPRFU    c                   x'16B7'
     d EPT_QFPASINX    c                   x'16B8'
     d EPT_QFPASREG    c                   x'16B9'
     d EPT_QL6DCSND    c                   x'16BA'
     d EPT_QL6DMRCV    c                   x'16BB'
     d EPT_QL6DMSND    c                   x'16BC'
     d EPT_QL6RSPMS    c                   x'16BD'
     d EPT_QL6SRSSD    c                   x'16BE'
     d EPT_QL6TDCSD    c                   x'16BF'
     d EPT_QL6TRRSP    c                   x'16C0'
     d EPT_QPAITRMS    c                   x'16C1'
     d EPT_QPASVRCP    c                   x'16C2'
     d EPT_QPASVREP    c                   x'16C3'
     d EPT_QPASVRP     c                   x'16C4'
     d EPT_QPASVRS     c                   x'16C5'
     d EPT_QWCCCHOC    c                   x'16C6'
     d EPT_QNTLPPCH    c                   x'16C7'
     d EPT_QNTPRCPP    c                   x'16C8'
     d EPT_QNTRTVPR    c                   x'16C9'
     d EPT_QP0LCCFS    c                   x'16CA'
     d EPT_QP0LCDFS    c                   x'16CB'
     d EPT_QP0LCDMN    c                   x'16CC'
     d EPT_QP0LCDUD    c                   x'16CD'
     d EPT_QP0LCESV    c                   x'16CE'
     d EPT_QP0LCMNT    c                   x'16CF'
     d EPT_QWCCDSOC    c                   x'16D0'
     d EPT_QP0LCPOP    c                   x'16D1'
     d EPT_QP0LCSSV    c                   x'16D2'
     d EPT_QP0LCUMT    c                   x'16D3'
     d EPT_QQQJGET     c                   x'16D4'
     d EPT_QQQJOIND    c                   x'16D5'
     d EPT_QQQJOINI    c                   x'16D6'
     d EPT_QQQMOROP    c                   x'16D7'
     d EPT_QQQQQQQQ    c                   x'16D8'
     d EPT_QQUXQRYR    c                   x'16D9'
     d EPT_QSECCDFT    c                   x'16DA'
     d EPT_QSECSBD1    c                   x'16DB'
     d EPT_QSECSBD3    c                   x'16DC'
     d EPT_QSRUDFS     c                   x'16DD'
     d EPT_QSYGETCC    c                   x'16DE'
     d EPT_QSYPREAD    c                   x'16DF'
     d EPT_QTOCAUTH    c                   x'16E0'
     d EPT_QPQYIMGZ    c                   x'16E1'
     d EPT_QTOCPP      c                   x'16E2'
     d EPT_QTOCPPFM    c                   x'16E3'
     d EPT_QTOCPPPW    c                   x'16E4'
     d EPT_QTOCPPSK    c                   x'16E5'
     d EPT_QPZDLDIR    c                   x'16E6'
     d EPT_QTOCPPUV    c                   x'16E7'
     d EPT_QTOCPPUX    c                   x'16E8'
     d EPT_QTQISOPM    c                   x'16E9'
     d EPT_QWCJOBSR    c                   x'16EA'
     d EPT_QWCCDSWC    c                   x'16ED'
     d EPT_QSQDROP2    c                   x'16EE'
     d EPT_QZSPINST    c                   x'16EF'
     d EPT_QDCDUPIA    c                   x'16F0'
     d EPT_QDCSTF2     c                   x'16F1'
     d EPT_QFPADAPP    c                   x'16F2'
     d EPT_QDBGETSQQO  c                   x'16F3'
     d EPT_QDCNWSHC    c                   x'16F4'
     d EPT_QSRSVOUT    c                   x'16F5'
     d EPT_QFPRCHCF    c                   x'16F6'
     d EPT_QSYCSECD    c                   x'16F7'
     d EPT_QFPRCOMM    c                   x'16F8'
     d EPT_QJOIASPV    c                   x'16F9'
     d EPT_QFPRCRCF    c                   x'16FA'
     d EPT_QFPRDLCF    c                   x'16FB'
     d EPT_QFPRDPCF    c                   x'16FC'
     d EPT_QOSRTVCP    c                   x'16FD'
     d EPT_QOSRTVVC    c                   x'16FE'
     d EPT_QPQYIFM4    c                   x'16FF'
     d EPT_QSQMODTR    c                   x'1700'
     d EPT_QWCSXTOR    c                   x'1701'
     d EPT_QP0LCRLC    c                   x'1702'
     d EPT_QP0LCXFS    c                   x'1703'
     d EPT_QSYCHATR    c                   x'1704'
     d EPT_QSYDSATR    c                   x'1705'
     d EPT_QSYINGPL    c                   x'1706'
     d EPT_QSYMRKUP    c                   x'1707'
     d EPT_QSYPOATR    c                   x'1708'
     d EPT_QSYSVATR    c                   x'1709'
     d EPT_QTOCRTTC    c                   x'170A'
     d EPT_QTQCCCC     c                   x'170B'
     d EPT_QWCGCWD     c                   x'170C'
     d EPT_QWCICVOR    c                   x'170D'
     d EPT_QFPRIZCF    c                   x'170E'
     d EPT_QFPRPHCF    c                   x'170F'
     d EPT_QFPRVARY    c                   x'1710'
     d EPT_QFPRVHCF    c                   x'1711'
     d EPT_QP0FRCCK    c                   x'1712'
     d EPT_QSECPOSA    c                   x'1713'
     d EPT_QFPRVRCF    c                   x'1714'
     d EPT_QZCAHRHW    c                   x'1715'
     d EPT_QZCAHRNC    c                   x'1716'
     d EPT_QZCAHRSW    c                   x'1717'
     d EPT_QDCCFGIX    c                   x'1718'
     d EPT_QDCPOLDI    c                   x'1719'
     d EPT_QDCPOLTR    c                   x'171A'
     d EPT_QDCPTCA2    c                   x'171B'
     d EPT_QDCWRKIX    c                   x'171C'
     d EPT_QINRCLM     c                   x'171D'
     d EPT_QPQYFPLZ    c                   x'171E'
     d EPT_QTOCPPADD   c                   x'171F'
     d EPT_QBNENDPR    c                   x'1720'
     d EPT_QBNVCSPE    c                   x'1721'
     d EPT_QFPRWKCF    c                   x'1722'
     d EPT_QLGCVTUT    c                   x'1723'
     d EPT_QLGGENCAT   c                   x'1724'
     d EPT_QLGGLID     c                   x'1725'
     d EPT_QLGIEXIT    c                   x'1726'
     d EPT_QLGLCIEX    c                   x'1727'
     d EPT_QLGLCLEX    c                   x'1728'
     d EPT_QPADEVST    c                   x'1729'
     d EPT_QPATEJEH    c                   x'172A'
     d EPT_QSYCRTVL    c                   x'172B'
     d EPT_QSZRTVDI    c                   x'172C'
     d EPT_QTQRCV2     c                   x'172D'
     d EPT_QT1IFC      c                   x'172E'
     d EPT_QWPNSTDR    c                   x'172F'
     d EPT_QBNSTRPR    c                   x'1730'
     d EPT_QCNSCONN    c                   x'1731'
     d EPT_QCNXGET     c                   x'1732'
     d EPT_QCNXPUT     c                   x'1733'
     d EPT_QJOADDRJ    c                   x'1734'
     d EPT_QJOCHGEV    c                   x'1735'
     d EPT_QJOCHGST    c                   x'1736'
     d EPT_QJOCJSIE    c                   x'1737'
     d EPT_QJOCJSTR    c                   x'1738'
     d EPT_QJOCRTNG    c                   x'1739'
     d EPT_QJOJIDX     c                   x'173A'
     d EPT_QJORCMPL    c                   x'173B'
     d EPT_QJORJOBJ    c                   x'173C'
     d EPT_QJORJRNI    c                   x'173D'
     d EPT_QJORMTJN    c                   x'173E'
     d EPT_QJORMVRJ    c                   x'173F'
     d EPT_QJORRCVI    c                   x'1740'
     d EPT_QRWRLNPC    c                   x'1741'
     d EPT_QDFRECOV    c                   x'1742'
     d EPT_QRWTLSTC    c                   x'1743'
     d EPT_QRWTSECR    c                   x'1744'
     d EPT_QRWXRUE     c                   x'1745'
     d EPT_QSQCHECK    c                   x'1746'
     d EPT_QSRSAVEM    c                   x'1747'
     d EPT_QSYUSRVF    c                   x'1748'
     d EPT_QTHMCTCB    c                   x'1749'
     d EPT_QTHMDTCB    c                   x'174A'
     d EPT_QTHMWRK     c                   x'174B'
     d EPT_QTHMWRK1    c                   x'174C'
     d EPT_QTHMWRK2    c                   x'174D'
     d EPT_QTHMWRK3    c                   x'174E'
     d EPT_QWCDSKDF    c                   x'174F'
     d EPT_QLSSPACE    c                   x'1750'
     d EPT_QLSTRACE    c                   x'1751'
     d EPT_QLSWRKA     c                   x'1752'
     d EPT_QP0LCCRS    c                   x'1753'
     d EPT_QP0LCERP    c                   x'1754'
     d EPT_QP0LCSRP    c                   x'1755'
     d EPT_QTOCPPPRT   c                   x'1756'
     d EPT_QTOCPPRMV   c                   x'1757'
     d EPT_QSYSVRAU    c                   x'1758'
     d EPT_QTETDI      c                   x'1759'
     d EPT_QTEVTDIU    c                   x'175A'
     d EPT_QWCILSVR    c                   x'175B'
     d EPT_QWCSCLXR    c                   x'175C'
     d EPT_QWCSSNCR    c                   x'175D'
     d EPT_QWVGLAGP    c                   x'175E'
     d EPT_QYYCRL2C    c                   x'175F'
     d EPT_QYYCRL2S    c                   x'1760'
     d EPT_QBNGETWC    c                   x'1761'
     d EPT_QDBCKCOL    c                   x'1762'
     d EPT_QDBFLDAU    c                   x'1763'
     d EPT_QDCCHLIO    c                   x'1764'
     d EPT_QDCCRLIO    c                   x'1765'
     d EPT_QJOENDEV    c                   x'1766'
     d EPT_QJOPREAD    c                   x'1767'
     d EPT_QJORJEND    c                   x'1768'
     d EPT_QJOTMEVT    c                   x'1769'
     d EPT_QLIFLIBL    c                   x'176A'
     d EPT_QPMGETNM    c                   x'176B'
     d EPT_QKJCPFRP    c                   x'176C'
     d EPT_QKJCPTOP    c                   x'176D'
     d EPT_QP0FIPL2    c                   x'176E'
     d EPT_QPMTHIXT    c                   x'176F'
     d EPT_QPMTHSUM    c                   x'1770'
     d EPT_QPQCHGFR    c                   x'1771'
     d EPT_QPQYDMGZ    c                   x'1772'
     d EPT_QPQYMEGZ    c                   x'1773'
     d EPT_QP0ZLIPC    c                   x'1774'
     d EPT_QQQENDJB    c                   x'1775'
     d EPT_QRWULBND    c                   x'1776'
     d EPT_QSWRAEVT    c                   x'1777'
     d EPT_QSYRSVLD    c                   x'1778'
     d EPT_QSYSVVLD    c                   x'1779'
     d EPT_QTEMAPST    c                   x'177A'
     d EPT_QTHMWRKX    c                   x'177B'
     d EPT_QTOCAUTO    c                   x'177C'
     d EPT_QTOCDMNC    c                   x'177D'
     d EPT_QTOCDMNP    c                   x'177E'
     d EPT_QTOCIFCU    c                   x'177F'
     d EPT_QTOCLCP     c                   x'1780'
     d EPT_QTOCNETC    c                   x'1781'
     d EPT_QSPMSASP    c                   x'1782'
     d EPT_QTOCPPCM    c                   x'1783'
     d EPT_QSQROUTA    c                   x'1784'
     d EPT_QTOCPPMU    c                   x'1785'
     d EPT_QTOCPPPM    c                   x'1786'
     d EPT_QTOCPPPU    c                   x'1787'
     d EPT_QTOCRTEU    c                   x'1788'
     d EPT_QDCPOLIO    c                   x'1789'
     d EPT_QDCVCLIO    c                   x'178A'
     d EPT_QLGCVTSS    c                   x'178B'
     d EPT_QRWCDTPO    c                   x'178C'
     d EPT_QRWCHGTA    c                   x'178D'
     d EPT_QTBRTVSR    c                   x'178E'
     d EPT_QTODBCNV    c                   x'178F'
     d EPT_QTODBPCC    c                   x'1790'
     d EPT_QTODBPOP    c                   x'1791'
     d EPT_QTODCFBP    c                   x'1792'
     d EPT_QTODTCNV    c                   x'1793'
     d EPT_QTODTPCC    c                   x'1794'
     d EPT_QTODTPOP    c                   x'1795'
     d EPT_QTODWBPO    c                   x'1796'
     d EPT_QTODWBPT    c                   x'1797'
     d EPT_QWPPJLDR    c                   x'1798'
     d EPT_QDBWLKCC    c                   x'1799'
     d EPT_QJVADBNT    c                   x'179A'
     d EPT_QJVADBSV    c                   x'179B'
     d EPT_QSCTHEXR    c                   x'179E'
     d EPT_QSQPARSP    c                   x'179F'
     d EPT_QSQPROCR    c                   x'17A0'
     d EPT_QSRCHIGC    c                   x'17A1'
     d EPT_QSRCHI38    c                   x'17A2'
     d EPT_QSRCHSTD    c                   x'17A3'
     d EPT_QSRCHS38    c                   x'17A4'
     d EPT_QSRSLECT    c                   x'17A5'
     d EPT_QSRVALID    c                   x'17A6'
     d EPT_QTODDB2D    c                   x'17A7'
     d EPT_QTODDCNV    c                   x'17A8'
     d EPT_QTODDCPP    c                   x'17A9'
     d EPT_QTODDJOB    c                   x'17AA'
     d EPT_QTODDPOP    c                   x'17AB'
     d EPT_QTODDTWX    c                   x'17AC'
     d EPT_QWPZGEED    c                   x'17AD'
     d EPT_QHNAVARY    c                   x'17AE'
     d EPT_QSCENWCH    c                   x'17AF'
     d EPT_QZSPIPIS    c                   x'17B0'
     d EPT_QSRCRINX    c                   x'17B1'
     d EPT_QTOCPORU    c                   x'17B2'
     d EPT_QLPEXATR    c                   x'17B3'
     d EPT_QSQALIAS    c                   x'17B4'
     d EPT_QYUNLANG    c                   x'17B6'
     d EPT_QALFRTRP    c                   x'17B7'
     d EPT_QANEAGNT    c                   x'17B8'
     d EPT_QCZCRTCL    c                   x'17B9'
     d EPT_QCZRTVCL    c                   x'17BA'
     d EPT_QDCLNKSP    c                   x'17BB'
     d EPT_QFVCHVRM    c                   x'17BC'
     d EPT_QTEADDVD    c                   x'17BD'
     d EPT_QTEADDVF    c                   x'17BE'
     d EPT_QTEADDVM    c                   x'17BF'
     d EPT_QTEADDVT    c                   x'17C0'
     d EPT_QTEBRKWK    c                   x'17C1'
     d EPT_QTEDFI      c                   x'17C2'
     d EPT_QTEDMPVB    c                   x'17C3'
     d EPT_QTEDRINV    c                   x'17C4'
     d EPT_QTEENDDB    c                   x'17C5'
     d EPT_QTEENDVC    c                   x'17C6'
     d EPT_QTEEVLWK    c                   x'17C7'
     d EPT_QTEMCKIL    c                   x'17C8'
     d EPT_QTEMODN     c                   x'17C9'
     d EPT_QTEPGMWK    c                   x'17CA'
     d EPT_QTEPLSWK    c                   x'17CB'
     d EPT_QTESESSH    c                   x'17CC'
     d EPT_QTESTOPH    c                   x'17CD'
     d EPT_QTESTRVC    c                   x'17CE'
     d EPT_QTESVCLE    c                   x'17CF'
     d EPT_QTESYCRT    c                   x'17D0'
     d EPT_QTESYFMT    c                   x'17D1'
     d EPT_QTESYSAV    c                   x'17D2'
     d EPT_QTETHDWK    c                   x'17D3'
     d EPT_QTEWCHWK    c                   x'17D4'
     d EPT_QTEXADRS    c                   x'17D5'
     d EPT_QTEXMMI     c                   x'17D6'
     d EPT_QTEXTHEX    c                   x'17D7'
     d EPT_QVNACNWS    c                   x'17D8'
     d EPT_QDDVLCHK    c                   x'17D9'
     d EPT_QDMVOVRP    c                   x'17DA'
     d EPT_QDZCMDP     c                   x'17DB'
     d EPT_QDZCPP      c                   x'17DC'
     d EPT_QDZIEXIT    c                   x'17DD'
     d EPT_QDBCHKDP    c                   x'17DE'
     d EPT_QSCDFSO     c                   x'17DF'
     d EPT_QSCDMP      c                   x'17E0'
     d EPT_QSCMIFS     c                   x'17E1'
     d EPT_QSCRSTMF    c                   x'17E2'
     d EPT_QDCDEVLK    c                   x'17E3'
     d EPT_QSQRXOPM    c                   x'17E4'
     d EPT_QTQHEBRN    c                   x'17E5'
     d EPT_QUSSAVUI    c                   x'17E6'
     d EPT_QDBIOERRQO  c                   x'17E7'
     d EPT_QSOUPDF     c                   x'17E8'
     d EPT_QTOFRMTC    c                   x'17E9'
     d EPT_QWPLPTFL    c                   x'17EA'
     d EPT_QSCSTWCH    c                   x'17EB'
     d EPT_QSCWRCMN    c                   x'17EC'
     d EPT_QCPEXPRT    c                   x'17ED'
     d EPT_QCPIMPRT    c                   x'17EE'
     d EPT_QECDLTED    c                   x'17EF'
     d EPT_QESIPTF     c                   x'17F0'
     d EPT_QESIRP      c                   x'17F1'
     d EPT_QESISETU    c                   x'17F2'
     d EPT_QESISRV     c                   x'17F3'
     d EPT_QESISTR     c                   x'17F4'
     d EPT_QESIVAL     c                   x'17F5'
     d EPT_QESIXT      c                   x'17F6'
     d EPT_QESPHONE    c                   x'17F7'
     d EPT_QLIRPLL     c                   x'17F8'
     d EPT_QLPCINTR    c                   x'17F9'
     d EPT_QLZASS1X    c                   x'17FA'
     d EPT_QQQCRDMF    c                   x'17FB'
     d EPT_QSQRFRCY    c                   x'17FC'
     d EPT_QRUCRITM    c                   x'17FD'
     d EPT_QSCBMKTE    c                   x'17FE'
     d EPT_QSCBPSP     c                   x'17FF'
     d EPT_QSCBSRVE    c                   x'1800'
     d EPT_QSCMNWSD    c                   x'1801'
     d EPT_QSCPRTEL    c                   x'1802'
     d EPT_QSMLDVMC    c                   x'1803'
     d EPT_QSQIOBJL    c                   x'1805'
     d EPT_QSYRTCHI    c                   x'1806'
     d EPT_QTACJMAC    c                   x'1807'
     d EPT_QTACJMAP    c                   x'1808'
     d EPT_QTAJIMGR    c                   x'1809'
     d EPT_QTAMLBCL    c                   x'180A'
     d EPT_QTATAPEX    c                   x'180B'
     d EPT_QTAWJMA     c                   x'180C'
     d EPT_QTAWMRQC    c                   x'180D'
     d EPT_QTNRECYC    c                   x'180E'
     d EPT_QTNXIDIX    c                   x'180F'
     d EPT_QTVDMGR     c                   x'1810'
     d EPT_QQQSSDBM    c                   x'1811'
     d EPT_QSYCHFUI    c                   x'1812'
     d EPT_QSYCKUFU    c                   x'1813'
     d EPT_QSYDRGFN    c                   x'1814'
     d EPT_QSYRGFN     c                   x'1815'
     d EPT_QSYRTFUI    c                   x'1816'
     d EPT_QSYRTUFI    c                   x'1817'
     d EPT_QSYRTVFI    c                   x'1818'
     d EPT_QTACJMA     c                   x'1819'
     d EPT_QTARJMA     c                   x'181A'
     d EPT_QWTSJUID    c                   x'181B'
     d EPT_QYPSENDS    c                   x'181C'
     d EPT_QYPSSTRS    c                   x'181D'
     d EPT_QHSMMOVF    c                   x'181E'
     d EPT_QHSMMOVL    c                   x'181F'
     d EPT_QQQQSDBM    c                   x'1820'
     d EPT_QSRCRTMD    c                   x'1821'
     d EPT_QSRDLTMD    c                   x'1822'
     d EPT_QSRRTVMD    c                   x'1823'
     d EPT_QWCRCLSI    c                   x'1824'
     d EPT_QWDCSBSE    c                   x'1825'
     d EPT_QSZSPTPR    c                   x'1826'
     d EPT_QPZCPYSV    c                   x'1827'
     d EPT_QSYDRGAP    c                   x'1828'
     d EPT_QSYRGAP     c                   x'1829'
     d EPT_QTACTLDV    c                   x'182A'
     d EPT_QTOCLPPJ    c                   x'182B'
     d EPT_QLGRTVCD    c                   x'182C'
     d EPT_QYPSCSCA    c                   x'182D'
     d EPT_QYPSCYCC    c                   x'182E'
     d EPT_QYPSENDC    c                   x'182F'
     d EPT_QYPSRSCA    c                   x'1830'
     d EPT_QYPSSTRC    c                   x'1831'
     d EPT_QYPSSTRT    c                   x'1832'
     d EPT_QSYRMVPT    c                   x'1833'
     d EPT_QLGRTVCI    c                   x'1834'
     d EPT_QSYRESPA    c                   x'1835'
     d EPT_QTOCWRKP    c                   x'1836'
     d EPT_QDBRJBRL    c                   x'1837'
     d EPT_QDBRRCDL    c                   x'1838'
     d EPT_QPTRTVPO    c                   x'1839'
     d EPT_QUHRHLPT    c                   x'183A'
     d EPT_QYDOADDV    c                   x'183B'
     d EPT_QYDORTVO    c                   x'183C'
     d EPT_QYDOSGNO    c                   x'183D'
     d EPT_QYDOVFYO    c                   x'183E'
     d EPT_QCDRCMDD    c                   x'183F'
     d EPT_QLGRTVCT    c                   x'1840'
     d EPT_Q1PENDPM    c                   x'1841'
     d EPT_Q1PRPMS     c                   x'1842'
     d EPT_Q1PSTRPM    c                   x'1843'
     d EPT_QSZDLTAF    c                   x'1844'
     d EPT_QSZLSTRA    c                   x'1845'
     d EPT_QSZUPDRA    c                   x'1846'
     d EPT_QTOCCCNA    c                   x'1847'
     d EPT_QWTCTJBS    c                   x'1848'
     d EPT_QJOCHRVC    c                   x'1849'
     d EPT_QPQRAFPI    c                   x'184A'
     d EPT_QSYRTVSA    c                   x'184B'
     d EPT_QWVRCSTK    c                   x'184C'
     d EPT_QSPPUBPI    c                   x'184D'
     d EPT_QSQCHGDC    c                   x'184E'
     d EPT_QWCRJBLK    c                   x'184F'
     d EPT_QWCRLCKI    c                   x'1850'
     d EPT_QWCSVRST    c                   x'1851'
     d EPT_QWTRTVTA    c                   x'1852'
     d EPT_Q1PRTRN     c                   x'1853'
     d EPT_QGLDSSDD    c                   x'1854'
     d EPT_QP0LROR     c                   x'1855'
     d EPT_QTARDSTS    c                   x'1856'
     d EPT_QTVDMIEX    c                   x'1857'
     d EPT_QTVENDTN    c                   x'1858'
     d EPT_QTVSINI2    c                   x'1859'
     d EPT_QTVSTRTN    c                   x'185A'
     d EPT_QTVTELN     c                   x'185B'
     d EPT_QUPMENU     c                   x'185C'
     d EPT_QUPVLIC     c                   x'185D'
     d EPT_QYPSEXIT    c                   x'185E'
     d EPT_QSQPCPUT    c                   x'185F'
     d EPT_QHSMMVFA    c                   x'1860'
     d EPT_QSCWRJOB    c                   x'1861'
     d EPT_QDBIOEVT    c                   x'1862'
     d EPT_QDBVYASP    c                   x'1863'
     d EPT_QTNXAEVT    c                   x'1864'
     d EPT_QTOFJRNL    c                   x'1865'
     d EPT_QPMJPDSA    c                   x'1866'
     d EPT_QPMJPDSF    c                   x'1867'
     d EPT_QPMJPDSI    c                   x'1868'
     d EPT_QPMJPDSR    c                   x'1869'
     d EPT_QP0LHDIR    c                   x'186A'
     d EPT_QP0SSPCS    c                   x'186B'
     d EPT_QSRVALDV    c                   x'186C'
     d EPT_QTOCTRCA    c                   x'186D'
     d EPT_QTOGINTD    c                   x'186E'
     d EPT_QTOGINTE    c                   x'186F'
     d EPT_QWTXJUID    c                   x'1870'
     d EPT_QDBDLDSP    c                   x'1871'
     d EPT_QDBDLGRP    c                   x'1872'
     d EPT_QDBDLLNK    c                   x'1873'
     d EPT_QDBDLMGR    c                   x'1874'
     d EPT_QDBDLPAN    c                   x'1875'
     d EPT_QDBDLWRK    c                   x'1876'
     d EPT_QJODLTPH    c                   x'1877'
     d EPT_QJORJRNE    c                   x'1878'
     d EPT_QPMDAPPN    c                   x'1879'
     d EPT_QPMDBUS     c                   x'187A'
     d EPT_QPMDCOMM    c                   x'187B'
     d EPT_QPMDCONF    c                   x'187C'
     d EPT_QPMDDISK    c                   x'187D'
     d EPT_QPMDHDWR    c                   x'187E'
     d EPT_QPMDIOP     c                   x'187F'
     d EPT_QPMDIOPD    c                   x'1880'
     d EPT_QPMDJOBM    c                   x'1881'
     d EPT_QPMDJOBO    c                   x'1882'
     d EPT_QPMDMAIN    c                   x'1883'
     d EPT_QPMDPOOL    c                   x'1884'
     d EPT_QPMDRESP    c                   x'1885'
     d EPT_QGLDCLEX    c                   x'1886'
     d EPT_QPMDSAP     c                   x'1887'
     d EPT_QPMDSBSD    c                   x'1888'
     d EPT_QPMDSNA     c                   x'1889'
     d EPT_QPMDSNAD    c                   x'188A'
     d EPT_QPMDSTAR    c                   x'188B'
     d EPT_QPMDSTN     c                   x'188C'
     d EPT_QPMDSYSC    c                   x'188D'
     d EPT_QPMDSYST    c                   x'188E'
     d EPT_QPMDTSK     c                   x'188F'
     d EPT_QP0ZCPRC    c                   x'1890'
     d EPT_QP0ZPCP2    c                   x'1891'
     d EPT_QSPRMTXT    c                   x'1892'
     d EPT_QWCSDSSR    c                   x'1893'
     d EPT_QCSTCIOR    c                   x'1894'
     d EPT_QCSTCRGR    c                   x'1895'
     d EPT_QCSTCRRH    c                   x'1896'
     d EPT_QDBABTXN    c                   x'1897'
     d EPT_QDBBGTXN    c                   x'1898'
     d EPT_QDBCMTXN    c                   x'1899'
     d EPT_QDBCONN     c                   x'189A'
     d EPT_QDBDCONN    c                   x'189B'
     d EPT_QDBDFGRP    c                   x'189C'
     d EPT_QDBDTGRP    c                   x'189D'
     d EPT_QDBLNKF     c                   x'189E'
     d EPT_QDBPRTXN    c                   x'189F'
     d EPT_QDBQPTXN    c                   x'18A0'
     d EPT_QDBRECON    c                   x'18A1'
     d EPT_QDBULNKF    c                   x'18A2'
     d EPT_QCDEXTPT    c                   x'18A3'
     d EPT_QFPACHFM    c                   x'18A4'
     d EPT_QFPASGVA    c                   x'18A5'
     d EPT_QPMDEXIT    c                   x'18A6'
     d EPT_QPMDINIT    c                   x'18A7'
     d EPT_QPMDPREP    c                   x'18A8'
     d EPT_QPMDPTUN    c                   x'18A9'
     d EPT_QP0ZDLTE    c                   x'18AA'
     d EPT_QRWSUBPW    c                   x'18AB'
     d EPT_QRZCRP      c                   x'18AC'
     d EPT_QRZDCCRP    c                   x'18AD'
     d EPT_QRZDCRP     c                   x'18AE'
     d EPT_QSQCRTUT    c                   x'18AF'
     d EPT_QSQDLTUT    c                   x'18B0'
     d EPT_QSYCVTSP    c                   x'18B1'
     d EPT_QSQPATH     c                   x'18B2'
     d EPT_QSQTHOPM    c                   x'18B3'
     d EPT_QSQUDTRC    c                   x'18B4'
     d EPT_QSCWRKUI    c                   x'18B5'
     d EPT_QSQUDTRS    c                   x'18B6'
     d EPT_QTAFIMGR    c                   x'18B7'
     d EPT_QZDFSINI    c                   x'18B8'
     d EPT_QZRUEDTF    c                   x'18B9'
     d EPT_QCDRSTCD    c                   x'18BA'
     d EPT_QCSTCRGS    c                   x'18BB'
     d EPT_QDBCRBDL    c                   x'18BC'
     d EPT_QDCCHIIO    c                   x'18BD'
     d EPT_QDCCRIIO    c                   x'18BE'
     d EPT_QDCPOIIO    c                   x'18BF'
     d EPT_QDCRCNLE    c                   x'18C0'
     d EPT_QDCRCNNL    c                   x'18C1'
     d EPT_QDCRNWID    c                   x'18C2'
     d EPT_QDCVCIIO    c                   x'18C3'
     d EPT_QDDVDDMF    c                   x'18C4'
     d EPT_QGLDQSDD    c                   x'18C5'
     d EPT_QPZLOCKX    c                   x'18C6'
     d EPT_QQQCALL     c                   x'18C7'
     d EPT_QQQPROPT    c                   x'18C8'
     d EPT_QQQUDFAC    c                   x'18C9'
     d EPT_QQQUDFHL    c                   x'18CA'
     d EPT_QSRCBCLN    c                   x'18CB'
     d EPT_QTOCGDNS    c                   x'18CC'
     d EPT_QTOCL2TP    c                   x'18CD'
     d EPT_QTOCPPPCTL  c                   x'18CE'
     d EPT_QTOCPPPJ    c                   x'18CF'
     d EPT_QTOCUSOC    c                   x'18D0'
     d EPT_QUSRSTRG    c                   x'18D1'
     d EPT_QWTGETRQ    c                   x'18D2'
     d EPT_QWTPUTRQ    c                   x'18D3'
     d EPT_QYASPCHG    c                   x'18D4'
     d EPT_QYASPEND    c                   x'18D5'
     d EPT_QYASPSTR    c                   x'18D6'
     d EPT_QYASPTRC    c                   x'18D7'
     d EPT_QYPSCDMC    c                   x'18D8'
     d EPT_QSRCBFRE    c                   x'18D9'
     d EPT_QCSTDLTC    c                   x'18DA'
     d EPT_QPMCVTFC    c                   x'18DB'
     d EPT_QPMDJSUM    c                   x'18DC'
     d EPT_QYSMCSVE    c                   x'18DD'
     d EPT_QYSMPUT     c                   x'18DE'
     d EPT_QYSMRSVE    c                   x'18DF'
     d EPT_QDBCRTF2    c                   x'18E0'
     d EPT_QDBDLFUN    c                   x'18E1'
     d EPT_QTOVDEXT    c                   x'18E2'
     d EPT_QTVSINI3    c                   x'18E3'
     d EPT_QP0ZUEP     c                   x'18E4'
     d EPT_QLERCLAG    c                   x'18E5'
     d EPT_QSYEVTPT    c                   x'18E6'
     d EPT_QSQSTRPJ    c                   x'18E7'
     d EPT_QP0LCPCP    c                   x'18E8'
     d EPT_QDBDLPDD    c                   x'18E9'
     d EPT_QP0LCTYP    c                   x'18EA'
     d EPT_QPQCRV      c                   x'18EB'
     d EPT_QPQCHV      c                   x'18EC'
     d EPT_QDBAGILE    c                   x'18ED'
     d EPT_QDBCHGPL    c                   x'18EE'
     d EPT_QJOBLDIX    c                   x'18EF'
     d EPT_QSCCNN      c                   x'18F0'
     d EPT_QDBFFEXT    c                   x'18F1'
     d EPT_QDBNQEH     c                   x'18F2'
     d EPT_QDBTREXT    c                   x'18F3'
     d EPT_QDBXRDDM    c                   x'18F4'
     d EPT_QDBXREFR    c                   x'18F5'
     d EPT_QSCFMTRC    c                   x'18F6'
     d EPT_QPQCRTFT    c                   x'18F7'
     d EPT_QPQADDFT    c                   x'18F8'
     d EPT_QPQCHGFT    c                   x'18F9'
     d EPT_QPQRMVFT    c                   x'18FA'
     d EPT_QPQDSPFT    c                   x'18FB'
     d EPT_QPQDSPIL    c                   x'18FC'
     d EPT_QPQCHGCX    c                   x'18FD'
     d EPT_QPQDSPCF    c                   x'18FE'
     d EPT_QSYMTCOG    c                   x'18FF'
     d EPT_QDCOPTDR    c                   x'1900'
     d EPT_QP0LALLO    c                   x'1901'
     d EPT_QSCCNN1     c                   x'1902'
     d EPT_QSCTI1      c                   x'1903'
     d EPT_QRWXENCR    c                   x'1904'
     d EPT_QTOCCHGP    c                   x'1905'
     d EPT_QTQMKMP4    c                   x'1906'
     d EPT_QTQMKMP5    c                   x'1907'
     d EPT_QSYINTDR    c                   x'1908'
     d EPT_QAKACNVL    c                   x'1909'
     d EPT_QLPTRKPD    c                   x'190A'
     d EPT_QPMDTCPB    c                   x'190B'
     d EPT_QPMDTCPI    c                   x'190C'
     d EPT_QSYCHKLG    c                   x'190D'
     d EPT_QSZPRAIR    c                   x'190E'
     d EPT_QSZRAIRX    c                   x'190F'
     d EPT_QSZSYNC     c                   x'1910'
     d EPT_QWCSRSVR    c                   x'1911'
     d EPT_QWCSSVVR    c                   x'1912'
     d EPT_QYDOCPYD2K  c                   x'1913'
     d EPT_QYDOCPYK2D  c                   x'1914'
     d EPT_QDCLKASP    c                   x'1915'
     d EPT_QDCRSCEH    c                   x'1916'
     d EPT_QDCRSCRP    c                   x'1917'
     d EPT_QJOENDOB    c                   x'1918'
     d EPT_QJOJRNOB    c                   x'1919'
     d EPT_QJOOBJEN    c                   x'191A'
     d EPT_QPQYOENZ    c                   x'191B'
     d EPT_QPQYRFLZ    c                   x'191C'
     d EPT_QP0LCCAV    c                   x'191D'
     d EPT_QP0LCCHA    c                   x'191E'
     d EPT_QQQVEXPL    c                   x'191F'
     d EPT_QRWSSYNC    c                   x'1920'
     d EPT_QRWTALCL    c                   x'1921'
     d EPT_QRWTSYNC    c                   x'1922'
     d EPT_QSPCVTOQ    c                   x'1923'
     d EPT_QSPDLSTX    c                   x'1924'
     d EPT_QSPFNSPF    c                   x'1925'
     d EPT_QSPPSFST    c                   x'1926'
     d EPT_QSPWAIT     c                   x'1927'
     d EPT_QTNGETLH    c                   x'1928'
     d EPT_QTNSYNER    c                   x'1929'
     d EPT_QSCWRLIC    c                   x'192A'
     d EPT_QZDANDB     c                   x'192B'
     d EPT_QSCWRTRC    c                   x'192C'
     d EPT_QSCWRWCH    c                   x'192D'
     d EPT_QGLDRCVT    c                   x'192E'
     d EPT_QGLDSSVR    c                   x'192F'
     d EPT_QGLDUSTB    c                   x'1930'
     d EPT_QJOIASPC    c                   x'1931'
     d EPT_QTNCANRB    c                   x'1932'
     d EPT_QDBXJOUR    c                   x'1933'
     d EPT_QDBXVFIL    c                   x'1934'
     d EPT_QDBXVON     c                   x'1935'
     d EPT_QLICLASP    c                   x'1936'
     d EPT_QLICSLIB    c                   x'1937'
     d EPT_QLIRPASP    c                   x'1938'
     d EPT_QPQCSMTP    c                   x'1939'
     d EPT_QWCASDJM    c                   x'193A'
     d EPT_QPQYDORZ    c                   x'193B'
     d EPT_QPQYESGZ    c                   x'193C'
     d EPT_QPQYIDOZ    c                   x'193D'
     d EPT_QPQYXDPZ    c                   x'193E'
     d EPT_QPZCPYGR    c                   x'193F'
     d EPT_QPZGRMGR    c                   x'1940'
     d EPT_QPZWRKGR    c                   x'1941'
     d EPT_QP0FJRNFID  c                   x'1942'
     d EPT_QRWDISCO    c                   x'1943'
     d EPT_QCSTDTCCPP  c                   x'1944'
     d EPT_QCSTDTRCPP  c                   x'1945'
     d EPT_QSQCHKN     c                   x'1946'
     d EPT_QSQDDLOP    c                   x'1947'
     d EPT_QHSMDLIB    c                   x'1948'
     d EPT_QSQSCTVO    c                   x'1949'
     d EPT_QSYDSPSVRA  c                   x'194A'
     d EPT_QCSTDSCCPP  c                   x'194B'
     d EPT_QCSTDSRCPP  c                   x'194C'
     d EPT_QDBSTSRV    c                   x'194D'
     d EPT_QCSTADCCPP  c                   x'194E'
     d EPT_QCSTADDCPP  c                   x'194F'
     d EPT_QCSTADRCPP  c                   x'1950'
     d EPT_QCSTCFCCPP  c                   x'1951'
     d EPT_QCSTCHCCPP  c                   x'1952'
     d EPT_QCSTCHDCPP  c                   x'1953'
     d EPT_QCSTCHPCPP  c                   x'1954'
     d EPT_QCSTCHRCPP  c                   x'1955'
     d EPT_QCSTCHVCPP  c                   x'1956'
     d EPT_QCSTCRCCPP  c                   x'1957'
     d EPT_QCSTCRRCPP  c                   x'1958'
     d EPT_QSCADTR1    c                   x'1959'
     d EPT_QSCRMTR1    c                   x'195A'
     d EPT_QCSTDMACPP  c                   x'195B'
     d EPT_QCSTDMRCPP  c                   x'195C'
     d EPT_QCSTENCCPP  c                   x'195D'
     d EPT_QCSTENRCPP  c                   x'195E'
     d EPT_QCSTRMCCPP  c                   x'195F'
     d EPT_QCSTRMDCPP  c                   x'1960'
     d EPT_QCSTRMRCPP  c                   x'1961'
     d EPT_QCSTSTCCPP  c                   x'1962'
     d EPT_QCSTSTRCPP  c                   x'1963'
     d EPT_QDBX_FR     c                   x'1964'
     d EPT_QDBXPASP    c                   x'1965'
     d EPT_QDBX32A6    c                   x'1966'
     d EPT_QGLDPCMD    c                   x'1967'
     d EPT_QMOCDSPX    c                   x'1968'
     d EPT_QMOCPMGR    c                   x'1969'
     d EPT_QMORGUSR    c                   x'196A'
     d EPT_QGLDPUEXIT  c                   x'196B'
     d EPT_QPZWRKGU    c                   x'196C'
     d EPT_QTESEPEH    c                   x'196D'
     d EPT_QP0FIPL     c                   x'196E'
     d EPT_QRWXGSS     c                   x'196F'
     d EPT_QWCASUJM    c                   x'1970'
     d EPT_QWCISUJR    c                   x'1971'
     d EPT_QDBSTSPC    c                   x'1972'
     d EPT_QSQPLEXD    c                   x'1973'
     d EPT_QSQPMAIN    c                   x'1974'
     d EPT_QSQPREAD    c                   x'1975'
     d EPT_QSQPRUNI    c                   x'1976'
     d EPT_QSQPSTMD    c                   x'1977'
     d EPT_QSQUPCAT    c                   x'1978'
     d EPT_QTARECAL    c                   x'1979'
     d EPT_QTRCACT     c                   x'197A'
     d EPT_QTRCCVT     c                   x'197B'
     d EPT_QPMDDMNO    c                   x'197C'
     d EPT_QPMDHTTP    c                   x'197D'
     d EPT_QPMDUSRT    c                   x'197E'
     d EPT_QSCMDIR     c                   x'197F'
     d EPT_QSECACT1    c                   x'1980'
     d EPT_QSECADP1    c                   x'1981'
     d EPT_QSECAUDR    c                   x'1982'
     d EPT_QSECCHGL    c                   x'1983'
     d EPT_QSECCHSA    c                   x'1984'
     d EPT_QSECCMN1    c                   x'1985'
     d EPT_QSECDSAT    c                   x'1986'
     d EPT_QSECDSPA    c                   x'1987'
     d EPT_QSECDSPL    c                   x'1988'
     d EPT_QSECDSPX    c                   x'1989'
     d EPT_QSECDSSA    c                   x'198A'
     d EPT_QSECEXP1    c                   x'198B'
     d EPT_QSECIDL1    c                   x'198C'
     d EPT_QSECJBD1    c                   x'198D'
     d EPT_QSECOBJ0    c                   x'198E'
     d EPT_QSECPPI     c                   x'198F'
     d EPT_QSECPUO1    c                   x'1990'
     d EPT_QSECPVT0    c                   x'1991'
     d EPT_QSECQ1      c                   x'1992'
     d EPT_QSECTGR1    c                   x'1993'
     d EPT_QSECUSR1    c                   x'1994'
     d EPT_QSYAFASP    c                   x'1995'
     d EPT_QSYEIMUSTB  c                   x'1996'
     d EPT_QTETDFI     c                   x'1997'
     d EPT_QTNNTX      c                   x'1998'
     d EPT_QTESIREF    c                   x'1999'
     d EPT_QSCADTRC    c                   x'199A'
     d EPT_QTOCEVENT   c                   x'199B'
     d EPT_QTOCLOGCMD  c                   x'199C'
     d EPT_QSCRMTRC    c                   x'199D'
     d EPT_QWCSSDJR    c                   x'199E'
     d EPT_QTOCSYNETA  c                   x'199F'
     d EPT_QTOCTCPIP   c                   x'19A0'
     d EPT_QTQARABN    c                   x'19A1'
     d EPT_QJOCPLUS    c                   x'19A2'
     d EPT_QVOIADDE    c                   x'19A3'
     d EPT_QVOICHGC    c                   x'19A4'
     d EPT_QVOICMGR    c                   x'19A5'
     d EPT_QVOICRTC    c                   x'19A6'
     d EPT_QVOIDLTC    c                   x'19A7'
     d EPT_QVOIIFS     c                   x'19A8'
     d EPT_QVOIIPL     c                   x'19A9'
     d EPT_QVOILODC    c                   x'19AA'
     d EPT_QWCSSUJR    c                   x'19AB'
     d EPT_QVOIRMVE    c                   x'19AC'
     d EPT_QVOIVFYC    c                   x'19AD'
     d EPT_QWTAMDJS    c                   x'19AE'
     d EPT_QWTPCLIB    c                   x'19AF'
     d EPT_QYASPPGM    c                   x'19B0'
     d EPT_QYASPSETG   c                   x'19B1'
     d EPT_QJVAANZ     c                   x'19B2'
     d EPT_QJVAANZCL   c                   x'19B3'
     d EPT_QJVACHGPGM  c                   x'19B4'
     d EPT_QTHMCTLT    c                   x'19B5'
     d EPT_QTHMRTVL    c                   x'19B6'
     d EPT_QTRXRLRL    c                   x'19B7'
     d EPT_QTRXRLSA    c                   x'19B8'
     d EPT_QTRXRLSL    c                   x'19B9'
     d EPT_QDBSTCRS    c                   x'19BA'
     d EPT_QDBSTDS     c                   x'19BB'
     d EPT_QDBSTLDS    c                   x'19BC'
     d EPT_QDBSTLRS    c                   x'19BD'
     d EPT_QDBSTLS     c                   x'19BE'
     d EPT_QDBSTRS     c                   x'19BF'
     d EPT_QDBSTUS     c                   x'19C0'
     d EPT_QSPRILSP    c                   x'19C1'
     d EPT_QLGRTVDC    c                   x'19C2'
     d EPT_QYPEADDT    c                   x'19C3'
     d EPT_QYPEENDT    c                   x'19C4'
     d EPT_QYPELOGT    c                   x'19C5'
     d EPT_QYPESTRT    c                   x'19C6'
     d EPT_QDBCXRC     c                   x'19C7'
     d EPT_QLPACAGR    c                   x'19C8'
     d EPT_QPYRTJWA    c                   x'19C9'
     d EPT_QYDOSGNB    c                   x'19CA'
     d EPT_QYDOVFYB    c                   x'19CB'
     d EPT_QTARCGYL    c                   x'19CC'
     d EPT_QTARCTGI    c                   x'19CD'
     d EPT_QWCRLRQI    c                   x'19CE'
     d EPT_QP0LRRO     c                   x'19CF'
     d EPT_QTARTLBL    c                   x'19D0'
     d EPT_QP0LCHSG    c                   x'19D1'
     d EPT_QP0LRTSG    c                   x'19D2'
     d EPT_QTARCTGF    c                   x'19D3'
     d EPT_QTASCTGF    c                   x'19D4'
     d EPT_QFPADOLD    c                   x'19D5'
     d EPT_QFPADOLS    c                   x'19D6'
     d EPT_QFPADOLU    c                   x'19D7'
     d EPT_QGYCHGSJ    c                   x'19D8'
     d EPT_QGYCLST     c                   x'19D9'
     d EPT_QGYFNDE     c                   x'19DA'
     d EPT_QGYFNDF     c                   x'19DB'
     d EPT_QGYFNDME    c                   x'19DC'
     d EPT_QGYGTLE     c                   x'19DD'
     d EPT_QGYOLJBL    c                   x'19DE'
     d EPT_QGYOLJOB    c                   x'19DF'
     d EPT_QGYOLMSG    c                   x'19E0'
     d EPT_QGYOLOBJ    c                   x'19E1'
     d EPT_QEDRTVCI    c                   x'19E2'
     d EPT_QPDETPOL    c                   x'19E3'
     d EPT_QGYRTVSJ    c                   x'19E4'
     d EPT_QGYSETG     c                   x'19E5'
     d EPT_QWCADJTM    c                   x'19E6'
     d EPT_QWCOLTHD    c                   x'19E7'
     d EPT_QWCRTVTM    c                   x'19E8'
     d EPT_QWCRTVTZ    c                   x'19E9'
     d EPT_QWVOLACT    c                   x'19EA'
     d EPT_QWVOLAGP    c                   x'19EB'
     d EPT_QYASPOL     c                   x'19EC'
     d EPT_QEZOLBKL    c                   x'19ED'
     d EPT_QGYOLAFP    c                   x'19EE'
     d EPT_QGYOLAUS    c                   x'19EF'
     d EPT_QGYOLSPL    c                   x'19F0'
     d EPT_QGYRATLO    c                   x'19F1'
     d EPT_QGYRPRTA    c                   x'19F2'
     d EPT_QGYRPRTL    c                   x'19F3'
     d EPT_QGYRTVC     c                   x'19F4'
     d EPT_QPQAPME     c                   x'19F5'
     d EPT_QPQCRTPM    c                   x'19F6'
     d EPT_QPQDLTPM    c                   x'19F7'
     d EPT_QPQOLPM     c                   x'19F8'
     d EPT_QPQRPME     c                   x'19F9'
     d EPT_QP0ZOLIP    c                   x'19FA'
     d EPT_QJVACRTPGM  c                   x'19FB'
     d EPT_QJVACRTV    c                   x'19FC'
     d EPT_QJVADLTPGM  c                   x'19FD'
     d EPT_QJVADMPCL   c                   x'19FE'
     d EPT_QJVADP      c                   x'19FF'
     d EPT_QPMDMDLF    c                   x'1A00'
     d EPT_QP0ZGSEV    c                   x'1A01'
     d EPT_QCSTECSCPP  c                   x'1A02'
     d EPT_QCSTSCSCPP  c                   x'1A03'
     d EPT_QP0LMNTI    c                   x'1A04'
     d EPT_QQQVWDEP    c                   x'1A05'
     d EPT_QSQCLEAN    c                   x'1A06'
     d EPT_QWCRHDLK    c                   x'1A07'
     d EPT_QWCSRTAR    c                   x'1A08'
     d EPT_QLPCRLIC    c                   x'1A09'
     d EPT_QLPSWAGR    c                   x'1A0A'
     d EPT_QP0QIASPIN  c                   x'1A0B'
     d EPT_QP0QSETGRP  c                   x'1A0C'
     d EPT_QYASPCHK    c                   x'1A0D'
     d EPT_QDBXCA      c                   x'1A0E'
     d EPT_QDBXERCV    c                   x'1A0F'
     d EPT_QDBXESND    c                   x'1A10'
     d EPT_QDBXFVTR    c                   x'1A11'
     d EPT_QSRSVMD     c                   x'1A12'
     d EPT_QHSMCKJQ    c                   x'1A13'
     d EPT_QHSMCKLB    c                   x'1A14'
     d EPT_QHSMCKL2    c                   x'1A15'
     d EPT_QSYWRKPA    c                   x'1A16'
     d EPT_QHSMMVJQ    c                   x'1A17'
     d EPT_QTAHRMGR    c                   x'1A18'
     d EPT_QHSMSVRS    c                   x'1A19'
     d EPT_QSQCCATV    c                   x'1A1A'
     d EPT_QTIERSPT    c                   x'1A1B'
     d EPT_QTISRSPT    c                   x'1A1C'
     d EPT_QTIVPSPT    c                   x'1A1D'
     d EPT_QTNPWRAP    c                   x'1A1E'
     d EPT_QTOCASVR    c                   x'1A1F'
     d EPT_QTOCCSVR    c                   x'1A20'
     d EPT_QTOCCSVRP   c                   x'1A21'
     d EPT_QTOCPSVR    c                   x'1A22'
     d EPT_QTOCRSVR    c                   x'1A23'
     d EPT_QTONPING    c                   x'1A24'
     d EPT_QYPEADDFTR  c                   x'1A25'
     d EPT_QYPEADDP    c                   x'1A26'
     d EPT_QYPECHGP    c                   x'1A27'
     d EPT_QYPECRTP    c                   x'1A28'
     d EPT_QYPEDLTP    c                   x'1A29'
     d EPT_QYPESTRP    c                   x'1A2A'
     d EPT_QYPEWRKPEX  c                   x'1A2B'
     d EPT_QZDAXRL2    c                   x'1A2C'
     d EPT_QYPSCFGPC   c                   x'1A2D'
     d EPT_QYPSCFGPMT  c                   x'1A2E'
     d EPT_QYPSCHKPC   c                   x'1A2F'
     d EPT_QYPSENDPC   c                   x'1A30'
     d EPT_QYPSSTRPC   c                   x'1A31'
     d EPT_QDBXREFX    c                   x'1A32'
     d EPT_QGYCRTQ     c                   x'1A33'
     d EPT_QGYENDJB    c                   x'1A34'
     d EPT_QGYIEXIT    c                   x'1A35'
     d EPT_QGYLJBLX    c                   x'1A36'
     d EPT_QGYLJOBX    c                   x'1A37'
     d EPT_QGYLJOB3    c                   x'1A38'
     d EPT_QGYLOBJX    c                   x'1A39'
     d EPT_QGYLSRVR    c                   x'1A3A'
     d EPT_QGYLSTMX    c                   x'1A3B'
     d EPT_QGYSEXIT    c                   x'1A3C'
     d EPT_QGYSLST     c                   x'1A3D'
     d EPT_QWCCCHZC    c                   x'1A3E'
     d EPT_QWCCCRZC    c                   x'1A3F'
     d EPT_QWCCWRZC    c                   x'1A40'
     d EPT_QWCLTHDX    c                   x'1A41'
     d EPT_QWCSWRZR    c                   x'1A42'
     d EPT_QWCSXTZR    c                   x'1A43'
     d EPT_QYASPOLX    c                   x'1A44'
     d EPT_QYDOGTCL    c                   x'1A45'
     d EPT_QCLWHCMD    c                   x'1A46'
     d EPT_QGYLAUSX    c                   x'1A47'
     d EPT_QGYLSPLX    c                   x'1A48'
     d EPT_QJOEXIT1    c                   x'1A49'
     d EPT_QJORCVIF    c                   x'1A4A'
     d EPT_QLGICUIN    c                   x'1A4B'
     d EPT_QPQMAPX     c                   x'1A4C'
     d EPT_QPQYFDFZ    c                   x'1A4D'
     d EPT_QPQSIPT     c                   x'1A4E'
     d EPT_QPQYPDFZ    c                   x'1A4F'
     d EPT_QPQYPRFZ    c                   x'1A50'
     d EPT_QQURX       c                   x'1A51'
     d EPT_QSPLJBQX    c                   x'1A52'
     d EPT_QSYLVLEX    c                   x'1A53'
     d EPT_QEZPTDIR    c                   x'1A54'
     d EPT_QEZRTDIR    c                   x'1A55'
     d EPT_QJOCHGOB    c                   x'1A56'
     d EPT_QLGSSCRT    c                   x'1A57'
     d EPT_QLGSSINS    c                   x'1A58'
     d EPT_QRWSERR     c                   x'1A59'
     d EPT_QRWTERR     c                   x'1A5A'
     d EPT_QSCRJBTD    c                   x'1A5B'
     d EPT_QSCRJBTL    c                   x'1A5C'
     d EPT_QSYCHGFU    c                   x'1A5D'
     d EPT_QSYDSPFU    c                   x'1A5E'
     d EPT_QTQUSRCV    c                   x'1A5F'
     d EPT_QUHGCD      c                   x'1A60'
     d EPT_QWCAUPZE    c                   x'1A61'
     d EPT_QWCSRSZR    c                   x'1A62'
     d EPT_QJOCHGOR    c                   x'1A63'
     d EPT_QPQRCINP    c                   x'1A64'
     d EPT_QPQRCOID    c                   x'1A65'
     d EPT_QPQRCOUT    c                   x'1A66'
     d EPT_QPQRCSTG    c                   x'1A67'
     d EPT_QPQRCMSG    c                   x'1A68'
     d EPT_QPQXCONV    c                   x'1A69'
     d EPT_QSQCPOPM    c                   x'1A6A'
     d EPT_QSQMQTXT    c                   x'1A6B'
     d EPT_QSQWXLTR    c                   x'1A6C'
     d EPT_QSYCVTUC    c                   x'1A6D'
     d EPT_QTOTCONV    c                   x'1A6E'
     d EPT_QWCIHNZR    c                   x'1A6F'
     d EPT_QWCSHDZR    c                   x'1A70'
     d EPT_QWCSINZR    c                   x'1A71'
     d EPT_QWCSRTZR    c                   x'1A72'
     d EPT_QWPZIC      c                   x'1A73'
     d EPT_QPQRCTRC    c                   x'1A74'
     d EPT_QPQSIOBX    c                   x'1A75'
     d EPT_QPQYCF2Z    c                   x'1A76'
     d EPT_QPQYCVTZ    c                   x'1A77'
     d EPT_QSPDSPJ2    c                   x'1A78'
     d EPT_QS9OBSPR    c                   x'1A79'
     d EPT_QUSTRACE    c                   x'1A7A'
     d EPT_QWCEPGPR    c                   x'1A7B'
     d EPT_QWCEXPRE    c                   x'1A7C'
     d EPT_QWCSINDR    c                   x'1A7D'
     d EPT_QYASPEH     c                   x'1A7E'
     d EPT_QPQARSPL    c                   x'1A7F'
     d EPT_QPQMAPEXIT  c                   x'1A80'
     d EPT_QQQDBUDF    c                   x'1A81'
     d EPT_QTEESEPM    c                   x'1A82'
     d EPT_QSYEIMUP    c                   x'1A83'
     d EPT_QCDFNDSG    c                   x'1A84'
     d EPT_QFPASEIM    c                   x'1A85'
     d EPT_QPQRDOF     c                   x'1A86'
     d EPT_QP0ZOLSM    c                   x'1A87'
     d EPT_QSPOLJBQ    c                   x'1A88'
     d EPT_QSYOLUC     c                   x'1A89'
     d EPT_QSYOLVLE    c                   x'1A8A'
     d EPT_QYKMEXPK    c                   x'1A8B'
     d EPT_QYKMIMPK    c                   x'1A8C'
     d EPT_QFPADPNU    c                   x'1A8D'
     d EPT_QFPADRNI    c                   x'1A8E'
     d EPT_QFPADRUA    c                   x'1A8F'
     d EPT_QSYCHKTU    c                   x'1A90'
     d EPT_QSYCUPWD    c                   x'1A91'
     d EPT_QSYGENFT    c                   x'1A92'
     d EPT_QSYGENPT    c                   x'1A93'
     d EPT_QSYGETPT    c                   x'1A94'
     d EPT_QSYINVPT    c                   x'1A95'
     d EPT_QSYSETPT    c                   x'1A96'
     d EPT_QTNCLRLU    c                   x'1A97'
     d EPT_QTNRTNLU    c                   x'1A98'
     d EPT_QC3ADDSD    c                   x'1A99'
     d EPT_QC3CALDS    c                   x'1A9A'
     d EPT_QC3CALHA    c                   x'1A9B'
     d EPT_QC3CALHM    c                   x'1A9C'
     d EPT_QC3CALMA    c                   x'1A9D'
     d EPT_QC3CALSG    c                   x'1A9E'
     d EPT_QC3CRTAX    c                   x'1A9F'
     d EPT_QC3CRTKX    c                   x'1AA0'
     d EPT_QC3DECDT    c                   x'1AA1'
     d EPT_QC3DESAX    c                   x'1AA2'
     d EPT_QC3DESKX    c                   x'1AA3'
     d EPT_QC3ENCDT    c                   x'1AA4'
     d EPT_QC3GENDK    c                   x'1AA5'
     d EPT_QC3GENDP    c                   x'1AA6'
     d EPT_QC3GENPK    c                   x'1AA7'
     d EPT_QC3GENRN    c                   x'1AA8'
     d EPT_QC3GENSK    c                   x'1AA9'
     d EPT_QC3TRNDT    c                   x'1AAA'
     d EPT_QC3VFYSG    c                   x'1AAB'
     d EPT_QWCSETTM    c                   x'1AAC'
     d EPT_QDBXRCTX    c                   x'1AAD'
     d EPT_QSRRSTO     c                   x'1AAE'
     d EPT_QVOIRCLD    c                   x'1AAF'
     d EPT_QVOIRCLG    c                   x'1AB0'
     d EPT_QWTRMVJL    c                   x'1AB1'
     d EPT_QFPRLNWS    c                   x'1AB2'
     d EPT_QFPRRNWS    c                   x'1AB3'
     d EPT_QITDRSTS    c                   x'1AB4'
     d EPT_QSCEWCH     c                   x'1AB5'
     d EPT_QSCSWCH     c                   x'1AB6'
     d EPT_QWCCJITP    c                   x'1AB7'
     d EPT_QWCJBITP    c                   x'1AB8'
     d EPT_QSCRXMLI    c                   x'1AB9'
     d EPT_QEDCHGIN    c                   x'1ABA'
     d EPT_QPDETSND    c                   x'1ABB'
     d EPT_QSYCVTVL    c                   x'1ABC'
     d EPT_QC3CLRMK    c                   x'1ABD'
     d EPT_QC3CRTKS    c                   x'1ABE'
     d EPT_QC3DLTKR    c                   x'1ABF'
     d EPT_QC3EXPKY    c                   x'1AC0'
     d EPT_QC3GENKR    c                   x'1AC1'
     d EPT_QC3IMPKY    c                   x'1AC2'
     d EPT_QC3LDMKP    c                   x'1AC3'
     d EPT_QC3RTVKA    c                   x'1AC4'
     d EPT_QC3SETMK    c                   x'1AC5'
     d EPT_QC3TRNKS    c                   x'1AC6'
     d EPT_QC3TSTMK    c                   x'1AC7'
     d EPT_QC3WRTKR    c                   x'1AC8'
     d EPT_QTOCC4IF    c                   x'1AC9'
     d EPT_QYKMGDKI    c                   x'1ACA'
     d EPT_QTOCCVTI    c                   x'1ACB'
     d EPT_QC3EXTPB    c                   x'1ACC'
     d EPT_QWVAGSRV    c                   x'1ACD'
     d EPT_QPMDLPAR    c                   x'1ACE'
     d EPT_QPQYBLNZ    c                   x'1ACF'
     d EPT_QPQYENCZ    c                   x'1AD0'
     d EPT_QPQYENVZ    c                   x'1AD1'
     d EPT_QPQYEN2Z    c                   x'1AD2'
     d EPT_QPQYPPGZ    c                   x'1AD3'
     d EPT_QPQYPSGZ    c                   x'1AD4'
     d EPT_QPZQUSRX    c                   x'1AD5'
     d EPT_QSVRMEVH    c                   x'1AD6'
     d EPT_QSVRMEVJ    c                   x'1AD7'
     d EPT_QSVRMPRE    c                   x'1AD8'
     d EPT_QSVRMPRF    c                   x'1AD9'
     d EPT_QSVRMPRJ    c                   x'1ADA'
     d EPT_QWCAUPTM    c                   x'1ADB'
     d EPT_QWCSCHTR    c                   x'1ADC'
     d EPT_QWCSRTTR    c                   x'1ADE'
     d EPT_QDCCPNL     c                   x'1ADF'
     d EPT_QDCCPNLE    c                   x'1AE0'
     d EPT_QTAVTMGR    c                   x'1AE1'
     d EPT_QWCEPGPD    c                   x'1AE2'
     d EPT_QWCEXPWR    c                   x'1AE3'
     d EPT_QWCPJOBS    c                   x'1AE4'
     d EPT_QWCRSTNA    c                   x'1AE5'
     d EPT_QWCRSTSV    c                   x'1AE6'
     d EPT_QWCRTVNA    c                   x'1AE7'
     d EPT_QWCRTVSV    c                   x'1AE8'
     d EPT_QWCSHNJE    c                   x'1AE9'
     d EPT_QWCTJOBS    c                   x'1AEA'
     d EPT_QLSVPPKG    c                   x'1AEB'
     d EPT_QP0LCALLU   c                   x'1AEC'
     d EPT_QWTM2UTL    c                   x'1AED'
     d EPT_QSCTJOBA    c                   x'1AEE'
     d EPT_QWTPITP2    c                   x'1AEF'
     d EPT_QYYCDTCP    c                   x'1AF0'
     d EPT_QYYCTRAC    c                   x'1AF1'
     d EPT_QCLGSERR    c                   x'1AF2'
     d EPT_QCLSUBR     c                   x'1AF3'
     d EPT_QFPACHSG    c                   x'1AF4'
     d EPT_QHSMASPD    c                   x'1AF5'
     d EPT_QJOIMPJN    c                   x'1AF6'
     d EPT_QLERTVEXP   c                   x'1AF7'
     d EPT_QMOCLDFW    c                   x'1AF8'
     d EPT_QPZPTFOB    c                   x'1AF9'
     d EPT_QQQIOTMP    c                   x'1AFA'
     d EPT_QRCUSRP     c                   x'1AFB'
     d EPT_QRCUTRP     c                   x'1AFC'
     d EPT_QS9START    c                   x'1AFD'
     d EPT_QTQAPNDI    c                   x'1AFE'
     d EPT_QVOIWCGE    c                   x'1AFF'
     d EPT_QVOIWCLG    c                   x'1B00'
     d EPT_QCDCHGPRX   c                   x'1B01'
     d EPT_QCDCRTPRX   c                   x'1B02'
     d EPT_QCSTWRKCPP  c                   x'1B03'
     d EPT_QFPRPSTS    c                   x'1B04'
     d EPT_QJVADSPJVM  c                   x'1B05'
     d EPT_QPDETSRV    c                   x'1B06'
     d EPT_QPDIFS      c                   x'1B07'
     d EPT_QPZINSGR    c                   x'1B08'
     d EPT_QSRSYSINF   c                   x'1B09'
     d EPT_QTOCI6LI    c                   x'1B0A'
     d EPT_QTOCSSTCP6  c                   x'1B0B'
     d EPT_QVOICVRT    c                   x'1B0C'
     d EPT_QVOIHCLG    c                   x'1B0D'
     d EPT_QVOIHNDE    c                   x'1B0E'
     d EPT_QVOILODE    c                   x'1B0F'
     d EPT_QVOIPOP     c                   x'1B10'
     d EPT_QVOIPRV     c                   x'1B11'
     d EPT_QVOIRTVC    c                   x'1B12'
     d EPT_QWCJRENT    c                   x'1B13'
     d EPT_QWCSHNIE    c                   x'1B14'
     d EPT_QWTMCITH    c                   x'1B15'
     d EPT_QWTM2MTM    c                   x'1B16'
     d EPT_QWTM2STM    c                   x'1B17'
     d EPT_QDBXVFILR   c                   x'1B18'
     d EPT_QFLTJOB     c                   x'1B19'
     d EPT_QFPACGVA    c                   x'1B1A'
     d EPT_QFPHCHGD    c                   x'1B1B'
     d EPT_QIZAECVN    c                   x'1B1C'
     d EPT_QLICVTLB    c                   x'1B1D'
     d EPT_QSCIPLTR    c                   x'1B1E'
     d EPT_QBNMGLIC    c                   x'1B1F'
     d EPT_QDBERAPTRG  c                   x'1B20'
     d EPT_QLSVVARY    c                   x'1B21'
     d EPT_QSHRCASP    c                   x'1B22'
     d EPT_QSPWJLOG    c                   x'1B23'
     d EPT_QWCCWRGC    c                   x'1B24'
     d EPT_QWCSWRGR    c                   x'1B25'
     d EPT_QDBUIMUX    c                   x'1B26'
     d EPT_QLSVRHRI    c                   x'1B27'
     d EPT_QPQXSTAT    c                   x'1B28'
     d EPT_QPQXZDRV    c                   x'1B29'
     d EPT_QFLTOPM     c                   x'1B2A'
     d EPT_QTOCALIU    c                   x'1B2B'
     d EPT_QWTMAINT    c                   x'1B2C'
     d EPT_QYASPVRYPD  c                   x'1B2D'
     d EPT_QYASPWRKJB  c                   x'1B2E'
     d EPT_QSQCMTTCS   c                   x'1B2F'
     d EPT_QESCRTGR    c                   x'1B30'
     d EPT_QESECARE    c                   x'1B31'
     d EPT_QESLOGFX    c                   x'1B32'
     d EPT_QJORYIFS    c                   x'1B33'
     d EPT_QPQRMSP1    c                   x'1B34'
     d EPT_QPQSFCSP1   c                   x'1B35'
     d EPT_QPQYFD2Z    c                   x'1B36'
     d EPT_QESCPTFO    c                   x'1B59'

      /endif
