     /**
      * @file cbl003.cblle
      *
      * Test of the following computation instructions:
      *  - SETBTS
      */
       process
           NOMONOPRC.

       id division.
       program-id. cbl003.

       environment division.
       configuration section.
       special-names.
           copy mih-lnktyp.

       data division.
       working-storage section.

      * the hex content of str is x'8182'
       01 str pic x(2) value "ab".
       01 offset pic 9(9) usage comp-4 value 1.

       procedure division.
       main-pgm.

           display "str: " str.

      * set bits 1 and 9 of str
           call "_SETBTS" using
               by value address of str
               by value            offset.
           move 9 to offset.
           call "_SETBTS" using
               by value address of str
               by value            offset.

      * now, the hex content of str becomes x'C1C2' ('AB').
           display "str: " str.

       see-you.
           stop run.
