     /**
      * This file is part of i5/OS Programmer's Toolkit.
      *
      * Copyright (C) 2010, 2011  Junlei Li.
      *
      * i5/OS Programmer's Toolkit is free software: you can redistribute it and/or modify
      * it under the terms of the GNU General Public License as published by
      * the Free Software Foundation, either version 3 of the License, or
      * (at your option) any later version.
      *
      * i5/OS Programmer's Toolkit is distributed in the hope that it will be useful,
      * but WITHOUT ANY WARRANTY; without even the implied warranty of
      * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
      * GNU General Public License for more details.
      *
      * You should have received a copy of the GNU General Public License
      * along with i5/OS Programmer's Toolkit.  If not, see <http://www.gnu.org/licenses/>.
      */

     /**
      * @file cbl006.cblle
      *
      * Test of:
      *  - STRLENNULL
      *  - _CPYBYTES
      *
      * This example demonstrate how to handle input C-style
      * strings using the STRLENNULL and CPYBYTES instructions.
      */

       process
           NOMONOPRC.

       id division.
       program-id. cbl006.

       environment division.
       configuration section.
       special-names.
           copy mih-lnktyp.

       data division.
       working-storage section.
       01 msg pic x(32).
       01 msg-len pic 9(9) usage comp-4.

       linkage section.
       77 p-msg pic x(32).

       procedure division using p-msg.
       main-pgm.

           call "__strlen" using
                by reference p-msg
                returning into msg-len.

           call "_CPYBYTES" using
                by reference msg
                by reference p-msg
                by value msg-len.

           display msg.

           stop run.
       end program cbl006.
