     /**
      * This file is part of i5/OS Programmer's Toolkit.
      *
      * Copyright (C) 2010, 2011  Junlei Li.
      *
      * i5/OS Programmer's Toolkit is free software: you can redistribute it and/or modify
      * it under the terms of the GNU General Public License as published by
      * the Free Software Foundation, either version 3 of the License, or
      * (at your option) any later version.
      *
      * i5/OS Programmer's Toolkit is distributed in the hope that it will be useful,
      * but WITHOUT ANY WARRANTY; without even the implied warranty of
      * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
      * GNU General Public License for more details.
      *
      * You should have received a copy of the GNU General Public License
      * along with i5/OS Programmer's Toolkit.  If not, see <http://www.gnu.org/licenses/>.
      */

     /**
      * @file cbl010.cblle
      *
      * Test of:
      *  - _CMPPTRT (Compare Pointer Type)
      *
      * This program uses _CMPPTRT to test for null pointers.
      */

       process
           NOSTDTRUNC
           NOMONOPRC.

       id division.
       program-id. cbl010.

       environment division.
       configuration section.
       special-names.
           copy mih-lnktyp.

       data division.
       working-storage section.
           copy mih-comp.
           copy mih-ptr.

       01 str-ptr usage pointer.
       01 str     pic x(8) value "Spring".
       01 rtn     pic 9(9) usage binary.

       procedure division.
       main-pgm.
           perform check-null-ptr.

           set str-ptr to address of str.
           perform check-null-ptr.

           stop run.

      * test for null pointer
       check-null-ptr.
           call "_CMPPTRT" using
                by value x"00"
                by value str-ptr
                returning into rtn.
           if rtn is equal to 1
              then
              display "Null-pointer detected.".
           endif.

       end program cbl010.
