     /**
      * @file t122a.rpgle
      *
      * *SRVPGM used by t122.rpgle
      */
     h nomain

     d expdta          ds                  export
     d     estr                      16a   inz('All good wishes')
     d     eint                      10i 0 inz(7)
