     d la              pr                  extpgm('YY275')
     d     ts                        26a

     d la              pi
     d     ts                        26a

      /free
           ts = %char(%timestamp());

           *inlr = *on;
      /end-free
